{
    "file_name": "sites-i-chose-angelo-state.html",
    "title": "I Chose Angelo State",
    "description": "No Description",
    "meta_tags": {
        "viewport": "width=device-width, initial-scale=1",
        "generator": "LiveWhale",
        "og:title": "I Chose Angelo State",
        "og:type": "website",
        "og:url": "https://www.angelo.edu/i-chose-angelo-state/",
        "pagename": "I Chose Angelo State",
        "og:image": "https://www.angelo.edu/live/image/gid/315/width/1260/height/630/crop/1/src_region/827,0,3317,1492/51426_DSC_7205.rev.1668635423.jpg",
        "og:image:secure_url": "https://www.angelo.edu/live/image/gid/315/width/1260/height/630/crop/1/src_region/827,0,3317,1492/51426_DSC_7205.rev.1668635423.jpg",
        "og:image:width": "1260",
        "og:image:height": "630",
        "twitter:card": "summary_large_image",
        "twitter:title": "I Chose Angelo State",
        "twitter:image": "https://www.angelo.edu/live/image/gid/315/width/1260/height/630/crop/1/src_region/827,0,3317,1492/51426_DSC_7205.rev.1668635423.jpg",
        "lw-template-updated": "02/13/2024 02:26pm CST"
    },
    "headings": [
        "I Chose Angelo State",
        "Quick Links",
        "Information For",
        "We want to hear why you choseAngelo State!",
        "Alumni Spotlight",
        "Make an Impact",
        "Join In",
        "Hashtag",
        "Social Media Cover Photos",
        "Go as a Ram."
    ],
    "paragraphs": [
        "",
        "Celebrate I Chose Angelo State week in April!",
        "Whether you’re a new student, current student, faculty or staff member, alumni or friend of ASU, we want to showcase everything Angelo State has to offer.",
        "“I chose Angelo State because when I toured the campus, the environment was very welcoming.”",
        "Chasity Lopez, Class of 2024, Exercise Science",
        "“I chose Angelo State because of the atmosphere and opportunities.”",
        "Michelle Underwood, Class of 2023, Business Marketing",
        "“I chose Angelo State because of the kind people, welcoming atmosphere, and the amazing professors.”",
        "Taylor Brasher, Class of 2024, Commercial Aviation",
        "“I chose Angelo State because it feels like home.”",
        "Reilly Amsler, Education, Early Childhood - 6 Generalist with ECH-12 Special Ed, Class of 2026",
        "Share Your Story",
        "“You can fulfill your potential here and be certain that when you walk the stage at graduation, there are no regrets - because you chose Angelo State University.”",
        "“The RAM culture speaks for itself; loyal, supportive, and timeless. I am so proud to be an ASU alum and be able to share my RAM Pride with generations of RAMS!”",
        "“I am forever grateful for the opportunities that were given to me as a student and now, as a faculty member, I can make that same difference in the life of someone else.”",
        "“I forged life-long friends and was able to be part of a professional fraternity called Delta Sigma Pi.”",
        "“Coming back to campus is one of my favorite things to do, because it feels like I am coming home to family. This makes me immensely proud to call myself an ASU Ram!”",
        "“I wanted to participate in Air Force ROTC and ASU allowed me the opportunity to do so in my hometown near family and friends. ASU turned out to be the perfect choice for me.”",
        "“I chose Angelo State because of the atmosphere I felt walking on campus. It felt like home.”",
        "“I chose Angelo State because the professors, students and employees foster an environment that creates excellent professionals and, more importantly, amazing people.”",
        "“My college education was self-funded, so I chose Angelo State because it offered me the best opportunity to earn a high-quality computer science degree at an affordable cost.”",
        "“ASU cares about its students. I owe my success to the foundation that ASU put in place.”",
        "“I chose ASU because they make it easier to be a single mother working a full-time job.”",
        "“My own orientation left such a profound impact that in subsequent years when I became a Resident Assistant, I always wanted to have some role to welcome future ones on the first day of campus.”",
        "“My experiences as an undergrad at Angelo State have significantly influenced the trajectory of my life.”",
        "“Angelo State made me feel at home the moment I stepped onto campus. There is something special about the feeling you get when touring ASU and seeing yourself living the life of a Ram or Rambelle.”",
        "“I am proud to be an ASU Alum because of the commitment it has made to become a more diverse campus community to better serve students in West Texas.”",
        "“The faculty in my program were personally invested in my success and provided every opportunity to promote my professional involvement in our field.”",
        "“Angelo State is a place where people go to grow, develop and learn.”",
        "“This little campus appears innocuous due to its size and location, but it is teeming with brilliant professors, dedicated staff, and a real family atmosphere.”",
        "“I chose ASU because I knew I would be provided with educational and work opportunities that would not be possible elsewhere.”",
        "“I was given a phenomenal education and had the time of my life!”",
        "“It is great to be a part of a family with fellow students who actually care about you all over the world.”",
        "“I am proud to be an ASU Alum because of the amazing career opportunities it offered me. ASU opened the door for me.”",
        "“We wouldn’t be where we are today without ASU. And not just for the education, but also for the lasting friendships and that feeling of family.”",
        "“I made many life-long friends with fellow students, teammates and professors.”",
        "“I chose ASU because of it’s size and the quality of education.”",
        "“There are so many scholarship opportunities that give you the chance to graduate debt-free. Students come from all over because they recognize the value of ASU.”",
        "“ASU was a place I could be both a student and athlete and not have to compromise success in my academic or athletic career for the other - I could have both!”",
        "“Angelo State University offered a rigorous curriculum that I felt would prepare me well for my future career path.”",
        "“ASU was and is home. I personally knew all of my professors, and I felt like more than just a ‘number.’ I enjoyed all of the extra-curricular activities and groups where I made lifelong friends.”",
        "“ASU prepared me very well for my next stage in life. I’m proud of the academics I learned and of the soft skills I learned in extra-curricular activities.”",
        "“I chose ASU because I wanted to go to a college where my professors would know my name and build relationships with me.”",
        "“It was home away from home. There’s no better place to be other than Angelo State. Go Rams!”",
        "“I’m more than happy that #IChoseAngeloState, and I’m a proud graduate of the class of 1990! Go Rams!”",
        "“The education and social experiences I received built a solid foundation to prepare me for the workforce and uncovered new interests and goals that I had never considered.”",
        "“A degree from Angelo State University provided me with my first opportunity in leadership management.”",
        "“When I first came to ASU as an undergrad, I never knew how my life would change forever through the interactions with my professors, coaches, friends and administrators.”",
        "“Not only was ASU close to home, but it had the right size for me and gave me the ability to develop myself and allow myself to grow.”",
        "“Angelo State is a respected and nationally recognized university. I am so proud of its growth and the opportunities available for the current students.”",
        "“I am a proud ASU alum because every experience I encountered prepared me for the diverse experiences I encountered in my career.”",
        "“Angelo State is full of kind, hard working and successful people. I am honored to have been given the opportunity to represent such an amazing community and school!”",
        "“RAM FAM is not just a saying, it is a true sentiment. I look forward to introducing the next generation to the values of Angelo State University!”",
        "“I received a game changing education that gave me a competitive advantage + the confidence to excel in my career journey.”",
        "“Despite being from out of town, I felt instantly welcomed the moment I set foot on campus.”",
        "“I chose Angelo State because I knew it would be a place where I could develop my own identity. I found my likes and dislikes, hobbies and passions. I learned a lot about myself.”",
        "“As an international student I wanted to attend a trustworthy university with a verifiable legacy and hometown feeling in a suburban location. ASU ticked all the boxes!”",
        "“The small class sizes and personable professors made Angelo State the perfect choice for me.”",
        "“I knew I was getting a top-notch education while also making many friends all from different backgrounds.”",
        "“ASU offered me a scholarship to play football while attending classes and completing my undergraduate degree.”",
        "“I chose Angelo State because I could receive an individualized superlative education from full professors at a fraction of the cost of other institutions.”",
        "“When I applied to ASU I was hoping for the ultimate college experience, little did I know that graduating debt free would be included as well!”",
        "“I had great professors who were very eager to help at any time.”",
        "“I chose Angelo State because I was attracted to the welcoming and diverse community, proximity to my family, multiple opportunities to get involved and the amazing faculty.”",
        "“I chose ASU because it’s a family tradition. My grandfather was here, my parents went here, my brothers went here. It’s part of our family, and I feel like I was born with blue and gold in my blood.”",
        "“I chose ASU because the welcoming and intimate atmosphere offered was the perfect fit for me.”",
        "“I am proud to see Angelo State constantly moving forward and creating opportunities for students, and I am proud to see and learn of the amazing things our alumni are accomplishing in their fields.”",
        "“Not only does ASU support their students financially, but throughout the entire campus, from the AMAZING professors to thriving organizations. I couldn’t have chose a better university.”",
        "“I chose ASU because it allowed me to start my career in healthcare early while going to school.”",
        "“I chose ASU because the professors want to see you succeed and are willing to help you no matter what!”",
        "“I chose Angelo State because of the amazing faculty and staff who took me in and made me feel at home.”",
        "“I only applied to one college, was accepted, and graduated ASU with a degree in applied physics. I’m proud to tell people that ASU now has a great engineering program.”",
        "“My grandmother was an alumna of San Angelo College in the late 30s and early 40s. She was excited when she learned of my choice to join the Ram Family. I have never regretted the decision!”",
        "“I chose Angelo State because the faculty, staff and fellow students helped me fit in. The professors were always willing to help me better myself.”",
        "“I chose ASU because it’s a family tradition. My grandfather was here, my parents went here, my brothers went here. It’s part of our family, and I feel like I was born with blue and gold in my blood.”",
        "“I chose Angelo State because of the atmosphere I felt walking on campus. It felt like home.”",
        "“ASU offered me a scholarship to play football while attending classes and completing my undergraduate degree.”",
        "“My grandmother was an alumna of San Angelo College in the late 30s and early 40s. She was excited when she learned of my choice to join the Ram Family. I have never regretted the decision!”",
        "“As an international student I wanted to attend a trustworthy university with a verifiable legacy and hometown feeling in a suburban location. ASU ticked all the boxes!”",
        "“Angelo State University offered a rigorous curriculum that I felt would prepare me well for my future career path.”",
        "“My college education was self-funded, so I chose Angelo State because it offered me the best opportunity to earn a high-quality computer science degree at an affordable cost.”",
        "“The small class sizes and personable professors made Angelo State the perfect choice for me.”",
        "“ASU was and is home. I personally knew all of my professors, and I felt like more than just a ‘number.’ I enjoyed all of the extra-curricular activities and groups where I made lifelong friends.”",
        "“I chose ASU because the welcoming and intimate atmosphere offered was the perfect fit for me.”",
        "“ASU prepared me very well for my next stage in life. I’m proud of the academics I learned and of the soft skills I learned in extra-curricular activities.”",
        "“I chose Angelo State because the faculty, staff and fellow students helped me fit in. The professors were always willing to help me better myself.”",
        "“The RAM culture speaks for itself; loyal, supportive, and timeless. I am so proud to be an ASU alum and be able to share my RAM Pride with generations of RAMS!”",
        "“We wouldn’t be where we are today without ASU. And not just for the education, but also for the lasting friendships and that feeling of family.”",
        "“I had great professors who were very eager to help at any time.”",
        "“Angelo State is a respected and nationally recognized university. I am so proud of its growth and the opportunities available for the current students.”",
        "“I made many life-long friends with fellow students, teammates and professors.”",
        "“I’m more than happy that #IChoseAngeloState, and I’m a proud graduate of the class of 1990! Go Rams!”",
        "“I wanted to participate in Air Force ROTC and ASU allowed me the opportunity to do so in my hometown near family and friends. ASU turned out to be the perfect choice for me.”",
        "“I chose Angelo State because of the amazing faculty and staff who took me in and made me feel at home.”",
        "“I am forever grateful for the opportunities that were given to me as a student and now, as a faculty member, I can make that same difference in the life of someone else.”",
        "“When I applied to ASU I was hoping for the ultimate college experience, little did I know that graduating debt free would be included as well!”",
        "“I was given a phenomenal education and had the time of my life!”",
        "“Coming back to campus is one of my favorite things to do, because it feels like I am coming home to family. This makes me immensely proud to call myself an ASU Ram!”",
        "“I chose ASU because the professors want to see you succeed and are willing to help you no matter what!”",
        "“I chose Angelo State because I was attracted to the welcoming and diverse community, proximity to my family, multiple opportunities to get involved and the amazing faculty.”",
        "“Angelo State made me feel at home the moment I stepped onto campus. There is something special about the feeling you get when touring ASU and seeing yourself living the life of a Ram or Rambelle.”",
        "“I knew I was getting a top-notch education while also making many friends all from different backgrounds.”",
        "“Not only does ASU support their students financially, but throughout the entire campus, from the AMAZING professors to thriving organizations. I couldn’t have chose a better university.”",
        "“I am a proud ASU alum because every experience I encountered prepared me for the diverse experiences I encountered in my career.”",
        "“The education and social experiences I received built a solid foundation to prepare me for the workforce and uncovered new interests and goals that I had never considered.”",
        "“This little campus appears innocuous due to its size and location, but it is teeming with brilliant professors, dedicated staff, and a real family atmosphere.”",
        "“The faculty in my program were personally invested in my success and provided every opportunity to promote my professional involvement in our field.”",
        "“I chose ASU because I knew I would be provided with educational and work opportunities that would not be possible elsewhere.”",
        "“ASU was a place I could be both a student and athlete and not have to compromise success in my academic or athletic career for the other - I could have both!”",
        "“ASU cares about its students. I owe my success to the foundation that ASU put in place.”",
        "“I forged life-long friends and was able to be part of a professional fraternity called Delta Sigma Pi.”",
        "“I chose ASU because they make it easier to be a single mother working a full-time job.”",
        "“I am proud to see Angelo State constantly moving forward and creating opportunities for students, and I am proud to see and learn of the amazing things our alumni are accomplishing in their fields.”",
        "“You can fulfill your potential here and be certain that when you walk the stage at graduation, there are no regrets - because you chose Angelo State University.”",
        "“I chose ASU because of it’s size and the quality of education.”",
        "“My own orientation left such a profound impact that in subsequent years when I became a Resident Assistant, I always wanted to have some role to welcome future ones on the first day of campus.”",
        "“It is great to be a part of a family with fellow students who actually care about you all over the world.”",
        "“I chose ASU because I wanted to go to a college where my professors would know my name and build relationships with me.”",
        "“Not only was ASU close to home, but it had the right size for me and gave me the ability to develop myself and allow myself to grow.”",
        "“Despite being from out of town, I felt instantly welcomed the moment I set foot on campus.”",
        "“A degree from Angelo State University provided me with my first opportunity in leadership management.”",
        "“There are so many scholarship opportunities that give you the chance to graduate debt-free. Students come from all over because they recognize the value of ASU.”",
        "“I only applied to one college, was accepted, and graduated ASU with a degree in applied physics. I’m proud to tell people that ASU now has a great engineering program.”",
        "“I chose Angelo State because the professors, students and employees foster an environment that creates excellent professionals and, more importantly, amazing people.”",
        "“I chose Angelo State because I knew it would be a place where I could develop my own identity. I found my likes and dislikes, hobbies and passions. I learned a lot about myself.”",
        "“I chose ASU because it allowed me to start my career in healthcare early while going to school.”",
        "“RAM FAM is not just a saying, it is a true sentiment. I look forward to introducing the next generation to the values of Angelo State University!”",
        "“Angelo State is a place where people go to grow, develop and learn.”",
        "“Angelo State is full of kind, hard working and successful people. I am honored to have been given the opportunity to represent such an amazing community and school!”",
        "“I chose Angelo State because I could receive an individualized superlative education from full professors at a fraction of the cost of other institutions.”",
        "“I am proud to be an ASU Alum because of the amazing career opportunities it offered me. ASU opened the door for me.”",
        "“I am proud to be an ASU Alum because of the commitment it has made to become a more diverse campus community to better serve students in West Texas.”",
        "“I received a game changing education that gave me a competitive advantage + the confidence to excel in my career journey.”",
        "“When I first came to ASU as an undergrad, I never knew how my life would change forever through the interactions with my professors, coaches, friends and administrators.”",
        "“My experiences as an undergrad at Angelo State have significantly influenced the trajectory of my life.”",
        "“It was home away from home. There’s no better place to be other than Angelo State. Go Rams!”",
        "“The faculty in my program were personally invested in my success and provided every opportunity to promote my professional involvement in our field.”",
        "“ASU offered me a scholarship to play football while attending classes and completing my undergraduate degree.”",
        "“My grandmother was an alumna of San Angelo College in the late 30s and early 40s. She was excited when she learned of my choice to join the Ram Family. I have never regretted the decision!”",
        "“I was given a phenomenal education and had the time of my life!”",
        "“The education and social experiences I received built a solid foundation to prepare me for the workforce and uncovered new interests and goals that I had never considered.”",
        "“I knew I was getting a top-notch education while also making many friends all from different backgrounds.”",
        "“Not only was ASU close to home, but it had the right size for me and gave me the ability to develop myself and allow myself to grow.”",
        "“I am proud to see Angelo State constantly moving forward and creating opportunities for students, and I am proud to see and learn of the amazing things our alumni are accomplishing in their fields.”",
        "“It is great to be a part of a family with fellow students who actually care about you all over the world.”",
        "“I had great professors who were very eager to help at any time.”",
        "“I chose Angelo State because the faculty, staff and fellow students helped me fit in. The professors were always willing to help me better myself.”",
        "“I am a proud ASU alum because every experience I encountered prepared me for the diverse experiences I encountered in my career.”",
        "“I chose ASU because it allowed me to start my career in healthcare early while going to school.”",
        "“RAM FAM is not just a saying, it is a true sentiment. I look forward to introducing the next generation to the values of Angelo State University!”",
        "“I chose ASU because I wanted to go to a college where my professors would know my name and build relationships with me.”",
        "“There are so many scholarship opportunities that give you the chance to graduate debt-free. Students come from all over because they recognize the value of ASU.”",
        "“The small class sizes and personable professors made Angelo State the perfect choice for me.”",
        "“We wouldn’t be where we are today without ASU. And not just for the education, but also for the lasting friendships and that feeling of family.”",
        "“As an international student I wanted to attend a trustworthy university with a verifiable legacy and hometown feeling in a suburban location. ASU ticked all the boxes!”",
        "“When I applied to ASU I was hoping for the ultimate college experience, little did I know that graduating debt free would be included as well!”",
        "“I am proud to be an ASU Alum because of the amazing career opportunities it offered me. ASU opened the door for me.”",
        "“I chose ASU because of it’s size and the quality of education.”",
        "“When I first came to ASU as an undergrad, I never knew how my life would change forever through the interactions with my professors, coaches, friends and administrators.”",
        "“Coming back to campus is one of my favorite things to do, because it feels like I am coming home to family. This makes me immensely proud to call myself an ASU Ram!”",
        "“Angelo State is full of kind, hard working and successful people. I am honored to have been given the opportunity to represent such an amazing community and school!”",
        "“I am forever grateful for the opportunities that were given to me as a student and now, as a faculty member, I can make that same difference in the life of someone else.”",
        "“A degree from Angelo State University provided me with my first opportunity in leadership management.”",
        "“My college education was self-funded, so I chose Angelo State because it offered me the best opportunity to earn a high-quality computer science degree at an affordable cost.”",
        "“ASU was a place I could be both a student and athlete and not have to compromise success in my academic or athletic career for the other - I could have both!”",
        "“I chose Angelo State because of the amazing faculty and staff who took me in and made me feel at home.”",
        "“I wanted to participate in Air Force ROTC and ASU allowed me the opportunity to do so in my hometown near family and friends. ASU turned out to be the perfect choice for me.”",
        "“This little campus appears innocuous due to its size and location, but it is teeming with brilliant professors, dedicated staff, and a real family atmosphere.”",
        "“ASU cares about its students. I owe my success to the foundation that ASU put in place.”",
        "“ASU prepared me very well for my next stage in life. I’m proud of the academics I learned and of the soft skills I learned in extra-curricular activities.”",
        "“It was home away from home. There’s no better place to be other than Angelo State. Go Rams!”",
        "“I chose Angelo State because I could receive an individualized superlative education from full professors at a fraction of the cost of other institutions.”",
        "“Not only does ASU support their students financially, but throughout the entire campus, from the AMAZING professors to thriving organizations. I couldn’t have chose a better university.”",
        "“ASU was and is home. I personally knew all of my professors, and I felt like more than just a ‘number.’ I enjoyed all of the extra-curricular activities and groups where I made lifelong friends.”",
        "“My own orientation left such a profound impact that in subsequent years when I became a Resident Assistant, I always wanted to have some role to welcome future ones on the first day of campus.”",
        "“I chose ASU because it’s a family tradition. My grandfather was here, my parents went here, my brothers went here. It’s part of our family, and I feel like I was born with blue and gold in my blood.”",
        "“Angelo State made me feel at home the moment I stepped onto campus. There is something special about the feeling you get when touring ASU and seeing yourself living the life of a Ram or Rambelle.”",
        "“I chose Angelo State because I was attracted to the welcoming and diverse community, proximity to my family, multiple opportunities to get involved and the amazing faculty.”",
        "“I forged life-long friends and was able to be part of a professional fraternity called Delta Sigma Pi.”",
        "“I chose Angelo State because I knew it would be a place where I could develop my own identity. I found my likes and dislikes, hobbies and passions. I learned a lot about myself.”",
        "“I am proud to be an ASU Alum because of the commitment it has made to become a more diverse campus community to better serve students in West Texas.”",
        "“I only applied to one college, was accepted, and graduated ASU with a degree in applied physics. I’m proud to tell people that ASU now has a great engineering program.”",
        "“You can fulfill your potential here and be certain that when you walk the stage at graduation, there are no regrets - because you chose Angelo State University.”",
        "“Angelo State is a place where people go to grow, develop and learn.”",
        "“I’m more than happy that #IChoseAngeloState, and I’m a proud graduate of the class of 1990! Go Rams!”",
        "“The RAM culture speaks for itself; loyal, supportive, and timeless. I am so proud to be an ASU alum and be able to share my RAM Pride with generations of RAMS!”",
        "“I received a game changing education that gave me a competitive advantage + the confidence to excel in my career journey.”",
        "“I chose Angelo State because of the atmosphere I felt walking on campus. It felt like home.”",
        "“I made many life-long friends with fellow students, teammates and professors.”",
        "“I chose Angelo State because the professors, students and employees foster an environment that creates excellent professionals and, more importantly, amazing people.”",
        "“Angelo State University offered a rigorous curriculum that I felt would prepare me well for my future career path.”",
        "“Angelo State is a respected and nationally recognized university. I am so proud of its growth and the opportunities available for the current students.”",
        "“Despite being from out of town, I felt instantly welcomed the moment I set foot on campus.”",
        "“I chose ASU because the welcoming and intimate atmosphere offered was the perfect fit for me.”",
        "“I chose ASU because I knew I would be provided with educational and work opportunities that would not be possible elsewhere.”",
        "“I chose ASU because they make it easier to be a single mother working a full-time job.”",
        "“My experiences as an undergrad at Angelo State have significantly influenced the trajectory of my life.”",
        "“I chose ASU because the professors want to see you succeed and are willing to help you no matter what!”",
        "Your gift to Angelo State makes a difference in the lives of the Ram Family.",
        "Give to Angelo State",
        "Connect with us on social media!",
        "Use our hashtag#IChoseAngeloState.",
        "Download our I Chose Angelo State cover photo for your profile.",
        "If you want to go fast, go alone. But if you want to go far, go together.",
        "ApplyVisit UsRequest Info"
    ],
    "list_items": [
        "AcademicsAcademic ProgramsDepartmentsCollegesCoursesAcademic Calendar",
        "Academic Programs",
        "Departments",
        "Colleges",
        "Courses",
        "Academic Calendar",
        "About ASUHistoryCore ValuesNewsTraditionsAbout San AngeloWelcome from the PresidentMission Statement",
        "History",
        "Core Values",
        "News",
        "Traditions",
        "About San Angelo",
        "Welcome from the President",
        "Mission Statement",
        "Admissions & AidApply to ASUAdmitted StudentsRequest More InformationVisit Angelo State UniversityPaying for College",
        "Apply to ASU",
        "Admitted Students",
        "Request More Information",
        "Visit Angelo State University",
        "Paying for College",
        "Life on CampusLivePlayLeadWorkExplore",
        "Live",
        "Play",
        "Lead",
        "Work",
        "Explore",
        "CommunityASU Mayer MuseumAlumni AssociationSmall Business Development CenterWest Texas CollectionNatural History CollectionsKay Bailey Hutchison Center for Cyber Intelligence, Innovation, and Security StudiesLaura W. Bush Institute for Women’s HealthArts at ASUPlanetariumStephens ChapelRanch and Meat MarketASU Ticket OfficeSummer Camps and Conferences",
        "ASU Mayer Museum",
        "Alumni Association",
        "Small Business Development Center",
        "West Texas Collection",
        "Natural History Collections",
        "Kay Bailey Hutchison Center for Cyber Intelligence, Innovation, and Security Studies",
        "Laura W. Bush Institute for Women’s Health",
        "Arts at ASU",
        "Planetarium",
        "Stephens Chapel",
        "Ranch and Meat Market",
        "ASU Ticket Office",
        "Summer Camps and Conferences",
        "Give to ASUMake a GiftSignature EventsJoin",
        "Make a Gift",
        "Signature Events",
        "Join",
        "Athletics",
        "RamPort",
        "Library",
        "Bookstore",
        "Events",
        "Public Health Updates",
        "Administration",
        "Research",
        "Mental Health Services",
        "Title IX/Incident Report",
        "En Español",
        "Current Students",
        "Faculty & Staff",
        "Admitted Students",
        "Military",
        "Parents & Families",
        "Alumni",
        "Visitors",
        "School Counselors",
        "Online Students",
        "“I chose Angelo State because when I toured the campus, the environment was very welcoming.”Chasity Lopez, Class of 2024, Exercise Science",
        "“I chose Angelo State because of the atmosphere and opportunities.”Michelle Underwood, Class of 2023, Business Marketing",
        "“I chose Angelo State because of the kind people, welcoming atmosphere, and the amazing professors.”Taylor Brasher, Class of 2024, Commercial Aviation",
        "“I chose Angelo State because it feels like home.”Reilly Amsler, Education, Early Childhood - 6 Generalist with ECH-12 Special Ed, Class of 2026",
        "“You can fulfill your potential here and be certain that when you walk the stage at graduation, there are no regrets - because you chose Angelo State University.”Dr. Gayle RandallAssistant Professor of Marketing, Class of 1990 and 1991",
        "“The RAM culture speaks for itself; loyal, supportive, and timeless. I am so proud to be an ASU alum and be able to share my RAM Pride with generations of RAMS!”Beth SimmonsClass of 2019",
        "“I am forever grateful for the opportunities that were given to me as a student and now, as a faculty member, I can make that same difference in the life of someone else.”Dr. Gayle RandallAssistant Professor of Marketing, Class of 1990 and 1991",
        "“I forged life-long friends and was able to be part of a professional fraternity called Delta Sigma Pi.”Eligio AcostaCommercial Banking, Class of 1993",
        "“Coming back to campus is one of my favorite things to do, because it feels like I am coming home to family. This makes me immensely proud to call myself an ASU Ram!”Jarett LujanHigher Education Research, Class of 2016, 2017, 2019",
        "“I wanted to participate in Air Force ROTC and ASU allowed me the opportunity to do so in my hometown near family and friends. ASU turned out to be the perfect choice for me.”Anton MalkowskiChief of Staff for Business Operations, U.S. Forest Service, Class of 2003",
        "“I chose Angelo State because of the atmosphere I felt walking on campus. It felt like home.”Stephanie InfanteOrchestra Director, Class of 2017",
        "“I chose Angelo State because the professors, students and employees foster an environment that creates excellent professionals and, more importantly, amazing people.”Paige SmithB.B.A. & M.P.Ac, Class of 2020",
        "“My college education was self-funded, so I chose Angelo State because it offered me the best opportunity to earn a high-quality computer science degree at an affordable cost.”Bryan HeflinOwner, Best Made Designs, LLC, Class of 1987",
        "“ASU cares about its students. I owe my success to the foundation that ASU put in place.”Taimur KhanVice President Business Development and Strategy, Class of 1992",
        "“I chose ASU because they make it easier to be a single mother working a full-time job.”Ashley DeLuna CorbettClass of 2022",
        "“My own orientation left such a profound impact that in subsequent years when I became a Resident Assistant, I always wanted to have some role to welcome future ones on the first day of campus.”Taimur KhanVice President Business Development and Strategy, Class of 1992",
        "“My experiences as an undergrad at Angelo State have significantly influenced the trajectory of my life.”Alex BryantProject Manager, Class of 2014",
        "“Angelo State made me feel at home the moment I stepped onto campus. There is something special about the feeling you get when touring ASU and seeing yourself living the life of a Ram or Rambelle.”Jarett LujanHigher Education Research, Class of 2016, 2017, 2019",
        "“I am proud to be an ASU Alum because of the commitment it has made to become a more diverse campus community to better serve students in West Texas.”Lydia BuenoAssistant Dean of Strategic Enrollment and Student Life, Honors College at The University of Texas at San Antonio, Class of 2005, 2010",
        "“The faculty in my program were personally invested in my success and provided every opportunity to promote my professional involvement in our field.”Heidi MoyerDoctor of Physical Therapy, Adjunct Professor, Class of 2016",
        "“Angelo State is a place where people go to grow, develop and learn.”Henry JacksonPresident, Buckner Children Family Services, Class of 1994",
        "“This little campus appears innocuous due to its size and location, but it is teeming with brilliant professors, dedicated staff, and a real family atmosphere.”Heidi MoyerDoctor of Physical Therapy, Adjunct Professor, Class of 2016",
        "“I chose ASU because I knew I would be provided with educational and work opportunities that would not be possible elsewhere.”Hanne CampbellPolitical Science, Class of 2024",
        "“I was given a phenomenal education and had the time of my life!”Taylor De La GarzaLending Assistant, Class of 2017",
        "“It is great to be a part of a family with fellow students who actually care about you all over the world.”John DelkClass of 1996",
        "“I am proud to be an ASU Alum because of the amazing career opportunities it offered me. ASU opened the door for me.”Shae HopfICU BSN RN, Class of 2018",
        "“We wouldn’t be where we are today without ASU. And not just for the education, but also for the lasting friendships and that feeling of family.”Laura ScottClass of 2002, B.A. in Communication",
        "“I made many life-long friends with fellow students, teammates and professors.”Cody DanaherAthletic Director and Head Football Coach at Calallen ISD, Class of 1971",
        "“I chose ASU because of it’s size and the quality of education.”Kelan GriffinClass of 1992",
        "“There are so many scholarship opportunities that give you the chance to graduate debt-free. Students come from all over because they recognize the value of ASU.”Laura ScottClass of 2002, B.A. in Communication",
        "“ASU was a place I could be both a student and athlete and not have to compromise success in my academic or athletic career for the other - I could have both!”Katie LightFamily Medicine Physician, Class of 2016",
        "“Angelo State University offered a rigorous curriculum that I felt would prepare me well for my future career path.”Caleb VosburgPhysician, Class of 1998 and 2001",
        "“ASU was and is home. I personally knew all of my professors, and I felt like more than just a ‘number.’ I enjoyed all of the extra-curricular activities and groups where I made lifelong friends.”Kate BarnettDoctor of Physical Therapy, Class of 2012",
        "“ASU prepared me very well for my next stage in life. I’m proud of the academics I learned and of the soft skills I learned in extra-curricular activities.”Travis BarnettCEO, Centerline Engineering & Consulting. Class of 2012",
        "“I chose ASU because I wanted to go to a college where my professors would know my name and build relationships with me.”Rachel RiggsClass of 2014 and 2016",
        "“It was home away from home. There’s no better place to be other than Angelo State. Go Rams!”Henry JacksonPresident, Buckner Children Family Services, Class of 1994",
        "“I’m more than happy that #IChoseAngeloState, and I’m a proud graduate of the class of 1990! Go Rams!”Paula LarezClass of 1990",
        "“The education and social experiences I received built a solid foundation to prepare me for the workforce and uncovered new interests and goals that I had never considered.”Alex BryantProject Manager, Class of 2014",
        "“A degree from Angelo State University provided me with my first opportunity in leadership management.”Henry JacksonPresident, Buckner Children Family Services, Class of 1994",
        "“When I first came to ASU as an undergrad, I never knew how my life would change forever through the interactions with my professors, coaches, friends and administrators.”Dr. Gayle RandallAssistant Professor of Marketing, Class of 1990 and 1991",
        "“Not only was ASU close to home, but it had the right size for me and gave me the ability to develop myself and allow myself to grow.”Brayden WoodsLegislative Correspondent - U.S. House of Representatives, Class of 2020",
        "“Angelo State is a respected and nationally recognized university. I am so proud of its growth and the opportunities available for the current students.”Michele WardClass of 1993",
        "“I am a proud ASU alum because every experience I encountered prepared me for the diverse experiences I encountered in my career.”Ray LindsaySenior Associate, Dayton Aerospace Inc., Class 1987",
        "“Angelo State is full of kind, hard working and successful people. I am honored to have been given the opportunity to represent such an amazing community and school!”Katie LightFamily Medicine Physician, Class of 2016",
        "“RAM FAM is not just a saying, it is a true sentiment. I look forward to introducing the next generation to the values of Angelo State University!”Kate BarnettDoctor of Physical Therapy, Class of 2012",
        "“I received a game changing education that gave me a competitive advantage + the confidence to excel in my career journey.”Kevin CarrollFounder, Author, Speaker, Class of 1989",
        "“Despite being from out of town, I felt instantly welcomed the moment I set foot on campus.”Heidi MoyerDoctor of Physical Therapy, Adjunct Professor, Class of 2016",
        "“I chose Angelo State because I knew it would be a place where I could develop my own identity. I found my likes and dislikes, hobbies and passions. I learned a lot about myself.”Lydia BuenoAssistant Dean of Strategic Enrollment and Student Life, Honors College at The University of Texas at San Antonio, Class of 2005, 2010",
        "“As an international student I wanted to attend a trustworthy university with a verifiable legacy and hometown feeling in a suburban location. ASU ticked all the boxes!”Matthew MbangaCEO of Foundations for Farming, Class of 2003",
        "“The small class sizes and personable professors made Angelo State the perfect choice for me.”Shae HopfICU BSN RN, Class of 2018",
        "“I knew I was getting a top-notch education while also making many friends all from different backgrounds.”Michele WardClass of 1993",
        "“ASU offered me a scholarship to play football while attending classes and completing my undergraduate degree.”Cody DanaherAthletic Director and Head Football Coach at Calallen ISD, Class of 1971",
        "“I chose Angelo State because I could receive an individualized superlative education from full professors at a fraction of the cost of other institutions.”John DelkClass of 1996",
        "“When I applied to ASU I was hoping for the ultimate college experience, little did I know that graduating debt free would be included as well!”Beth SimmonsClass of 2019",
        "“I had great professors who were very eager to help at any time.”Paula LarezClass of 1990",
        "“I chose Angelo State because I was attracted to the welcoming and diverse community, proximity to my family, multiple opportunities to get involved and the amazing faculty.”Alex BryantProject Manager, Class of 2014",
        "“I chose ASU because it’s a family tradition. My grandfather was here, my parents went here, my brothers went here. It’s part of our family, and I feel like I was born with blue and gold in my blood.”Laura ScottClass of 2002, B.A. in Communication",
        "“I chose ASU because the welcoming and intimate atmosphere offered was the perfect fit for me.”Ray LindsayClass of 1987",
        "“I am proud to see Angelo State constantly moving forward and creating opportunities for students, and I am proud to see and learn of the amazing things our alumni are accomplishing in their fields.”Anton MalkowskiChief of Staff for Business Operations, U.S. Forest Service, Class of 2003",
        "“Not only does ASU support their students financially, but throughout the entire campus, from the AMAZING professors to thriving organizations. I couldn’t have chose a better university.”Beth SimmonsClass of 2019",
        "“I chose ASU because it allowed me to start my career in healthcare early while going to school.”Paul CarrilloHealthcare Operations (LEAN Specialist), Class of 2021 and 2022",
        "“I chose ASU because the professors want to see you succeed and are willing to help you no matter what!”Catherine GuerraClass of 2022",
        "“I chose Angelo State because of the amazing faculty and staff who took me in and made me feel at home.”Chase PhelpsTechnical Director, Class of 2021",
        "“I only applied to one college, was accepted, and graduated ASU with a degree in applied physics. I’m proud to tell people that ASU now has a great engineering program.”Travis BarnettCEO, Centerline Engineering & Consulting, Class of 2012",
        "“My grandmother was an alumna of San Angelo College in the late 30s and early 40s. She was excited when she learned of my choice to join the Ram Family. I have never regretted the decision!”Jerry OvermanClass of 1988",
        "“I chose Angelo State because the faculty, staff and fellow students helped me fit in. The professors were always willing to help me better myself.”Kelan S. GriffinTechnical Services Project Manager II, Class of 1992",
        "“I chose ASU because it’s a family tradition. My grandfather was here, my parents went here, my brothers went here. It’s part of our family, and I feel like I was born with blue and gold in my blood.”Laura ScottClass of 2002, B.A. in Communication",
        "“I chose Angelo State because of the atmosphere I felt walking on campus. It felt like home.”Stephanie InfanteOrchestra Director, Class of 2017",
        "“ASU offered me a scholarship to play football while attending classes and completing my undergraduate degree.”Cody DanaherAthletic Director and Head Football Coach at Calallen ISD, Class of 1971",
        "“My grandmother was an alumna of San Angelo College in the late 30s and early 40s. She was excited when she learned of my choice to join the Ram Family. I have never regretted the decision!”Jerry OvermanClass of 1988",
        "“As an international student I wanted to attend a trustworthy university with a verifiable legacy and hometown feeling in a suburban location. ASU ticked all the boxes!”Matthew MbangaCEO of Foundations for Farming, Class of 2003",
        "“Angelo State University offered a rigorous curriculum that I felt would prepare me well for my future career path.”Caleb VosburgPhysician, Class of 1998 and 2001",
        "“My college education was self-funded, so I chose Angelo State because it offered me the best opportunity to earn a high-quality computer science degree at an affordable cost.”Bryan HeflinOwner, Best Made Designs, LLC, Class of 1987",
        "“The small class sizes and personable professors made Angelo State the perfect choice for me.”Shae HopfICU BSN RN, Class of 2018",
        "“ASU was and is home. I personally knew all of my professors, and I felt like more than just a ‘number.’ I enjoyed all of the extra-curricular activities and groups where I made lifelong friends.”Kate BarnettDoctor of Physical Therapy, Class of 2012",
        "“I chose ASU because the welcoming and intimate atmosphere offered was the perfect fit for me.”Ray LindsayClass of 1987",
        "“ASU prepared me very well for my next stage in life. I’m proud of the academics I learned and of the soft skills I learned in extra-curricular activities.”Travis BarnettCEO, Centerline Engineering & Consulting. Class of 2012",
        "“I chose Angelo State because the faculty, staff and fellow students helped me fit in. The professors were always willing to help me better myself.”Kelan S. GriffinTechnical Services Project Manager II, Class of 1992",
        "“The RAM culture speaks for itself; loyal, supportive, and timeless. I am so proud to be an ASU alum and be able to share my RAM Pride with generations of RAMS!”Beth SimmonsClass of 2019",
        "“We wouldn’t be where we are today without ASU. And not just for the education, but also for the lasting friendships and that feeling of family.”Laura ScottClass of 2002, B.A. in Communication",
        "“I had great professors who were very eager to help at any time.”Paula LarezClass of 1990",
        "“Angelo State is a respected and nationally recognized university. I am so proud of its growth and the opportunities available for the current students.”Michele WardClass of 1993",
        "“I made many life-long friends with fellow students, teammates and professors.”Cody DanaherAthletic Director and Head Football Coach at Calallen ISD, Class of 1971",
        "“I’m more than happy that #IChoseAngeloState, and I’m a proud graduate of the class of 1990! Go Rams!”Paula LarezClass of 1990",
        "“I wanted to participate in Air Force ROTC and ASU allowed me the opportunity to do so in my hometown near family and friends. ASU turned out to be the perfect choice for me.”Anton MalkowskiChief of Staff for Business Operations, U.S. Forest Service, Class of 2003",
        "“I chose Angelo State because of the amazing faculty and staff who took me in and made me feel at home.”Chase PhelpsTechnical Director, Class of 2021",
        "“I am forever grateful for the opportunities that were given to me as a student and now, as a faculty member, I can make that same difference in the life of someone else.”Dr. Gayle RandallAssistant Professor of Marketing, Class of 1990 and 1991",
        "“When I applied to ASU I was hoping for the ultimate college experience, little did I know that graduating debt free would be included as well!”Beth SimmonsClass of 2019",
        "“I was given a phenomenal education and had the time of my life!”Taylor De La GarzaLending Assistant, Class of 2017",
        "“Coming back to campus is one of my favorite things to do, because it feels like I am coming home to family. This makes me immensely proud to call myself an ASU Ram!”Jarett LujanHigher Education Research, Class of 2016, 2017, 2019",
        "“I chose ASU because the professors want to see you succeed and are willing to help you no matter what!”Catherine GuerraClass of 2022",
        "“I chose Angelo State because I was attracted to the welcoming and diverse community, proximity to my family, multiple opportunities to get involved and the amazing faculty.”Alex BryantProject Manager, Class of 2014",
        "“Angelo State made me feel at home the moment I stepped onto campus. There is something special about the feeling you get when touring ASU and seeing yourself living the life of a Ram or Rambelle.”Jarett LujanHigher Education Research, Class of 2016, 2017, 2019",
        "“I knew I was getting a top-notch education while also making many friends all from different backgrounds.”Michele WardClass of 1993",
        "“Not only does ASU support their students financially, but throughout the entire campus, from the AMAZING professors to thriving organizations. I couldn’t have chose a better university.”Beth SimmonsClass of 2019",
        "“I am a proud ASU alum because every experience I encountered prepared me for the diverse experiences I encountered in my career.”Ray LindsaySenior Associate, Dayton Aerospace Inc., Class 1987",
        "“The education and social experiences I received built a solid foundation to prepare me for the workforce and uncovered new interests and goals that I had never considered.”Alex BryantProject Manager, Class of 2014",
        "“This little campus appears innocuous due to its size and location, but it is teeming with brilliant professors, dedicated staff, and a real family atmosphere.”Heidi MoyerDoctor of Physical Therapy, Adjunct Professor, Class of 2016",
        "“The faculty in my program were personally invested in my success and provided every opportunity to promote my professional involvement in our field.”Heidi MoyerDoctor of Physical Therapy, Adjunct Professor, Class of 2016",
        "“I chose ASU because I knew I would be provided with educational and work opportunities that would not be possible elsewhere.”Hanne CampbellPolitical Science, Class of 2024",
        "“ASU was a place I could be both a student and athlete and not have to compromise success in my academic or athletic career for the other - I could have both!”Katie LightFamily Medicine Physician, Class of 2016",
        "“ASU cares about its students. I owe my success to the foundation that ASU put in place.”Taimur KhanVice President Business Development and Strategy, Class of 1992",
        "“I forged life-long friends and was able to be part of a professional fraternity called Delta Sigma Pi.”Eligio AcostaCommercial Banking, Class of 1993",
        "“I chose ASU because they make it easier to be a single mother working a full-time job.”Ashley DeLuna CorbettClass of 2022",
        "“I am proud to see Angelo State constantly moving forward and creating opportunities for students, and I am proud to see and learn of the amazing things our alumni are accomplishing in their fields.”Anton MalkowskiChief of Staff for Business Operations, U.S. Forest Service, Class of 2003",
        "“You can fulfill your potential here and be certain that when you walk the stage at graduation, there are no regrets - because you chose Angelo State University.”Dr. Gayle RandallAssistant Professor of Marketing, Class of 1990 and 1991",
        "“I chose ASU because of it’s size and the quality of education.”Kelan GriffinClass of 1992",
        "“My own orientation left such a profound impact that in subsequent years when I became a Resident Assistant, I always wanted to have some role to welcome future ones on the first day of campus.”Taimur KhanVice President Business Development and Strategy, Class of 1992",
        "“It is great to be a part of a family with fellow students who actually care about you all over the world.”John DelkClass of 1996",
        "“I chose ASU because I wanted to go to a college where my professors would know my name and build relationships with me.”Rachel RiggsClass of 2014 and 2016",
        "“Not only was ASU close to home, but it had the right size for me and gave me the ability to develop myself and allow myself to grow.”Brayden WoodsLegislative Correspondent - U.S. House of Representatives, Class of 2020",
        "“Despite being from out of town, I felt instantly welcomed the moment I set foot on campus.”Heidi MoyerDoctor of Physical Therapy, Adjunct Professor, Class of 2016",
        "“A degree from Angelo State University provided me with my first opportunity in leadership management.”Henry JacksonPresident, Buckner Children Family Services, Class of 1994",
        "“There are so many scholarship opportunities that give you the chance to graduate debt-free. Students come from all over because they recognize the value of ASU.”Laura ScottClass of 2002, B.A. in Communication",
        "“I only applied to one college, was accepted, and graduated ASU with a degree in applied physics. I’m proud to tell people that ASU now has a great engineering program.”Travis BarnettCEO, Centerline Engineering & Consulting, Class of 2012",
        "“I chose Angelo State because the professors, students and employees foster an environment that creates excellent professionals and, more importantly, amazing people.”Paige SmithB.B.A. & M.P.Ac, Class of 2020",
        "“I chose Angelo State because I knew it would be a place where I could develop my own identity. I found my likes and dislikes, hobbies and passions. I learned a lot about myself.”Lydia BuenoAssistant Dean of Strategic Enrollment and Student Life, Honors College at The University of Texas at San Antonio, Class of 2005, 2010",
        "“I chose ASU because it allowed me to start my career in healthcare early while going to school.”Paul CarrilloHealthcare Operations (LEAN Specialist), Class of 2021 and 2022",
        "“RAM FAM is not just a saying, it is a true sentiment. I look forward to introducing the next generation to the values of Angelo State University!”Kate BarnettDoctor of Physical Therapy, Class of 2012",
        "“Angelo State is a place where people go to grow, develop and learn.”Henry JacksonPresident, Buckner Children Family Services, Class of 1994",
        "“Angelo State is full of kind, hard working and successful people. I am honored to have been given the opportunity to represent such an amazing community and school!”Katie LightFamily Medicine Physician, Class of 2016",
        "“I chose Angelo State because I could receive an individualized superlative education from full professors at a fraction of the cost of other institutions.”John DelkClass of 1996",
        "“I am proud to be an ASU Alum because of the amazing career opportunities it offered me. ASU opened the door for me.”Shae HopfICU BSN RN, Class of 2018",
        "“I am proud to be an ASU Alum because of the commitment it has made to become a more diverse campus community to better serve students in West Texas.”Lydia BuenoAssistant Dean of Strategic Enrollment and Student Life, Honors College at The University of Texas at San Antonio, Class of 2005, 2010",
        "“I received a game changing education that gave me a competitive advantage + the confidence to excel in my career journey.”Kevin CarrollFounder, Author, Speaker, Class of 1989",
        "“When I first came to ASU as an undergrad, I never knew how my life would change forever through the interactions with my professors, coaches, friends and administrators.”Dr. Gayle RandallAssistant Professor of Marketing, Class of 1990 and 1991",
        "“My experiences as an undergrad at Angelo State have significantly influenced the trajectory of my life.”Alex BryantProject Manager, Class of 2014",
        "“It was home away from home. There’s no better place to be other than Angelo State. Go Rams!”Henry JacksonPresident, Buckner Children Family Services, Class of 1994",
        "“The faculty in my program were personally invested in my success and provided every opportunity to promote my professional involvement in our field.”Heidi MoyerDoctor of Physical Therapy, Adjunct Professor, Class of 2016",
        "“ASU offered me a scholarship to play football while attending classes and completing my undergraduate degree.”Cody DanaherAthletic Director and Head Football Coach at Calallen ISD, Class of 1971",
        "“My grandmother was an alumna of San Angelo College in the late 30s and early 40s. She was excited when she learned of my choice to join the Ram Family. I have never regretted the decision!”Jerry OvermanClass of 1988",
        "“I was given a phenomenal education and had the time of my life!”Taylor De La GarzaLending Assistant, Class of 2017",
        "“The education and social experiences I received built a solid foundation to prepare me for the workforce and uncovered new interests and goals that I had never considered.”Alex BryantProject Manager, Class of 2014",
        "“I knew I was getting a top-notch education while also making many friends all from different backgrounds.”Michele WardClass of 1993",
        "“Not only was ASU close to home, but it had the right size for me and gave me the ability to develop myself and allow myself to grow.”Brayden WoodsLegislative Correspondent - U.S. House of Representatives, Class of 2020",
        "“I am proud to see Angelo State constantly moving forward and creating opportunities for students, and I am proud to see and learn of the amazing things our alumni are accomplishing in their fields.”Anton MalkowskiChief of Staff for Business Operations, U.S. Forest Service, Class of 2003",
        "“It is great to be a part of a family with fellow students who actually care about you all over the world.”John DelkClass of 1996",
        "“I had great professors who were very eager to help at any time.”Paula LarezClass of 1990",
        "“I chose Angelo State because the faculty, staff and fellow students helped me fit in. The professors were always willing to help me better myself.”Kelan S. GriffinTechnical Services Project Manager II, Class of 1992",
        "“I am a proud ASU alum because every experience I encountered prepared me for the diverse experiences I encountered in my career.”Ray LindsaySenior Associate, Dayton Aerospace Inc., Class 1987",
        "“I chose ASU because it allowed me to start my career in healthcare early while going to school.”Paul CarrilloHealthcare Operations (LEAN Specialist), Class of 2021 and 2022",
        "“RAM FAM is not just a saying, it is a true sentiment. I look forward to introducing the next generation to the values of Angelo State University!”Kate BarnettDoctor of Physical Therapy, Class of 2012",
        "“I chose ASU because I wanted to go to a college where my professors would know my name and build relationships with me.”Rachel RiggsClass of 2014 and 2016",
        "“There are so many scholarship opportunities that give you the chance to graduate debt-free. Students come from all over because they recognize the value of ASU.”Laura ScottClass of 2002, B.A. in Communication",
        "“The small class sizes and personable professors made Angelo State the perfect choice for me.”Shae HopfICU BSN RN, Class of 2018",
        "“We wouldn’t be where we are today without ASU. And not just for the education, but also for the lasting friendships and that feeling of family.”Laura ScottClass of 2002, B.A. in Communication",
        "“As an international student I wanted to attend a trustworthy university with a verifiable legacy and hometown feeling in a suburban location. ASU ticked all the boxes!”Matthew MbangaCEO of Foundations for Farming, Class of 2003",
        "“When I applied to ASU I was hoping for the ultimate college experience, little did I know that graduating debt free would be included as well!”Beth SimmonsClass of 2019",
        "“I am proud to be an ASU Alum because of the amazing career opportunities it offered me. ASU opened the door for me.”Shae HopfICU BSN RN, Class of 2018",
        "“I chose ASU because of it’s size and the quality of education.”Kelan GriffinClass of 1992",
        "“When I first came to ASU as an undergrad, I never knew how my life would change forever through the interactions with my professors, coaches, friends and administrators.”Dr. Gayle RandallAssistant Professor of Marketing, Class of 1990 and 1991",
        "“Coming back to campus is one of my favorite things to do, because it feels like I am coming home to family. This makes me immensely proud to call myself an ASU Ram!”Jarett LujanHigher Education Research, Class of 2016, 2017, 2019",
        "“Angelo State is full of kind, hard working and successful people. I am honored to have been given the opportunity to represent such an amazing community and school!”Katie LightFamily Medicine Physician, Class of 2016",
        "“I am forever grateful for the opportunities that were given to me as a student and now, as a faculty member, I can make that same difference in the life of someone else.”Dr. Gayle RandallAssistant Professor of Marketing, Class of 1990 and 1991",
        "“A degree from Angelo State University provided me with my first opportunity in leadership management.”Henry JacksonPresident, Buckner Children Family Services, Class of 1994",
        "“My college education was self-funded, so I chose Angelo State because it offered me the best opportunity to earn a high-quality computer science degree at an affordable cost.”Bryan HeflinOwner, Best Made Designs, LLC, Class of 1987",
        "“ASU was a place I could be both a student and athlete and not have to compromise success in my academic or athletic career for the other - I could have both!”Katie LightFamily Medicine Physician, Class of 2016",
        "“I chose Angelo State because of the amazing faculty and staff who took me in and made me feel at home.”Chase PhelpsTechnical Director, Class of 2021",
        "“I wanted to participate in Air Force ROTC and ASU allowed me the opportunity to do so in my hometown near family and friends. ASU turned out to be the perfect choice for me.”Anton MalkowskiChief of Staff for Business Operations, U.S. Forest Service, Class of 2003",
        "“This little campus appears innocuous due to its size and location, but it is teeming with brilliant professors, dedicated staff, and a real family atmosphere.”Heidi MoyerDoctor of Physical Therapy, Adjunct Professor, Class of 2016",
        "“ASU cares about its students. I owe my success to the foundation that ASU put in place.”Taimur KhanVice President Business Development and Strategy, Class of 1992",
        "“ASU prepared me very well for my next stage in life. I’m proud of the academics I learned and of the soft skills I learned in extra-curricular activities.”Travis BarnettCEO, Centerline Engineering & Consulting. Class of 2012",
        "“It was home away from home. There’s no better place to be other than Angelo State. Go Rams!”Henry JacksonPresident, Buckner Children Family Services, Class of 1994",
        "“I chose Angelo State because I could receive an individualized superlative education from full professors at a fraction of the cost of other institutions.”John DelkClass of 1996",
        "“Not only does ASU support their students financially, but throughout the entire campus, from the AMAZING professors to thriving organizations. I couldn’t have chose a better university.”Beth SimmonsClass of 2019",
        "“ASU was and is home. I personally knew all of my professors, and I felt like more than just a ‘number.’ I enjoyed all of the extra-curricular activities and groups where I made lifelong friends.”Kate BarnettDoctor of Physical Therapy, Class of 2012",
        "“My own orientation left such a profound impact that in subsequent years when I became a Resident Assistant, I always wanted to have some role to welcome future ones on the first day of campus.”Taimur KhanVice President Business Development and Strategy, Class of 1992",
        "“I chose ASU because it’s a family tradition. My grandfather was here, my parents went here, my brothers went here. It’s part of our family, and I feel like I was born with blue and gold in my blood.”Laura ScottClass of 2002, B.A. in Communication",
        "“Angelo State made me feel at home the moment I stepped onto campus. There is something special about the feeling you get when touring ASU and seeing yourself living the life of a Ram or Rambelle.”Jarett LujanHigher Education Research, Class of 2016, 2017, 2019",
        "“I chose Angelo State because I was attracted to the welcoming and diverse community, proximity to my family, multiple opportunities to get involved and the amazing faculty.”Alex BryantProject Manager, Class of 2014",
        "“I forged life-long friends and was able to be part of a professional fraternity called Delta Sigma Pi.”Eligio AcostaCommercial Banking, Class of 1993",
        "“I chose Angelo State because I knew it would be a place where I could develop my own identity. I found my likes and dislikes, hobbies and passions. I learned a lot about myself.”Lydia BuenoAssistant Dean of Strategic Enrollment and Student Life, Honors College at The University of Texas at San Antonio, Class of 2005, 2010",
        "“I am proud to be an ASU Alum because of the commitment it has made to become a more diverse campus community to better serve students in West Texas.”Lydia BuenoAssistant Dean of Strategic Enrollment and Student Life, Honors College at The University of Texas at San Antonio, Class of 2005, 2010",
        "“I only applied to one college, was accepted, and graduated ASU with a degree in applied physics. I’m proud to tell people that ASU now has a great engineering program.”Travis BarnettCEO, Centerline Engineering & Consulting, Class of 2012",
        "“You can fulfill your potential here and be certain that when you walk the stage at graduation, there are no regrets - because you chose Angelo State University.”Dr. Gayle RandallAssistant Professor of Marketing, Class of 1990 and 1991",
        "“Angelo State is a place where people go to grow, develop and learn.”Henry JacksonPresident, Buckner Children Family Services, Class of 1994",
        "“I’m more than happy that #IChoseAngeloState, and I’m a proud graduate of the class of 1990! Go Rams!”Paula LarezClass of 1990",
        "“The RAM culture speaks for itself; loyal, supportive, and timeless. I am so proud to be an ASU alum and be able to share my RAM Pride with generations of RAMS!”Beth SimmonsClass of 2019",
        "“I received a game changing education that gave me a competitive advantage + the confidence to excel in my career journey.”Kevin CarrollFounder, Author, Speaker, Class of 1989",
        "“I chose Angelo State because of the atmosphere I felt walking on campus. It felt like home.”Stephanie InfanteOrchestra Director, Class of 2017",
        "“I made many life-long friends with fellow students, teammates and professors.”Cody DanaherAthletic Director and Head Football Coach at Calallen ISD, Class of 1971",
        "“I chose Angelo State because the professors, students and employees foster an environment that creates excellent professionals and, more importantly, amazing people.”Paige SmithB.B.A. & M.P.Ac, Class of 2020",
        "“Angelo State University offered a rigorous curriculum that I felt would prepare me well for my future career path.”Caleb VosburgPhysician, Class of 1998 and 2001",
        "“Angelo State is a respected and nationally recognized university. I am so proud of its growth and the opportunities available for the current students.”Michele WardClass of 1993",
        "“Despite being from out of town, I felt instantly welcomed the moment I set foot on campus.”Heidi MoyerDoctor of Physical Therapy, Adjunct Professor, Class of 2016",
        "“I chose ASU because the welcoming and intimate atmosphere offered was the perfect fit for me.”Ray LindsayClass of 1987",
        "“I chose ASU because I knew I would be provided with educational and work opportunities that would not be possible elsewhere.”Hanne CampbellPolitical Science, Class of 2024",
        "“I chose ASU because they make it easier to be a single mother working a full-time job.”Ashley DeLuna CorbettClass of 2022",
        "“My experiences as an undergrad at Angelo State have significantly influenced the trajectory of my life.”Alex BryantProject Manager, Class of 2014",
        "“I chose ASU because the professors want to see you succeed and are willing to help you no matter what!”Catherine GuerraClass of 2022",
        "Facebook",
        "Twitter",
        "LinkedIn",
        "2601 W. Avenue NSan Angelo, TX 76909",
        "1-800-946-8627",
        "Campus Map",
        "Contact ASU",
        "University Directory",
        "RamPort",
        "Jobs at ASU",
        "Facebook",
        "X",
        "Instagram",
        "YouTube",
        "©2024 Angelo State University",
        "All Rights Reserved",
        "Editor Login",
        "TTU System",
        "Texas Tech University",
        "TTU Health Sciences Center",
        "TTUHSC El Paso",
        "Midwestern State University",
        "ASU Privacy Policy",
        "Weather and Emergency Notifications",
        "Mental Health Services",
        "Title IX/Incident Report",
        "State of Texas",
        "Statewide Search",
        "Texas Homeland Security",
        "Texas Veterans Portal",
        "State Auditor’s Office",
        "Fraud Prevention",
        "Site Policies"
    ],
    "table_headers": [],
    "table_data": [],
    "captions": [],
    "links": [
        "#main-content",
        "/",
        "/academics/",
        "/academics/programs/",
        "/departments/",
        "/colleges/",
        "/courses/",
        "/current-students/registrar/academic_calendar.php",
        "/about-asu/",
        "/about-asu/history.php",
        "/about-asu/core-values/",
        "/about-asu/news/",
        "/about-asu/traditions/",
        "/about-asu/san-angelo.php",
        "/about-asu/president/",
        "/about-asu/mission-statement.php",
        "/admissions-and-aid/",
        "/admissions-and-aid/apply/",
        "/admissions-and-aid/admitted/",
        "/admissions-and-aid/info/",
        "/admissions-and-aid/visit/",
        "/admissions-and-aid/paying-for-college/",
        "/life-on-campus/",
        "/life-on-campus/live/",
        "/life-on-campus/play/",
        "/life-on-campus/lead/",
        "/life-on-campus/work/",
        "/life-on-campus/explore/",
        "/community/",
        "/community/mayer-museum/",
        "/alumni/",
        "/community/small-business-development-center/",
        "/community/west-texas-collection/",
        "/departments/biology/angelo-state-natural-history-collection/",
        "/community/kay-bailey-hutchison-center/",
        "/colleges/archer-college-of-health-and-human-services/laura-w-bush-institute-for-womens-health/",
        "/departments/visual-performing-arts/theatre/subscriptions.php",
        "/departments/physics-geosciences/planetarium/",
        "/community/stephens-chapel.php",
        "/community/asu-ranch/",
        "/community/ticket-office/",
        "/community/summer-camps-and-conferences/",
        "/give/",
        "/give/make_gift/",
        "/give/signature-events/",
        "/give/join/",
        "https://www.angelosports.com/",
        "https://ramport.angelo.edu/",
        "/library/",
        "http://bookstore.angelo.edu/",
        "/events/",
        "/public-health/",
        "/administrative-support/",
        "/research/",
        "/current-students/counseling-services/",
        "/current-students/title-ix/",
        "/en-espanol/",
        "/current-students/",
        "/faculty-and-staff/",
        "/admissions-and-aid/admitted/",
        "/active-duty-veterans/",
        "/parents-and-families/",
        "/alumni/",
        "/visitors/",
        "/school-counselors/",
        "/online/",
        "/i-chose-angelo-state/",
        "/",
        "/iamangelo/taylor.php",
        "/iamangelo/reilly.php",
        "/live/forms/1836-i-chose-angelo-state",
        "/live/news/19135-faculty-spotlight-gayle-randall",
        "/live/news/19135-faculty-spotlight-gayle-randall",
        "/live/news/19512-asu-trailblazer-paige-smith",
        "/live/news/19129-alumni-spotlight-henry-jackson",
        "/live/news/18755-we-are-family-laura-billy-scott",
        "/live/news/18755-we-are-family-laura-billy-scott",
        "/live/news/19129-alumni-spotlight-henry-jackson",
        "/live/news/19129-alumni-spotlight-henry-jackson",
        "/live/news/19135-faculty-spotlight-gayle-randall",
        "/live/news/18755-we-are-family-laura-billy-scott",
        "/live/news/18755-we-are-family-laura-billy-scott",
        "/live/news/18755-we-are-family-laura-billy-scott",
        "/live/news/19135-faculty-spotlight-gayle-randall",
        "/live/news/19135-faculty-spotlight-gayle-randall",
        "/live/news/19129-alumni-spotlight-henry-jackson",
        "/live/news/18755-we-are-family-laura-billy-scott",
        "/live/news/19512-asu-trailblazer-paige-smith",
        "/live/news/19129-alumni-spotlight-henry-jackson",
        "/live/news/19135-faculty-spotlight-gayle-randall",
        "/live/news/19129-alumni-spotlight-henry-jackson",
        "/live/news/18755-we-are-family-laura-billy-scott",
        "/live/news/18755-we-are-family-laura-billy-scott",
        "/live/news/19135-faculty-spotlight-gayle-randall",
        "/live/news/19135-faculty-spotlight-gayle-randall",
        "/live/news/19129-alumni-spotlight-henry-jackson",
        "/live/news/19129-alumni-spotlight-henry-jackson",
        "/live/news/18755-we-are-family-laura-billy-scott",
        "/live/news/19135-faculty-spotlight-gayle-randall",
        "/live/news/19129-alumni-spotlight-henry-jackson",
        "/live/news/19512-asu-trailblazer-paige-smith",
        "/give/",
        "https://www.facebook.com/angelostateuniversity",
        "https://www.instagram.com/angelostate/",
        "https://twitter.com/AngeloState",
        "https://www.youtube.com/angelostateu",
        "/live/image/gid/321/46254_Facebook_Cover_Photo_2.jpg",
        "/live/image/gid/321/46286_Twitter_I_Chose_Angelo_State.jpg",
        "/live/image/gid/321/46326_Linkedin_Cover_Photo.jpg",
        "/admissions-and-aid/",
        "/admissions-and-aid/visit/",
        "/admissions-and-aid/info/",
        "tel:18009468627",
        "/map/",
        "/contact/",
        "/directory/",
        "https://ramport.angelo.edu/",
        "/work-at-asu/",
        "https://www.facebook.com/angelostateuniversity",
        "https://twitter.com/AngeloState",
        "https://www.instagram.com/angelostate/",
        "https://www.youtube.com/user/AngeloStateU",
        "/livewhale/?login&referer=1",
        "http://www.texastech.edu/",
        "https://www.ttu.edu/",
        "https://www.ttuhsc.edu/",
        "https://elpaso.ttuhsc.edu/",
        "https://msutexas.edu/",
        "https://apps.highered.texas.gov/resumes/",
        "/privacy_policy.php",
        "/emergency-notifications/",
        "/current-students/counseling-services/",
        "/current-students/title-ix/",
        "https://www.texas.gov/",
        "https://www.tsl.texas.gov/trail/index.html",
        "https://gov.texas.gov/organization/hsgd",
        "https://veterans.portal.texas.gov/",
        "https://sao.fraud.texas.gov/",
        "/administrative-support/audit-services/fraud_prevention.php",
        "/site-policies/"
    ],
    "tables": []
}