{
    "file_name": "sites-iamangelo.html",
    "title": "#iamangelo: Reilly Amsler  · Angelo State University",
    "description": "As the daughter of two Angelo State alumni, Reilly Amsler was very familiar with Angelo State.",
    "meta_tags": {
        "viewport": "width=device-width, initial-scale=1",
        "generator": "LiveWhale",
        "og:title": "#iamangelo: Reilly Amsler",
        "og:type": "website",
        "og:url": "https://www.angelo.edu/iamangelo/reilly.php",
        "pagename": "#iamangelo: Reilly Amsler",
        "og:description": "As the daughter of two Angelo State alumni, Reilly Amsler was very familiar with Angelo State.",
        "description": "As the daughter of two Angelo State alumni, Reilly Amsler was very familiar with Angelo State.",
        "og:image": "https://www.angelo.edu/live/image/gid/302/width/1260/height/630/crop/1/src_region/0,57,3825,2001/52126_DSC_6365_2.rev.1678133220.jpg",
        "og:image:secure_url": "https://www.angelo.edu/live/image/gid/302/width/1260/height/630/crop/1/src_region/0,57,3825,2001/52126_DSC_6365_2.rev.1678133220.jpg",
        "og:image:width": "1260",
        "og:image:height": "630",
        "twitter:card": "summary_large_image",
        "twitter:title": "#iamangelo: Reilly Amsler",
        "twitter:description": "As the daughter of two Angelo State alumni, Reilly Amsler was very familiar with Angelo State.",
        "twitter:image": "https://www.angelo.edu/live/image/gid/302/width/1260/height/630/crop/1/src_region/0,57,3825,2001/52126_DSC_6365_2.rev.1678133220.jpg",
        "keywords": "elementary education, special education certification, Angelo State Student, I am Angelo, Student Teacher, Reilly Amsler, Teacher Education, Early ..."
    },
    "headings": [
        "As the daughter of two Angelo State alumni, Reilly Amsler was very familiar with Angelo State."
    ],
    "paragraphs": [
        "",
        "“My dad played football, and my mom was an Angelette, so I grew up visiting ASU,” she said. “I love the campus. Everyone is so nice and friendly, and all the professors are quick to help and care about us as students. They understand the obstacles along the way and want to work with you.",
        "",
        "A freshman education major from Victoria, Reilly’s first semester at Angelo State was a little rough.",
        "“You’re moving away from home,” she said. “It’s a new experience. It’s a new town, a new environment. For freshmen, the first semester can be hard because you’re adjusting to a different schedule. You don’t have eight classes every day like in high school, so you have to learn time management.”",
        "Despite these challenges, Reilly made it a point to get involved early. She is currently the activities chairman of Sigma Kappa, a RAMbassador and a #RamWire Student Influencer.",
        "",
        "“If I wasn’t involved, I would be stuck in my room,” she said. “Joining organizations helps you de-stress, and you also have people to lean on and hang out with. You make those connections when you’re in classes or in your sorority. You have a big group of girls who are supportive when you need them; the same with RAMbassadors, they’re always there for you.”",
        "Not only is Reilly making lifelong connections, she is also gaining skills that will benefit her beyond her time at Angelo State.",
        "“You can become a leader,” she said. “If you get involved in different things, there are more leadership opportunities. Having those leadership positions allows you to know more people.”",
        "“I love our Core Values - they don’t disregard anyone. Anyone is welcome, and I really admire that.”",
        "Reilly is working toward her degree in elementary education with special education certification.",
        "“I come from a family of educators, and I enjoy working with small children,” she said. “I want to teach. I want to help kids. I was born with cerebral palsy, which means I had a stroke before birth. I can’t use my left hand as much as I can my right. Rather than just sitting back and saying, ‘I can’t do it,’ I overcame it.”",
        "",
        "“I want to be able to help special education kids be where I am today and overcome obstacles,” she added. “I want to help them to be the best that they are capable of. That’s my passion.”",
        "After she graduates in 2026, Reilly plans to teach elementary school while working toward her long-term goal of earning a master’s degree to become a high school counselor.",
        "“You’re getting a good education when you come to ASU,” she said. “You also have multiple opportunities to experience campus life and new cultures. I love our Core Values - they don’t disregard anyone. Anyone is welcome, and I really admire that.”"
    ],
    "list_items": [],
    "table_headers": [],
    "table_data": [],
    "captions": [],
    "links": [
        "/iamangelo/",
        "/admissions-and-aid/",
        "/"
    ],
    "tables": []
}