{
    "file_name": "sites-human-resources.html",
    "title": "No Title",
    "description": "No Description",
    "meta_tags": {},
    "headings": [
        "Teacher Education Prof Joins Leadership of State Agency",
        "History Professor Selected for Prestigious Overseas Seminar",
        "Agriculture Prof, Students & Alumni Shine at TSSRM Conference",
        "Biology Instructor Publishes New Book on Caring for Cancer Patients",
        "National Science Foundation Grant to Fund Biology Research in the Amazon",
        "2024 Rodgers Distinguished Awards Winners",
        "2023-24 President’s Awards for Staff Excellence Winners",
        "2024 President’s Awards for Faculty Excellence Winners",
        "TTUS Chancellor’s Council 2024 Distinguished Faculty Awards Winners",
        "Accounting Professor Selected for Endowed Chair",
        "2024 Faculty Promotions Approved by Board of Regents",
        "Admissions Officer Wins Statewide Award",
        "2024 Faculty/Staff Service Awards Recipients Announced",
        "English Professor Publishes New Book of Poetry",
        "College of Education Dean Wins State Award for Outstanding Service",
        "Psychology Professor Publishes New Book on Big Liars",
        "2022-23 Rodgers Distinguished Awards Winners",
        "Economics Professor Chosen for Endowed Chair in Business",
        "Education Professor Named President of State Educators Association",
        "Award-Winning Professor Publishes New Book on U.S. All-Volunteer Force",
        "English Professor Chosen for Fulbright Program in Taiwan",
        "Modern Languages Prof Chosen for Fulbright Program in Mexico",
        "2023 Staff Excellence Awards Winners",
        "2023 President’s Awards for Faculty Excellence Winners",
        "Faculty Receive TTUS Chancellor’s Council Distinguished Teaching & Research Awards",
        "History Professor Earns Prestigious Fellowship",
        "Psych Prof Elected President of Regional Psychological Association",
        "Global Security Studies Professor Publishes New Book on U.S. Military",
        "2023 Faculty Promotions Approved by Board of Regents",
        "New Director for Small Business Development Center",
        "2023 Angelo State Faculty & Staff Service Awards",
        "Psychology Prof Wins Research Grant, Publishes New Book",
        "Business Prof Wins National Advising Award",
        "Communication Prof Wins State Service Award",
        "SBDC Advisor Earns National Recognition",
        "English Professor Publishes First Book of Short Stories",
        "Psychology Prof Appointed to Regional Leadership Post",
        "2021-22 Rodgers Distinguished Awards Winners",
        "ASU Wins Grant for Student Mental Health Research",
        "Honor Society Wins Grant for SAISD Literacy Program",
        "Social Work Prof Elected to National Standards Board",
        "Security Studies Prof Named Editor of New Book Series on Marine Corps",
        "School Counseling Prof Wins State Distance Learning Award",
        "Dean Named for Norris-Vincent College of Business",
        "2022 Faculty Excellence Awards Winners",
        "Longtime Physics Prof Appointed Dean of the College of Graduate Studies and Research",
        "2021-22 Staff Awards Winners",
        "English Prof Chosen for Fulbright Seminar in Norway",
        "Business Dean Wins Grant to Expand Internship Programs",
        "Faculty Receive TTUS Chancellor’s Council Distinguished Teaching and Research Awards",
        "History Prof Earns Prestigious International Fellowship",
        "2022 ASU Faculty Promotions",
        "2022 Faculty & Staff Service Awards Honorees",
        "National Award for Student Refunds Disbursement Program",
        "School Counseling Prof Earns State Advocacy Award",
        "Angelo State Alum Appointed New ASU Freshman College Dean",
        "Security Studies Prof Publishes New Textbook on U.S. Intelligence",
        "Physics Prof Wins National Science Foundation Research Grant",
        "Faculty Win National Science Foundation Grant to Improve STEM Opportunities",
        "2020-21 Rodgers Distinguished Awards Winners",
        "Security Studies Prof Wins Ford Presidential Foundation Grant",
        "Angelo State Wins International ‘Catalyst Award’ for Inclusive Education",
        "Longtime English Prof Awarded Emeritus Status",
        "History Instructor Publishes First Book on British Navalism",
        "2021 Staff Excellence Awards Winners",
        "2021 Staff Excellence Awards Nominees",
        "2021 President’s Awards for Faculty Excellence Winners",
        "2021 Faculty Excellence Awards Nominees",
        "2021 Faculty/Staff Service Awards",
        "Education Profs Win Grant to Host Free Robotics Camps for Middle Schoolers",
        "Accounting Prof Appointed to State Board of Public Accountancy",
        "Psychology Prof to Lead Area Psychological Association",
        "Title IX Coordinator Joins Governor’s Sexual Assault Survivors Program",
        "Faculty Promotions Approved by Board of Regents",
        "Security Studies Prof Wins National Research Prize",
        "Psychology Prof Appointed to State Regulatory Board",
        "Security Studies Prof Wins Multiple National Research Grants",
        "Education Faculty Win International Exemplary Course Award",
        "Criminal Justice Prof Wins National Research Award",
        "Counseling Prof & Master’s Degree Win National Online Program Award",
        "Angelo State Again Earns National ‘Great College to Work For’ Designation",
        "Three Profs Contribute to First Open-Source AP U.S. History Textbook",
        "Chemistry Prof Named National Chief Reader for AP Exams",
        "CSS Prof’s Book is Required Reading at West Point",
        "2019-20 Rodgers Distinguished Faculty, Staff and Administrator Awards",
        "2019-20 Faculty and Staff Excellence Awards Winners",
        "Law Prof Publishes Research on Biden’s VP Pick",
        "Security Studies Prof Publishes New Book on George Marshall",
        "New Center for Teaching and Learning Excellence Partnership",
        "Law Prof Publishes Research on COVID-19 Legal Issues",
        "Angelo State Nursing Prof Named in DFW Great 100 Nurses",
        "Angelo State Rewards Faculty & Staff for Years of Service",
        "Angelo State Education Prof Named Distinguished Alum at Alma Mater",
        "Angelo State Business Prof Wins National Service Award",
        "Angelo State Psych Prof Receives Meritorious Service Award",
        "Angelo State Prof Wins State Education Award",
        "Angelo State Animal Science Prof Earns Prestigious State Fellowship",
        "Angelo State Biology Prof’s Bat Research Published in Scientific Journal",
        "Angelo State Faculty Awarded Endowed Professorships",
        "Angelo State Communication Prof Named Texas Educator of the Year",
        "Angelo State School Counseling Master’s Program Joins $2.3 Million Grant Partnership",
        "Angelo State Earns National “Great College to Work For” Designation",
        "Multiple Angelo State Faculty Win Research Grants",
        "Angelo State’s 2018-19 Rodgers Distinguished Awards Winners",
        "Weise Named Angelo State’s First Davidson Chair in Physical Therapy",
        "ASU Wins International ‘Catalyst Award’ for Education Technology",
        "Education Prof Awarded Phi Kappa Phi Literacy Grant",
        "New Dean Appointed for ASU College of Arts & Humanities",
        "2019 Faculty Excellence Awards Winners",
        "2019 Faculty Excellence Awards Nominees",
        "ASU Staff Excellence Awards Winners",
        "Annual Staff Awards Nominees",
        "Education Profs Win Grant for Girls Robotics Camps",
        "ASU Alum Appointed New College of Graduate Studies Dean",
        "Freshman College Dean Earns National Recognition",
        "Psych Prof Elected President of Regional Psychological Association",
        "Psychology Prof Receives Regional Counseling Award",
        "Faculty & Staff Receive Awards for Years of Service",
        "TTUS Chancellor’s Council 2019 Distinguished Faculty Awards Winners",
        "Biology Prof & Alums Publish First Guide to Bats of the U.S.",
        "Angelo State Natural History Collections Featured in Journal of Mammalogy",
        "Political Science Prof Publishes New Book on Social Security",
        "Security Studies Prof Publishes New Book on African Security Issues",
        "English Prof Publishes New Poetry Collection",
        "Security Studies Prof Named Editor of New Book Series",
        "Biology Prof Awarded Contract for Spotted Skunk Research",
        "Security Studies Prof Publishes New Book on Modern Conservatism",
        "Security Studies Prof Publishes New Book on North Korea",
        "2018 ASU Rodgers Distinguished Awards Winners",
        "New Director for ASU Porter Henderson Library",
        "ASU Earns National ‘Great College to Work For’ Designation",
        "Biology Prof Wins National Parks Research Grant",
        "Global Security Exchange",
        "History Instructor Wins Research Fellowship",
        "2018 Faculty Excellence Awards Winners",
        "2017-18 Faculty Excellence Awards Nominees",
        "Psychology Prof Publishes New Book",
        "Annual ASU Staff Excellence Awards Winners",
        "2017 Faculty/Staff Service Awards Recipients",
        "TTUS Chancellor’s Council Distinguished Faculty Awards Winners",
        "Robledo Takes on New Role to Support ASU’s Hispanic Students",
        "Engineering Chair Heading NSF Grant Project",
        "National Award for Student Refunds Disbursement Program",
        "Security Studies Prof Wins Multiple Research Grants",
        "Political Science Prof Publishes New Book",
        "All the TESOL in China",
        "VP Named to State Education Organization Board",
        "Range Reclamation Project Wins Environmental Excellence Award",
        "Chilling in Chile",
        "Resident Expert - Media Magnet",
        "A Philosophy of Excellence",
        "National Science Foundation Grant for Engineering",
        "2016-17 Rodgers Distinguished Awards Winners",
        "Living to Serve",
        "Vets/Military Services Director Named to Statewide Post",
        "Breathing Life into History",
        "2017 Faculty Excellence Awards Winners",
        "Biology Prof Awarded Federal Grant for Bat Research",
        "Biology Students & Prof Honored at Regional Convention",
        "Arts & Humanities Dean Edits New Reference Book",
        "Leader of the Pack",
        "Psych Prof Elected to Regional Executive Council",
        "Engineering Prof Wins Research Publication Award",
        "Annual Staff Excellence Awards Winners",
        "Achieving Excellence",
        "Geology Prof Named Alma Mater’s Distinguished Alum",
        "Teacher Ed Prof Wins Dept. of Education Grant",
        "Connecting Cultures",
        "2016 Faculty/Staff Service Awards Recipients",
        "Engineering Prof Wins NSF Grant",
        "A Year to Remember",
        "Akin Promoted to Vice President",
        "Communication Prof Named Editor of Industry Journal",
        "Economics Prof Named New Norris Family Chair in Business",
        "History Prof Elected to Historical Association Council",
        "Arts and Humanities Dean Published in International Journal",
        "Administrator Honored for Extracurricular Work",
        "English Prof Publishes Poetry Collection",
        "History Profs Win Grant for World War I Programs",
        "Psychology Prof Publishes New Textbook",
        "2016 Faculty and Staff Service Awards",
        "Faculty and Staff Service Awards",
        "ASU Faculty/Staff Service Awards",
        "ASU Faculty, Staff Service Awards",
        "ASU Faculty, Staff Earn Service Awards",
        "ASU Faculty, Staff Earn Awards for Decades of Service",
        "ASU Faculty, Staff Earn Awards for Decades of Service"
    ],
    "paragraphs": [
        "November 25, 2024",
        "Dr. Carlos Flores Jr., an associate professor in Angelo State University’s Department of Teacher Education, has been elected secretary of the Texas Association of Teacher Educators (TxATE) and is serving a one-year term.",
        "November 19, 2024",
        "Dr. Rebekah McMillan of the Angelo State University history faculty has been selected for a 2025 Overseas Faculty Development Seminar by the Council for American Overseas Research Center (CAORC) and will spend about three weeks in India in January.",
        "October 31, 2024",
        "Dr. Cody Scott, an Angelo State University alum and professor in the ASU Department of Agriculture, received the 2024 Outstanding Contribution to Rangeland Management Award at the recent annual meeting of the Texas Section, Society for Range Management (TSSRM) in Victoria.",
        "October 29, 2024",
        "Dr. Fazlur Rahman, retired oncologist and an adjunct professor in the Angelo State University Department of Biology, has published a new book titled “Our Connected Lives: Caring for Cancer Patients in Rural Texas” through Texas Tech University Press.",
        "October 8, 2024",
        "Angelo State University has been awarded a three-year, $71,973 grant from the National Science Foundation to collect and study specimens of the animals that inhabit the Marajó Island in the Amazon rainforest of Brazil.",
        "May 16, 2024",
        "Angelo State University employees Dr. Kerri Mikulik, Dr. Donna Gee and Cody Vasquez have been selected to receive the 2023-24 Gary and Pat Rodgers Distinguished Awards honoring outstanding ASU faculty, staff and administrators.",
        "May 15, 2024",
        "Four Angelo State University staff members – Jeremy Brake, James Spencer, Robert Sport and Bryan Stephens – have earned the 2023-24 President’s Awards for Staff Excellence, and another – Heather Crawford – has received the annual Chancellor’s Colonel Rowan Award for Execution.",
        "May 14, 2024",
        "Dr. Kenneth Carrell of the Department of Physics and Geosciences, Dr. David Faught of the Natalie Zan Ryan Department of English and Modern Languages, and Dr. Russell Wilke of the Department of Biology are the winners of Angelo State University’s 2024 President’s Awards for Faculty Excellence.",
        "May 3, 2024",
        "Angelo State University faculty members Dr. Drew A. Curtis and Dr. Gayle L. Randall were presented with the Texas Tech University System’s 2024 Chancellor’s Council Distinguished Teaching and Research Awards for ASU during a May 2 ceremony on campus.",
        "April 9, 2024",
        "Dr. Russell “Rusty” Calk, an Angelo State University alumnus and member of the accounting faculty, has been selected as the inaugural holder of the Low Family Endowed Chair in Accounting in ASU’s Norris-Vincent College of Business (NVCOB).",
        "March 14, 2024",
        "Fourteen Angelo State University faculty members have had their promotions approved, effective Sept. 1, with their new ranks finalized by the Texas Tech University System Board of Regents during its recent regular meeting in Wichita Falls.",
        "March 6, 2024",
        "Cody Vasquez, the senior admissions officer in Angelo State University’s Office of Admissions, was recognized with a 2024 Distinguished University Staff Award from the Texas Association of Chicanos in Higher Education (TACHE) at the recent 49th annual TACHE Conference in San Antonio.",
        "February 15, 2024",
        "Over 120 Angelo State University faculty and staff members, including 11 with a quarter century or more employment with the university, were honored with Service Awards during a ceremony on Feb. 13 in the ASU Houston Harte University Center.",
        "December 19, 2023",
        "Dr. Laurence Musgrove, a professor in Angelo State University’s Natalie Zan Ryan Department of English and Modern Languages, has published his fourth book, a collection of poems titled “A Stranger’s Heart,” through Lamar University Literary Press.",
        "October 18, 2023",
        "Dr. Scarlet Clouse, dean of the Angelo State University College of Education, received the 2023 Ted Booker Memorial Award for outstanding contributions in the field of teacher education at the Consortium of State Organizations for Texas Teacher Education (CSOTTE) Annual Conference earlier this month in San Marcos.",
        "August 31, 2023",
        "Dr. Drew Curtis of the Angelo State University psychology faculty has published his fourth book, “Big Liars: What Psychological Science Tells Us About Lying and How You Can Avoid Being Duped,” through American Psychological Association (APA) Publishing.",
        "August 24, 2023",
        "Angelo State University employees Dr. Erin Ashworth-King, Dr. William Taylor and Jayna Phinney have been selected to receive the 2022-23 Gary and Pat Rodgers Distinguished Awards honoring outstanding ASU faculty, staff and administrators.",
        "July 27, 2023",
        "Dr. Jamal Husein, a professor of economics in Angelo State University’s Norris-Vincent College of Business (NVCOB), has been selected to hold the Norris Family Chair in Business for a second consecutive five-year term.",
        "July 10, 2023",
        "Dr. Tia Agan, chair of Angelo State University’s Department of Teacher Education, has been elected president of the Texas Association of Teacher Educators (TxATE) and will serve a one-year term that runs through June 2024.",
        "June 16, 2023",
        "Dr. William A. Taylor, a professor of global security studies at Angelo State University and holder of the Lee Drain Endowed University Professorship, has published his sixth book, “The All-Volunteer Force: Fifty Years of Service,” through the University Press of Kansas.",
        "May 31, 2023",
        "Dr. Laurence Musgrove, a professor in Angelo State University’s Natalie Zan Ryan Department of English and Modern Languages, has been selected for a prestigious 2023 Fulbright-Hays Seminars Abroad Program to conduct research in Taiwan this summer.",
        "May 18, 2023",
        "Dr. Karen Cody, a professor in Angelo State University’s Natalie Zan Ryan Department of English and Modern Languages, is one of only 16 college faculty nationwide selected for a 2023 Fulbright-Hays Seminars Abroad Program to conduct research in Mexico this summer.",
        "May 5, 2023",
        "Four Angelo State University staff members – Ella Kinney Burnett, Ridge Goodloe, Melissa King and Lanell Nichols – have earned the 2022-23 President’s Awards for Staff Excellence, and another – Brooke Flores – has received the annual Chancellor’s Colonel Rowan Award for Execution.",
        "May 4, 2023",
        "Dr. Drew A. Curtis of the Department of Psychology, Dr. Nicholas Negovetich of the Department of Biology, and Dr. Gayle L. Randall of the Department of Management and Marketing are the winners of Angelo State University’s 2023 President’s Awards for Faculty Excellence.",
        "May 3, 2023",
        "Angelo State University faculty members Dr. Dionne T. Bailey and Dr. Bruce E. Bechtol Jr. were presented with the Texas Tech University System’s 2023 Chancellor’s Council Distinguished Teaching and Research Awards for ASU during a May 2 ceremony on campus.",
        "March 28, 2023",
        "Dr. Laura Hooton of the Angelo State University history faculty has been named one of only four 2023-24 Research Fellows for the Clements Center for Southwest Studies in the Dedman College of Humanities and Sciences at Southern Methodist University.",
        "March 23, 2023",
        "Dr. Leslie Kelley of the Angelo State University psychology faculty has been elected president of the Southwestern Psychological Association (SWPA), the official American Psychological Association (APA) affiliate for the Southwestern Region of the U.S.",
        "March 9, 2023",
        "Dr. William A. Taylor, a professor of global security studies and holder of the Lee Drain Endowed University Professorship at Angelo State University, has published his fifth book, “The Advent of the All-Volunteer Force: Protecting Free Society.”",
        "March 2, 2023",
        "Eighteen Angelo State University faculty members have been promoted this spring semester, with their new ranks finalized by the Texas Tech University System Board of Regents during its recent regular meeting in Odessa.",
        "March 1, 2023",
        "Angelo State University’s Small Business Development Center (SBDC) has announced the retirement of long-time director David Erickson, as well as the appointment of a new director, ASU alumna Dezaray Johnson, effective March 1.",
        "February 22, 2023",
        "One hundred Angelo State University faculty and staff members, including nine with a quarter century or more employment with the university, were honored with Service Awards during a ceremony on Tuesday, Feb. 21, in the ASU Houston Harte University Center.",
        "December 7, 2022",
        "Dr. Drew Curtis of the Angelo State University psychology faculty has been awarded a $15,000 grant from the Woodcock Institute at Texas Woman’s University to continue his research on pathological lying.",
        "November 15, 2022",
        "Dr. Gayle Randall of the Angelo State University business faculty, also the faculty advisor for ASU’s chapter of the Delta Sigma Pi (DSP) professional business fraternity, has been named the 2021-22 National Chapter Advisor of the Year by the DSP national office.",
        "October 27, 2022",
        "Dr. Leslie Y. Rodriguez, chair of the Angelo State University Department of Communication and Mass Media, received the 2022 Outstanding Service Award from the Texas Speech Communication Association (TSCA) at the organization’s annual conference earlier this month in Rockwall.",
        "October 3, 2022",
        "Dezaray Johnson, a certified business advisor in the Angelo State University Small Business Development Center (SBDC), has been selected for an inaugural Top 40 Under 40 Young Professionals Award by America’s SBDC, the association that represents the nationwide SBDC network.",
        "September 19, 2022",
        "Dr. Rebecca Bernard of the Angelo State University English faculty has published her first book of short stories, “Our Sister Who Will Not Die,” through Mad Creek Books, an imprint of the Ohio State University Press.",
        "September 15, 2022",
        "Dr. Drew Curtis of the Angelo State University psychology faculty has been appointed the executive officer for the Southwestern Psychological Association (SWPA), the regional affiliate of the American Psychological Association.",
        "August 18, 2022",
        "Angelo State University employees Tanner Bryant, Dr. Sangeeta Singg and James Reid have been selected to receive the 2021-22 Gary and Pat Rodgers Distinguished Awards honoring outstanding ASU staff, faculty and administrators.",
        "July 26, 2022",
        "Angelo State University has been awarded a $113,292 grant from the Trellis Foundation to fund a research and education project on mental health and wellbeing for college students in general, and ASU students in particular.",
        "June 28, 2022",
        "Angelo State University’s chapter of the Phi Kappa Phi (PKP) national honor society has won a 2022 PKP Literacy Grant that will be used to support the San Angelo Independent School District’s “San Angelo READS!” community-wide literacy initiative.",
        "June 7, 2022",
        "Dr. Joel L. Carr, an associate professor of social work and sociology at Angelo State University, has been elected to the American Board of Clinical Social Work (ABCSW), which sets the national standards for education, advocacy and credentialing for the clinical social work profession.",
        "June 1, 2022",
        "Dr. William A. Taylor, an award-winning professor of global security studies at Angelo State University, has been named the series editor for a new book series titled “Studies in Marine Corps History and Amphibious Warfare” through the Naval Institute Press.",
        "May 18, 2022",
        "Dr. Audrey Heron, an Angelo State University alumna and member of the graduate education faculty, has received a 2022 Outstanding Commitment to Excellence and Innovation in Distance Education by an Individual Award from the Texas Digital Learning Association (TxDLA).",
        "May 10, 2022",
        "Dr. Andrew Tiger, interim dean of Angelo State University’s Norris-Vincent College of Business, has had the “interim” tag removed from his title and been appointed the permanent dean of the college.",
        "May 10, 2022",
        "Dr. Dionne T. Bailey of the Department of Mathematics, Dr. Bruce E. Bechtol Jr. of the Department of Security Studies and Criminal Justice, and Dr. D. Rozena McCabe of the Department of Kinesiology are the winners of Angelo State University’s 2022 President’s Awards for Faculty Excellence.",
        "April 29, 2022",
        "Dr. David Bixler, chair of the Angelo State University Department of Physics and Geosciences, has been appointed the new dean of ASU’s College of Graduate Studies and Research, effective June 1.",
        "April 25, 2022",
        "Four Angelo State University staff members – Zachary Deere, Christabel Romine, Candace Aguirre and Amanda Ritchie – have earned the 2021-22 President’s Awards for Staff Excellence, and another – Jayna Phinney – has received the annual Chancellor’s Colonel Rowan Award for Execution.",
        "April 21, 2022",
        "Dr. Nicole St. Germaine, a professor of English in Angelo State University’s Department of English and Modern Languages, has been selected for the U.S. Department of Education’s 2022 Fulbright-Hays Seminars Abroad program to conduct research in Norway this summer.",
        "April 19, 2022",
        "Dr. Andrew Tiger, interim dean of Angelo State University’s Norris-Vincent College of Business (NVCOB), has been awarded a $151,296 grant from the U.S. Department of Education to enhance internship opportunities for ASU business students through the “NVCOB Internship Expansion Program.”",
        "April 12, 2022",
        "Angelo State University faculty members Dr. William A. Taylor and Dr. Anthony N. Celso have been presented the Texas Tech University System’s 2022 Chancellor’s Council Distinguished Teaching and Research Awards for ASU during an April 12 ceremony in the ASU LeGrand Alumni and Visitors Center.",
        "March 23, 2022",
        "Dr. Sarah Lynch of the Angelo State University history faculty has been elected a Fellow of the Royal Historical Society (RHS), the United Kingdom’s foremost society for historians, based at University College London.",
        "March 10, 2022",
        "Fifteen Angelo State University faculty members have been promoted this spring semester, with their new ranks finalized by the Texas Tech University System Board of Regents during its recent regular meeting in El Paso.",
        "February 18, 2022",
        "More than 100 Angelo State University faculty and staff members, including 13 with a quarter century or more employment with the university, were honored with Service Awards during a ceremony on Thursday, Feb. 17, in the ASU Houston Harte University Center.",
        "January 13, 2022",
        "Angelo State University has received a 2021 Achieving Campus Efficiency (ACE) Award from BM Technologies in recognition of ASU’s exceptional efforts in the electronic disbursement of financial aid credit balance refunds to students using the BankMobile Disbursements service.",
        "December 9, 2021",
        "Dr. Lesley Casarez of Angelo State University’s graduate education faculty received the 2021 John Shirley Advocacy Award from the Texas Counseling Association (TCA) at the TCA’s 65th annual Professional Growth Conference in Galveston.",
        "November 16, 2021",
        "Dr. Micheal W. Salisbury, dean of the Angelo State University College of Graduate Studies and Research, has been appointed the new dean of ASU’s Freshman College, effective Dec. 1.",
        "September 27, 2021",
        "Dr. Jeffrey Dailey of the Angelo State University security studies faculty has co-authored a new textbook titled “Intelligence for Homeland Security: An Introduction” through Colorado-based Lynne Rienner Publishers, an independent publisher of scholarly texts.",
        "September 15, 2021",
        "Dr. Kenneth Carrell, an assistant professor of physics at Angelo State University, has been awarded a two-year, $105,535 grant from the National Science Foundation (NSF) to fund an astrophysics research project that will also involve ASU undergraduate students.",
        "September 9, 2021",
        "Three Angelo State University faculty members have been awarded a $199,597 grant by the National Science Foundation (NSF) to fund a two-year project aimed at increasing the recruitment and retention of students in the science, technology, engineering and mathematics (STEM) fields, particularly students from historically under-represented populations.",
        "August 19, 2021",
        "Phillip Nichelson, Dr. Crystal Kreitler and Dr. Kimberly Livengood have been selected to receive the 2020-21 Gary and Pat Rodgers Distinguished Awards honoring outstanding staff, faculty and administrators at Angelo State University.",
        "August 3, 2021",
        "Dr. William A. Taylor, an associate professor of global security studies at Angelo State University, has been awarded a 2021 Gerald R. Ford Presidential Foundation Research Grant in support of his forthcoming fifth book, “The Advent of the All-Volunteer Force: Protecting Free Society.”",
        "July 1, 2021",
        "Four Angelo State University staff and faculty have been selected for a 2021 Catalyst Award from the Blackboard Inc. global education technology company, and will be recognized at Blackboard’s “BbWorld” annual international conference that will be conducted virtually beginning July 13.",
        "June 7, 2021",
        "Dr. Terence “Terry” Dalrymple, a member of the Angelo State University English faculty for 40 years until his retirement in May 2020, has been awarded the title of Distinguished Professor of English Emeritus by the Texas Tech University System Board of Regents.",
        "June 2, 2021",
        "Dr. Bradley Cesario of the Angelo State University history faculty has published his first book, titled “New Crusade: The Royal Navy and British Navalism, 1884-1914,” through De Gruyter, an international publishing house based in Berlin, Germany, that specializes in academic literature.",
        "May 20, 2021",
        "Four Angelo State University staff members – Brittney Miller, Christopher Houston, Thomas Jones and Mark Rehm – have earned the 2020-21 President’s Awards for Staff Excellence, and another – Paul Hamilton – has received the annual Chancellor’s Colonel Rowan Award for Execution.",
        "May 17, 2021",
        "More than 50 Angelo State University staff members have been nominated for ASU’s annual President’s Awards for Staff Excellence, and 15 staff members have been nominated for the annual Chancellor’s Colonel Rowan Award for Execution.",
        "May 7, 2021",
        "Dr. William A. Taylor and Dr. Anthony N. Celso of the Department of Security Studies and Criminal Justice and Dr. Sangeeta Singg of the Department of Psychology and Sociology are the winners of Angelo State University’s 2021 President’s Awards for Faculty Excellence.",
        "May 3, 2021",
        "Outstanding Angelo State University faculty members will be honored during the 12th annual Faculty Recognition Ceremony on Thursday, May 6, in the ASU Houston Harte University Center.",
        "April 23, 2021",
        "More than 100 Angelo State University faculty and staff members, including 14 with a quarter century or more employment with the university, are being honored with 2021 Service Awards.",
        "April 1, 2021",
        "Drs. Christine Purkiss and Donna Gee of Angelo State University’s teacher education faculty have been awarded a $32,256 grant from the U.S. Department of Health and Human Services through the Texas Workforce Commission to support their 2021 “Camp Code” summer program for local and area middle school students.",
        "March 22, 2021",
        "Dr. Renee Foshee of the Angelo State University accounting faculty has been appointed to the Texas State Board of Public Accountancy (TSBPA) by Gov. Greg Abbott for a term that will run through January 2027.",
        "March 19, 2021",
        "Dr. Drew Curtis of the Angelo State University psychology faculty has been appointed president-interim of the Psychological Association of Greater West Texas (PAGWT), the area branch of the Texas Psychological Association.",
        "March 15, 2021",
        "Michelle Miller, special assistant to the president and Title IX coordinator at Angelo State University, has been appointed to the Safety Planning Working Group for the Texas Governor’s Sexual Assault Survivors’ Task Force (SASTF).",
        "March 12, 2021",
        "Eighteen Angelo State University faculty members have been promoted this spring semester, with their new ranks finalized by the Texas Tech University System Board of Regents during its recent regular meeting in Lubbock.",
        "March 10, 2021",
        "Dr. William A. Taylor, an associate professor of global security studies at Angelo State University, has been awarded the 2021 Sharon Ritenour Stevens Prize from the Association for Documentary Editing (ADE).",
        "March 5, 2021",
        "Dr. Sangeeta Singg, a professor of psychology at Angelo State University, has been appointed by Texas Gov. Greg Abbott to the Texas State Board of Examiners of Psychologists (TSBEP) for a term that will run through October 31, 2025.",
        "December 10, 2020",
        "Dr. William A. Taylor, an associate professor of global security studies at Angelo State University, has been awarded three 2021 national research grants in support of his upcoming fifth book, “The Advent of the All-Volunteer Force: Protecting Free Society.”",
        "December 7, 2020",
        "Ashley Atwood, Dr. Lesley Casarez and Dr. Audrey Heron of the Angelo State University curriculum and instruction faculty have been awarded a 2020 Exemplary Course Program Award by Blackboard Inc., a leading global education technology company.",
        "November 24, 2020",
        "Dr. Jaeyong Choi of the Angelo State University criminal justice faculty recently received the 2020 Junior Faculty Research Award from the Korean Society of Criminology in America (KOSCA) during the society’s virtual national conference.",
        "October 6, 2020",
        "Angelo State University’s online Master of Science (M.S.) in professional school counseling degree program and its director, Dr. Lesley Casarez, have been selected for a 2020 John R. Bourne Outstanding Online Program Award by the Online Learning Consortium (OLC).",
        "September 18, 2020",
        "Angelo State University has been named one of the nation’s “Great Colleges to Work For” for 2020 by ModernThink, and has been recognized in a special edition of The Chronicle of Higher Education, the major national news source for college and university faculty and administrators.",
        "September 4, 2020",
        "Three Angelo State University professors have joined with other faculty from colleges and universities across the country to produce the first Open Educational Resource digital textbook for U.S. history that aligns with College Board Advanced Placement (AP) standards.",
        "August 28, 2020",
        "Dr. Kyle Beran, chair of the Department of Chemistry and Biochemistry at Angelo State University, has been selected by the College Board Advanced Placement (AP) Program as the next AP Chemistry chief faculty consultant.",
        "August 12, 2020",
        "A book published by Dr. William A. Taylor of the Angelo State University global security studies faculty has been selected as required reading for every first-year cadet at the U.S. Military Academy at West Point, starting this fall.",
        "July 16, 2020",
        "Don Cheek, Dr. Drew Curtis and Dr. Clifton Jones have been selected to receive the 2019-20 Gary and Pat Rodgers Distinguished Awards honoring outstanding staff, faculty and administrators at Angelo State University.",
        "July 15, 2020",
        "Angelo State University announced the winners of its annual awards for faculty and staff excellence during a virtual awards ceremony on July 15.",
        "July 14, 2020",
        "Dr. Michael Conklin, the Powell Endowed Professor of Business Law at Angelo State University, recently published a provocative research paper regarding U.S. presidential candidate Joe Biden’s vow to select a female running mate.",
        "July 9, 2020",
        "Dr. William A. Taylor, an associate professor of global security studies at Angelo State University and holder of the Lee Drain Endowed University Professorship, has published his fourth book, titled “George C. Marshall and the Early Cold War: Policy, Politics, and Society.”",
        "June 18, 2020",
        "Angelo State University has partnered with Howard College, the San Angelo Independent School District and the 17th Training Group at Goodfellow Air Force Base to create a new Center for Teaching and Learning Excellence (CTLE) program for professional faculty development.",
        "May 19, 2020",
        "Dr. Michael Conklin, the Powell Endowed Professor of Business Law at Angelo State University, recently published two research papers on legal issues spawned by the COVID-19 pandemic.",
        "February 13, 2020",
        "Dr. Denise Goddard of the Angelo State University nursing faculty, who teaches online graduate nursing courses from her home in North Richland Hills, has been named one of the Dallas-Fort Worth Great 100 Nurses for 2020.",
        "February 7, 2020",
        "More than 100 Angelo State University faculty and staff members, including 13 with a quarter century or more employment with the university, were honored with Service Awards during ceremonies on Tuesday, Feb. 4, in the Houston Harte University Center on the ASU campus.",
        "November 19, 2019",
        "Dr. Lesley Casarez of Angelo State University’s graduate education faculty has been named the 2020 Distinguished Young Alumna for Sul Ross State University in Alpine, where she earned a master’s degree in counseling in 2008.",
        "November 7, 2019",
        "Gayle Randall, an Angelo State University alumna and member of the management and marketing faculty, received the Order of the Silver Helmet Award from the national Delta Sigma Pi professional business fraternity at the organization’s recent LEAD School in Kansas City, Mo.",
        "November 5, 2019",
        "Dr. Sangeeta Singg, a professor of psychology at Angelo State University, received “Top Honors with an Award of Meritorious Service” from the Psychological Association of Greater West Texas (PAGWT) and River Crest Hospital of San Angelo at a recent meeting of the PAGWT.",
        "October 29, 2019",
        "Dr. Tia Agan, an Angelo State University alumna and member of the curriculum and instruction faculty, received the 2019 Ted Booker Memorial Award for outstanding contributions in the field of teacher education at the Consortium of State Organizations for Texas Teacher Education (CSOTTE) annual conference on Oct. 27 in Frisco.",
        "October 21, 2019",
        "Dr. Cody Scott, an Angelo State University alumnus and member of the ASU agriculture faculty, was named a Fellow of the Texas Section, Society for Range Management at the TSSRM’s annual meeting earlier this month in Kerrville.",
        "October 17, 2019",
        "Dr. Loren Ammerman of the Angelo State University biology faculty has teamed with two of her students and three other researchers from Cameron University to publish the results of their research on Eastern red bats in the Journal of Heredity, the flagship publication of the American Genetic Association.",
        "October 16, 2019",
        "Three Angelo State University faculty members have been awarded Endowed University Professorships that will provide them with additional funding to support their research and/or creative endeavors.",
        "October 10, 2019",
        "Dr. Leslie Rodriguez of the Angelo State University communication faculty has been named a 2019 Educator of the Year by the Texas Speech Communication Association (TSCA) at the organization’s annual conference held Oct. 3-5 in Amarillo.",
        "October 8, 2019",
        "Angelo State University has formed a collaborative partnership with Texas Education Service Center (ESC) Region 15 for a $2.3 million grant-funded program to increase the number of public school counselors employed in rural school districts within Region 15.",
        "September 16, 2019",
        "Angelo State University has been named one of the nation’s “Great Colleges to Work For” for 2019 by ModernThink, and will be recognized in a special edition of The Chronicle of Higher Education, the major national news source for college and university faculty and administrators.",
        "September 4, 2019",
        "Eight Angelo State University faculty members have been awarded a total of nearly $90,000 in grant funding through ASU’s Faculty Research Enhancement Program (FREP) for research projects to be completed during the 2019-20 academic year.",
        "August 22, 2019",
        "Christabel Romine, Dr. Lee Atkins and James “Dan” Robertson have been selected to receive the 2018-19 Gary and Pat Rodgers Distinguished Awards honoring outstanding staff, faculty and administrators at Angelo State University.",
        "August 14, 2019",
        "Dr. Shelly Weise, chair of Angelo State University’s Department of Physical Therapy, has been named the James A. “Buddy” Davidson Chair in Physical Therapy in ASU’s Archer College of Health and Human Services.",
        "July 29, 2019",
        "Angelo State University has been selected for a 2019 Catalyst Award from Blackboard Inc., a global education technology company, and was recognized at Blackboard’s “BbWorld” international conference held July 23-25 in Austin.",
        "July 16, 2019",
        "Dr. Lesley Casarez of Angelo State University’s graduate education faculty has been awarded a 2019 Literacy Grant by The Honor Society of Phi Kappa Phi to help fund the implementation of a new social emotional learning (SEL) program at San Angelo’s Lee Middle School.",
        "May 9, 2019",
        "Dr. John E. Klingemann, chair of the Angelo State University Department of History, has been appointed the new dean of ASU’s College of Arts and Humanities, effective July 1.",
        "May 3, 2019",
        "Michael J. Burnett of the Department of Visual and Performing Arts, Dr. Eddie F. “Trey” Holik III of the Department of Physics and Geosciences, and Dr. William A. Taylor of the Department of Security Studies and Criminal Justice are the winners of Angelo State University’s 2019 President’s Awards for Faculty Excellence.",
        "April 25, 2019",
        "Outstanding Angelo State University faculty members will be honored during the 10th annual Faculty Recognition Dinner on Thursday, May 2, at 7 p.m. in the Houston Harte University Center, 1910 Rosemont Drive.",
        "April 17, 2019",
        "Four Angelo State University staff members – Paul Hamilton, Ty Walden, Jon Wilcox and Brittany Wollman – have earned the 2018 President’s Awards for Staff Excellence, and another – Curt Braden – has received the annual Chancellor’s Colonel Rowan Award for Execution.",
        "April 9, 2019",
        "Seventy-six Angelo State University staff members have been nominated for ASU’s annual President’s Awards for Staff Excellence, and six staff members have been nominated for the annual Chancellor’s Colonel Rowan Award for Execution.",
        "April 4, 2019",
        "Drs. Christine Purkiss and Donna Gee of Angelo State University’s teacher education faculty have been awarded a $42,000 grant from the Texas Workforce Commission to conduct a new “Coding Camp 4 Girls” program this summer for local and area middle school girls.",
        "April 3, 2019",
        "Dr. Micheal W. Salisbury, chair of the Angelo State University Department of Agriculture, has been appointed the new dean of ASU’s College of Graduate Studies and Research, effective June 1.",
        "March 20, 2019",
        "Dr. John Wegner, dean of the Freshman College at Angelo State University, has been designated a 2019 Outstanding First-Year Student Advocate by the National Resource Center for The First-Year Experience and Students in Transition.",
        "March 18, 2019",
        "Dr. Drew Curtis of the Angelo State University psychology faculty has been elected president of the Southwestern Psychological Association (SWPA), the official American Psychological Association (APA) affiliate for the Southwestern Region of the U.S.",
        "February 13, 2019",
        "Dr. Sangeeta Singg, a professor of psychology at Angelo State University, received the Jimmy Alvarez Friend of Counseling Award from the Three Rivers Counseling Association (TRCA) at its annual awards ceremony earlier this month.",
        "February 1, 2019",
        "More than 100 Angelo State University faculty and staff members, including 12 with a quarter century or more employment with the university, were honored with Service Awards during ceremonies on Thursday, Jan. 31, in the Houston Harte University Center on the ASU campus.",
        "January 29, 2019",
        "Texas Tech University System Chancellor Dr. Tedd L. Mitchell recently recognized 13 faculty members from the TTU System’s four institutions as recipients of the 2019 Chancellor’s Council Distinguished Teaching and Research Awards. These awards recognize excellence in academics and research, and are the most prestigious honors given to faculty members within the TTU System.",
        "January 24, 2019",
        "Dr. Loren Ammerman, a professor of biology at Angelo State University, has joined with three ASU alumni and two other researchers to publish the first-ever comprehensive field identification guide for all 51 species of bats that currently inhabit the U.S.",
        "January 17, 2019",
        "The ASU Biology Department’s Angelo State Natural History Collections (ASNHC) is prominently featured in a research article published in the December 2018 issue of the Journal of Mammalogy, the flagship publication of the American Society of Mammalogists.",
        "January 15, 2019",
        "Dr. Matthew Gritter of the Angelo State University political science faculty has published a new book that explores how Republican U.S. presidents have approached the issue of Social Security, reaching back to the Eisenhower administration.",
        "January 7, 2019",
        "Dr. William A. Taylor, an associate professor of security studies at Angelo State University, has published his third book, “Contemporary Security Issues in Africa,” through the Praeger publishing company.",
        "November 28, 2018",
        "Dr. Chris Ellery of the Angelo State University English faculty has published a new book of original poems titled “Canticles of the Body: A Meditation on the Liturgical Cycle” through Wipf and Stock Publishers.",
        "November 14, 2018",
        "Dr. William A. Taylor, an associate professor of security studies at Angelo State University, has been selected as the editor of a new book series, “Studies in Civil-Military Relations,” through the University Press of Kansas.",
        "October 22, 2018",
        "Dr. Robert Dowler, a professor of biology at Angelo State University, has been awarded a three-year, $421,611 contract by the Texas Comptroller of Public Accounts (TCPA) to conduct a research project dealing with plains spotted skunks in East Texas.",
        "September 26, 2018",
        "Dr. Kenneth J. Heineman of the Angelo State University security studies faculty recently published a new book on modern conservatism through Routledge, one of the world’s leading academic publishers in the humanities and social sciences.",
        "August 29, 2018",
        "Dr. Bruce Bechtol Jr. of the Angelo State University security studies faculty recently published his fifth book dealing with military and political issues in North Korea through the University Press of Kentucky.",
        "August 23, 2018",
        "Annette Dixon, Dr. Russell Wilke and Julie Ruthenbeck have been selected to receive the 2017-18 Gary and Pat Rodgers Distinguished Awards honoring outstanding staff, faculty and administrators at Angelo State University.",
        "August 20, 2018",
        "Chris Matz, formerly the associate dean for public services at the University of North Texas, has been hired as the new executive director of Angelo State University’s Porter Henderson Library.",
        "July 16, 2018",
        "Angelo State University has been named one of the nation’s “Great Colleges to Work For” for 2018 by The Chronicle of Higher Education, the major national news source for college and university faculty and administrators.",
        "June 21, 2018",
        "Dr. Greg Krukonis of the Angelo State University biology faculty has been awarded a $39,174 grant by the National Park Service (NPS) for a research project that may lead to new methods of preserving wooden structures in national parks and other historic sites.",
        "June 12, 2018",
        "Through its online security studies degree programs, Angelo State reaches military and civilian students in countries around the world. Dr. Randy Mullis of the security studies faculty reaches even more of them in person.",
        "May 14, 2018",
        "Dr. Kenna Archer of the Angelo State University history faculty has been awarded the 2018 UNT Special Collections Research Fellowship by the University of North Texas Libraries.",
        "May 4, 2018",
        "Michael J. Burnett of the Department of Visual and Performing Arts, Dr. Andrew B. Wallace of the Department of Physics and Geosciences, and Dr. Joseph I. Satterfield of the Department of Physics and Geosciences are the winners of Angelo State University’s 2018 President’s Awards for Faculty Excellence.",
        "April 26, 2018",
        "Outstanding Angelo State University faculty members will be honored during the ninth annual Faculty Recognition Dinner at 7 p.m. on Thursday, May 3, in the Houston Harte University Center, 1910 Rosemont Drive.",
        "April 5, 2018",
        "Dr. Drew Curtis of the Angelo State University psychology faculty has co-authored a new book on abnormal behavior that is now available for purchase through the Kendall Hunt Publishing Company.",
        "March 8, 2018",
        "Four Angelo State University staff members – Chris Steele, Phillip Nichelson, Kerri Mikulik and Jason Brake – have earned the 2017 President’s Awards for Staff Excellence, and another – Kevin Conner – has received the annual Chancellor’s Colonel Rowan Award for Execution.",
        "February 2, 2018",
        "More than 90 Angelo State University faculty and staff members, including 11 with a quarter century or more employment with the university, were honored with Service Awards during ceremonies on Thursday, Feb. 1, in the Houston Harte University Center on the ASU campus.",
        "January 31, 2018",
        "Texas Tech University System Chancellor Robert Duncan recently recognized 14 faculty members from the system’s four component institutions as recipients of the 2018 Chancellor’s Council Distinguished Teaching and Research Awards. These awards recognize excellence in academics and research, and are the most prestigious honors granted to faculty members throughout the TTU System.",
        "January 16, 2018",
        "Dr. Andrea Robledo, formerly the academic advisor for ASU’s David L. Hirschfeld Department of Engineering, has been promoted to be the director of STEM HSI programs at ASU.",
        "January 5, 2018",
        "Dr. William Kitch, chair of the David L. Hirschfeld Department of Engineering at Angelo State University, has been tabbed as the lead principal investigator for a project funded by a grant from the National Science Foundation (NSF) for the purpose of conducting a regional conference for stakeholders in undergraduate Hispanic science, technology, engineering and mathematics (STEM) education.",
        "December 7, 2017",
        "Angelo State University has received a 2017 ACE Award from BankMobile Disbursements for achieving a rate of over 90 percent for electronic disbursement of financial aid credit balance refunds to students.",
        "November 30, 2017",
        "Dr. William A. Taylor, an associate professor of security studies at Angelo State University, has been awarded three 2018 national research grants, including a Theodore C. Sorensen Research Fellowship from the John F. Kennedy Library Foundation, a Gerald R. Ford Presidential Foundation Research Grant and a Harry S. Truman Library Institute Research Grant.",
        "November 20, 2017",
        "Dr. Matthew Gritter of the Angelo State University political science faculty has published a new book that explores attempts to reform the Supplemental Nutrition Assistance Program (SNAP), formerly known as food stamps.",
        "November 17, 2017",
        "Already no stranger to China, Dr. Jeff Schonberg is the latest ASU representative to head to the Far East and help pave the way for more international students to come to Angelo State.",
        "November 13, 2017",
        "Dr. Javier Flores, vice president for student affairs and enrollment management at Angelo State University, has been invited to join the Board of Directors for Education Reach for Texans (ERT), an organization that supports former foster care youths in their pursuit of higher education.",
        "November 7, 2017",
        "The ongoing Range Reclamation Project conducted by Angelo State University’s Department of Agriculture and Department of Physics and Geosciences was recognized with the 2017 Bruno Hanson/Midland College Environmental Excellence Award by the Midland College Petroleum Professional Development Center (PPDC) on Nov. 6 at the Executive Oil Conference in Midland.",
        "November 3, 2017",
        "Though he has long studied the poetry, history, politics and geography of Chile, Dr. David Faught, associate professor of Spanish, had never actually been there.",
        "October 9, 2017",
        "If you happen to see the ASU logo on CNN or Fox News, chances are it is on the screen behind Dr. Bruce Bechtol as he gets interviewed about the latest crisis involving North Korea.",
        "September 18, 2017",
        "Through the enthusiastic guidance of Dr. Susana Badiola, ASU’s philosophy program has grown and flourished since her arrival in 2004.",
        "August 29, 2017",
        "Drs. Azadeh Bolhari and Daniel Castaneda of the Angelo State University engineering faculty, along with former faculty member Dr. Alex Mejia, have been awarded a $99,997 grant from the National Science Foundation (NSF) for a new research project on community water quality.",
        "August 24, 2017",
        "Kelsey Samsel, Dr. Cody Scott and Tara Hart have been named the winners of the 2016-17 Gary and Pat Rodgers Distinguished Awards honoring outstanding staff, faculty and administrators at Angelo State University.",
        "July 28, 2017",
        "“Service to others is the rent you pay for your room here on this earth.”",
        "June 27, 2017",
        "Susan J. Williams, director of affiliated military and veteran services at Angelo State University, has been named the 2017-18 spokesperson for four-year public institutions for the Texas Association of Collegiate Veteran Program Officials (TACVPO).",
        "May 30, 2017",
        "For Dr. Kanisorn Wongsrichanalai, research and teaching go hand in hand.",
        "May 5, 2017",
        "Dr. Nicole M. Dilts of the Department of English and Modern Languages, Dr. Susana Badiola of the Department of Political Science and Philosophy, and Dr. Kanisorn Wongsrichanalai of the Department of History are the winners of Angelo State University’s 2017 President’s Awards for Faculty Excellence.",
        "April 24, 2017",
        "Dr. Loren Ammerman of the Angelo State University biology faculty has been awarded a $26,998 grant sub-award by the U.S. Fish and Wildlife Service to participate in a two-year research project dedicated to protecting an endangered bat species native to Southwest Texas.",
        "April 6, 2017",
        "Two Angelo State University biology students were elected region officers, and Dr. Crosby Jones of the ASU biology faculty received a Distinguished Service Award at the Beta Beta Beta (Tri-Beta) national biology honor society’s annual South Central Regional Convention held March 31-April 2 in Cedar Hill.",
        "April 4, 2017",
        "A new reference book for educators and researchers co-edited by Dr. Carolyn Gascoigne, dean of the Angelo State University College of Arts and Humanities, has been published by Channel View Publications.",
        "April 3, 2017",
        "Admissions Director Sharla Adam has a true passion for ASU and is one of the prime forces behind the university’s dramatically increasing enrollment.",
        "March 15, 2017",
        "Dr. Drew Curtis of the Angelo State University psychology faculty has been elected to serve as a professional representative on the Executive Council of the Southwestern Psychological Association (SWPA).",
        "March 8, 2017",
        "Dr. Joel Alejandro (Alex) Mejia of the Angelo State University civil engineering faculty has been chosen to receive the 2016 William Elgin Wickenden Award by the American Society for Engineering Education (ASEE) for having the best research paper published in the ASEE’s Journal of Engineering Education during the 2016 volume year.",
        "March 6, 2017",
        "Four Angelo State University staff members – Tom Nurre Jr., Drexene Winey, Andrea Robledo and Michelle Norris – have earned the 2016 President’s Awards for Staff Excellence, and another – Sharla Adam – has received the annual Chancellor’s Colonel Rowan Award for Execution",
        "February 27, 2017",
        "Dr. Christine Purkiss, a self-proclaimed “behind-the-scenes-type person,” was recently thrust into the limelight when she was chosen for one of the Texas Tech University System’s most prestigious awards.",
        "February 23, 2017",
        "Dr. James Ward of the Angelo State University geosciences faculty has been named a 2017 Distinguished Alumnus of Sul Ross State University by the SRSU Alumni Association and was honored at a banquet on Feb. 18 on the SRSU campus in Alpine.",
        "February 20, 2017",
        "Dr. Marva Solomon of the Angelo State University teacher education faculty has been awarded a $20,000 grant by the U.S. Department of Education through the National Writing Project (NWP) to expand the scope of ASU’s Pearl of the Concho Writing Project.",
        "February 8, 2017",
        "Supporting communities through teaching has always been a priority for Edwin Cuenco of the ASU art faculty, both on campus and abroad.",
        "January 27, 2017",
        "Nearly 90 Angelo State University faculty and staff members, including 12 with a quarter century or more employment with the university, were honored with Service Awards during ceremonies on Thursday, Jan. 26, in the Houston Harte University Center on the ASU campus.",
        "January 26, 2017",
        "Dr. Joel Alejandro (Alex) Mejia of the Angelo State University civil engineering faculty is one of four co-recipients of a $184,672 grant from the National Science Foundation to establish and host a national conference to promote literacy learning in all levels of engineering education, with a focus on under-represented population groups.",
        "December 16, 2016",
        "An innate desire to help people and make a difference drove Dr. Lesley Casarez to make a career change over a decade ago, and now both she and her ASU students are reaping the benefits.",
        "November 9, 2016",
        "Jamie Akin, Angelo State University’s executive director of development and alumni relations since 2012, has been promoted to vice president for development and alumni relations, effective immediately.",
        "October 17, 2016",
        "Dr. Leslie Y. Rodriguez, an assistant professor of communication at Angelo State University, has been named the new editor of the Texas Speech Communication Journal, the official publication of the Texas Speech Communication Association (TSCA).",
        "October 12, 2016",
        "Dr. Jamal Husein, a professor of economics at Angelo State University, has been named the new holder of the Norris Family Chair in Business in the ASU College of Business.",
        "October 11, 2016",
        "Dr. Kenneth J. Heineman of Angelo State University’s history faculty has been elected to a three-year term on the Council of the Pennsylvania Historical Association (PHA).",
        "September 29, 2016",
        "Dr. Carolyn Gascoigne, dean of Angelo State University’s College of Arts and Humanities, has published a research article in the September 2016 issue of The Reading Matrix, an international journal for second language acquisition and applied linguistics.",
        "September 21, 2016",
        "The positive effects Dr. Bradley Petty has had on ASU’s recreation and intramurals program (UREC) and its staff are a primary reason he was recently honored with one of the university’s most prestigious awards.",
        "September 9, 2016",
        "Dr. Chris Ellery of the Angelo State University English faculty has published a new book of original poems titled “Elder Tree” through Lamar University Literary Press.",
        "August 24, 2016",
        "Dr. Christine Lamberson and Dr. Kanisorn Wongsrichanalai of the Angelo State University history faculty have been awarded a $1,200 grant by the Library of America to support a new series of public programs associated with the Library of America’s “World War I and America” initiative.",
        "August 22, 2016",
        "Dr. Drew Curtis of the Angelo State University psychology faculty has co-authored a new textbook on abnormal psychology that has been published just in time for use in ASU classes during the upcoming fall semester.",
        "March 11, 2016",
        "More than 100 Angelo State University faculty and staff members, including 17 with a quarter century or more employment with the university, were honored with Service Awards during ceremonies on Thursday, March 10, in the Houston Harte University Center on the ASU campus.",
        "May 7, 2015",
        "More than 120 Angelo State University faculty and staff members, including 14 with a quarter century or more employment with the university, were honored with Service Awards during ceremonies on Wednesday, May 6, in the Houston Harte University Center on the ASU campus.",
        "April 15, 2014",
        "Fifty Angelo State University faculty and staff, including 13 with a quarter century or more employment with the university, were honored with Service Awards during ceremonies on Monday, April 14, in the Houston Harte University Center on the ASU campus.",
        "April 18, 2013",
        "Fifty Angelo State University faculty and staff, including 16 with a quarter century or more employment with the university, were honored with Service Awards during ceremonies on Wednesday, April 17, in the Houston Harte University Center on the ASU campus.",
        "April 10, 2012",
        "Fifty-four Angelo State University faculty and staff, including 10 with a quarter century or more employment with the university, were honored with Service Awards during ceremonies on Monday, April 9, in the Houston Harte University Center on the ASU campus.",
        "April 18, 2011",
        "Seventy Angelo State University faculty and staff, including nine with a quarter century or more employment with the university, were honored with Service Awards during ceremonies Thursday, April 14, in the Houston Harte University Center on the ASU campus.",
        "April 28, 2010",
        "Sixty-one Angelo State University faculty and staff, including 12 with a quarter century or more employment with the university, were honored with Service Awards during ceremonies Tuesday, April 27, in the Houston Harte University Center on the ASU campus."
    ],
    "list_items": [],
    "table_headers": [],
    "table_data": [],
    "captions": [],
    "links": [
        "/live/news/19519-teacher-education-prof-joins-leadership-of-s",
        "/live/news/19519-teacher-education-prof-joins-leadership-of-s",
        "/live/news/19514-history-professor-selected-for-prestigious",
        "/live/news/19514-history-professor-selected-for-prestigious",
        "/live/news/19504-agriculture-prof-students-alumni-shine-at",
        "/live/news/19504-agriculture-prof-students-alumni-shine-at",
        "/live/news/19500-biology-instructor-publishes-new-book-on-car",
        "/live/news/19500-biology-instructor-publishes-new-book-on-car",
        "/live/news/19483-national-science-foundation-grant-to-fund-bi",
        "/live/news/19483-national-science-foundation-grant-to-fund-bi",
        "/live/news/19367-2024-rodgers-distinguished-awards-winners",
        "/live/news/19367-2024-rodgers-distinguished-awards-winners",
        "/live/news/19366-2023-24-presidents-awards-for-staff-excellen",
        "/live/news/19366-2023-24-presidents-awards-for-staff-excellen",
        "/live/news/19365-2024-presidents-awards-for-faculty-excellenc",
        "/live/news/19365-2024-presidents-awards-for-faculty-excellenc",
        "/live/news/19358-ttus-chancellors-council-2024-distinguished-",
        "/live/news/19358-ttus-chancellors-council-2024-distinguished-",
        "/live/news/19344-accounting-professor-selected-for-endowed-ch",
        "/live/news/19344-accounting-professor-selected-for-endowed-ch",
        "/live/news/19336-2024-faculty-promotions-approved-by-board-of",
        "/live/news/19336-2024-faculty-promotions-approved-by-board-of",
        "/live/news/19333-admissions-officer-wins-statewide-award",
        "/live/news/19333-admissions-officer-wins-statewide-award",
        "/live/news/19326-2024-facultystaff-service-awards-recipients",
        "/live/news/19326-2024-facultystaff-service-awards-recipients",
        "/live/news/19266-english-professor-publishes-new-book-of-poet",
        "/live/news/19266-english-professor-publishes-new-book-of-poet",
        "/live/news/19221-college-of-education-dean-wins-state-award-f",
        "/live/news/19221-college-of-education-dean-wins-state-award-f",
        "/live/news/19206-psychology-professor-publishes-new-book-on-b",
        "/live/news/19206-psychology-professor-publishes-new-book-on-b",
        "/live/news/19204-2022-23-rodgers-distinguished-awards-winners",
        "/live/news/19204-2022-23-rodgers-distinguished-awards-winners",
        "/live/news/19199-economics-professor-chosen-for-endowed-chair",
        "/live/news/19199-economics-professor-chosen-for-endowed-chair",
        "/live/news/19185-education-professor-named-president-of-state",
        "/live/news/19185-education-professor-named-president-of-state",
        "/live/news/19180-award-winning-professor-publishes-new-book-o",
        "/live/news/19180-award-winning-professor-publishes-new-book-o",
        "/live/news/19173-english-professor-chosen-for-fulbright-progr",
        "/live/news/19173-english-professor-chosen-for-fulbright-progr",
        "/live/news/19166-modern-languages-prof-chosen-for-fulbright-p",
        "/live/news/19166-modern-languages-prof-chosen-for-fulbright-p",
        "/live/news/19161-2023-staff-excellence-awards-winners",
        "/live/news/19161-2023-staff-excellence-awards-winners",
        "/live/news/19160-2023-presidents-awards-for-faculty-excellenc",
        "/live/news/19160-2023-presidents-awards-for-faculty-excellenc",
        "/live/news/19159-faculty-receive-ttus-chancellors-council",
        "/live/news/19159-faculty-receive-ttus-chancellors-council",
        "/live/news/19138-history-professor-earns-prestigious-fellowsh",
        "/live/news/19138-history-professor-earns-prestigious-fellowsh",
        "/live/news/19137-psych-prof-elected-president-of-regional",
        "/live/news/19137-psych-prof-elected-president-of-regional",
        "/live/news/19133-global-security-studies-professor-publishes-",
        "/live/news/19133-global-security-studies-professor-publishes-",
        "/live/news/19132-2023-faculty-promotions-approved-by-board-of",
        "/live/news/19132-2023-faculty-promotions-approved-by-board-of",
        "/live/news/19131-new-director-for-small-business-development-",
        "/live/news/19131-new-director-for-small-business-development-",
        "/live/news/19130-2023-angelo-state-faculty-staff-service-awar",
        "/live/news/19130-2023-angelo-state-faculty-staff-service-awar",
        "/live/news/19085-psychology-prof-wins-research-grant-publishe",
        "/live/news/19085-psychology-prof-wins-research-grant-publishe",
        "/live/news/19072-business-prof-wins-national-advising-award",
        "/live/news/19072-business-prof-wins-national-advising-award",
        "/live/news/19046-communication-prof-wins-state-service-award",
        "/live/news/19046-communication-prof-wins-state-service-award",
        "/live/news/19002-sbdc-advisor-earns-national-recognition",
        "/live/news/19002-sbdc-advisor-earns-national-recognition",
        "/live/news/18991-english-professor-publishes-first-book-of-sh",
        "/live/news/18991-english-professor-publishes-first-book-of-sh",
        "/live/news/18980-psychology-prof-appointed-to-regional-leader",
        "/live/news/18980-psychology-prof-appointed-to-regional-leader",
        "/live/news/18915-2021-22-rodgers-distinguished-awards-winners",
        "/live/news/18915-2021-22-rodgers-distinguished-awards-winners",
        "/live/news/18874-asu-wins-grant-for-student-mental-health-res",
        "/live/news/18874-asu-wins-grant-for-student-mental-health-res",
        "/live/news/18853-honor-society-wins-grant-for-saisd-literacy",
        "/live/news/18853-honor-society-wins-grant-for-saisd-literacy",
        "/live/news/18839-social-work-prof-elected-to-national-standar",
        "/live/news/18839-social-work-prof-elected-to-national-standar",
        "/live/news/18830-security-studies-prof-named-editor-of-new-bo",
        "/live/news/18830-security-studies-prof-named-editor-of-new-bo",
        "/live/news/18814-school-counseling-prof-wins-state-distance",
        "/live/news/18814-school-counseling-prof-wins-state-distance",
        "/live/news/18795-dean-named-for-norris-vincent-college-of-bus",
        "/live/news/18795-dean-named-for-norris-vincent-college-of-bus",
        "/live/news/18794-2022-faculty-excellence-awards-winners",
        "/live/news/18794-2022-faculty-excellence-awards-winners",
        "/live/news/18776-longtime-physics-prof-appointed-dean-of-the",
        "/live/news/18776-longtime-physics-prof-appointed-dean-of-the",
        "/live/news/18771-2021-22-staff-awards-winners",
        "/live/news/18771-2021-22-staff-awards-winners",
        "/live/news/18767-english-prof-chosen-for-fulbright-seminar-in",
        "/live/news/18767-english-prof-chosen-for-fulbright-seminar-in",
        "/live/news/18762-business-dean-wins-grant-to-expand-internshi",
        "/live/news/18762-business-dean-wins-grant-to-expand-internshi",
        "/live/news/18757-faculty-receive-ttus-chancellors-council",
        "/live/news/18757-faculty-receive-ttus-chancellors-council",
        "/live/news/18742-history-prof-earns-prestigious-international",
        "/live/news/18742-history-prof-earns-prestigious-international",
        "/live/news/18732-2022-asu-faculty-promotions",
        "/live/news/18732-2022-asu-faculty-promotions",
        "/live/news/18721-2022-faculty-staff-service-awards-honorees",
        "/live/news/18721-2022-faculty-staff-service-awards-honorees",
        "/live/news/18701-national-award-for-student-refunds-disbursem",
        "/live/news/18701-national-award-for-student-refunds-disbursem",
        "/live/news/18657-school-counseling-prof-earns-state-advocacy-",
        "/live/news/18657-school-counseling-prof-earns-state-advocacy-",
        "/live/news/18636-angelo-state-alum-appointed-new-asu-freshman",
        "/live/news/18636-angelo-state-alum-appointed-new-asu-freshman",
        "/live/news/18572-security-studies-prof-publishes-new-textbook",
        "/live/news/18572-security-studies-prof-publishes-new-textbook",
        "/live/news/18558-physics-prof-wins-national-science-foundatio",
        "/live/news/18558-physics-prof-wins-national-science-foundatio",
        "/live/news/18549-faculty-win-national-science-foundation-gran",
        "/live/news/18549-faculty-win-national-science-foundation-gran",
        "/live/news/18538-2020-21-rodgers-distinguished-awards-winners",
        "/live/news/18538-2020-21-rodgers-distinguished-awards-winners",
        "/live/news/18509-security-studies-prof-wins-ford-presidential",
        "/live/news/18509-security-studies-prof-wins-ford-presidential",
        "/live/news/18466-angelo-state-wins-international-catalyst-awa",
        "/live/news/18466-angelo-state-wins-international-catalyst-awa",
        "/live/news/18433-longtime-english-prof-awarded-emeritus-statu",
        "/live/news/18433-longtime-english-prof-awarded-emeritus-statu",
        "/live/news/18428-history-instructor-publishes-first-book-on-b",
        "/live/news/18428-history-instructor-publishes-first-book-on-b",
        "/live/news/18412-2021-staff-excellence-awards-winners",
        "/live/news/18412-2021-staff-excellence-awards-winners",
        "/live/news/18408-2021-staff-excellence-awards-nominees",
        "/live/news/18408-2021-staff-excellence-awards-nominees",
        "/live/news/18399-2021-presidents-awards-for-faculty-excellenc",
        "/live/news/18399-2021-presidents-awards-for-faculty-excellenc",
        "/live/news/18393-2021-faculty-excellence-awards-nominees",
        "/live/news/18393-2021-faculty-excellence-awards-nominees",
        "/live/news/18383-2021-facultystaff-service-awards",
        "/live/news/18383-2021-facultystaff-service-awards",
        "/live/news/18359-education-profs-win-grant-to-host-free-robot",
        "/live/news/18359-education-profs-win-grant-to-host-free-robot",
        "/live/news/18325-accounting-prof-appointed-to-state-board-of-",
        "/live/news/18325-accounting-prof-appointed-to-state-board-of-",
        "/live/news/18323-psychology-prof-to-lead-area-psychological",
        "/live/news/18323-psychology-prof-to-lead-area-psychological",
        "/live/news/18316-title-ix-coordinator-joins-governors-sexual",
        "/live/news/18316-title-ix-coordinator-joins-governors-sexual",
        "/live/news/18315-faculty-promotions-approved-by-board-of-rege",
        "/live/news/18315-faculty-promotions-approved-by-board-of-rege",
        "/live/news/18269-security-studies-prof-wins-national-research",
        "/live/news/18269-security-studies-prof-wins-national-research",
        "/live/news/18267-psychology-prof-appointed-to-state-regulator",
        "/live/news/18267-psychology-prof-appointed-to-state-regulator",
        "/live/news/18183-security-studies-prof-wins-multiple-national",
        "/live/news/18183-security-studies-prof-wins-multiple-national",
        "/live/news/18168-education-faculty-win-international-exemplar",
        "/live/news/18168-education-faculty-win-international-exemplar",
        "/live/news/18298-criminal-justice-prof-wins-national-research",
        "/live/news/18298-criminal-justice-prof-wins-national-research",
        "/live/news/18152-counseling-prof-masters-degree-win-national",
        "/live/news/18152-counseling-prof-masters-degree-win-national",
        "/live/news/18103-angelo-state-again-earns-national-great-coll",
        "/live/news/18103-angelo-state-again-earns-national-great-coll",
        "/live/news/18072-three-profs-contribute-to-first-open-source-",
        "/live/news/18072-three-profs-contribute-to-first-open-source-",
        "/live/news/18057-chemistry-prof-named-national-chief-reader-f",
        "/live/news/18057-chemistry-prof-named-national-chief-reader-f",
        "/live/news/18012-css-profs-book-is-required-reading-at-west-p",
        "/live/news/18012-css-profs-book-is-required-reading-at-west-p",
        "/live/news/17977-2019-20-rodgers-distinguished-faculty-staff-",
        "/live/news/17977-2019-20-rodgers-distinguished-faculty-staff-",
        "/live/news/17972-2019-20-faculty-and-staff-excellence-awards",
        "/live/news/17972-2019-20-faculty-and-staff-excellence-awards",
        "/live/news/17970-law-prof-publishes-research-on-bidens-vp-pic",
        "/live/news/17970-law-prof-publishes-research-on-bidens-vp-pic",
        "/live/news/17964-security-studies-prof-publishes-new-book-on-",
        "/live/news/17964-security-studies-prof-publishes-new-book-on-",
        "/live/news/17947-new-center-for-teaching-and-learning-excelle",
        "/live/news/17947-new-center-for-teaching-and-learning-excelle",
        "/live/news/17900-law-prof-publishes-research-on-covid-19-lega",
        "/live/news/17900-law-prof-publishes-research-on-covid-19-lega",
        "/live/news/17734-angelo-state-nursing-prof-named-in-dfw-great",
        "/live/news/17734-angelo-state-nursing-prof-named-in-dfw-great",
        "/live/news/17715-angelo-state-rewards-faculty-staff-for-years",
        "/live/news/17715-angelo-state-rewards-faculty-staff-for-years",
        "/live/news/17537-angelo-state-education-prof-named-distinguis",
        "/live/news/17537-angelo-state-education-prof-named-distinguis",
        "/live/news/17448-angelo-state-business-prof-wins-national-ser",
        "/live/news/17448-angelo-state-business-prof-wins-national-ser",
        "/live/news/17435-angelo-state-psych-prof-receives-meritorious",
        "/live/news/17435-angelo-state-psych-prof-receives-meritorious",
        "/live/news/17421-angelo-state-prof-wins-state-education-award",
        "/live/news/17421-angelo-state-prof-wins-state-education-award",
        "/live/news/17410-angelo-state-animal-science-prof-earns-prest",
        "/live/news/17410-angelo-state-animal-science-prof-earns-prest",
        "/live/news/17398-angelo-state-biology-profs-bat-research-publ",
        "/live/news/17398-angelo-state-biology-profs-bat-research-publ",
        "/live/news/17392-angelo-state-faculty-awarded-endowed",
        "/live/news/17392-angelo-state-faculty-awarded-endowed",
        "/live/news/17378-angelo-state-communication-prof-named-texas",
        "/live/news/17378-angelo-state-communication-prof-named-texas",
        "/live/news/17373-angelo-state-school-counseling-masters-progr",
        "/live/news/17373-angelo-state-school-counseling-masters-progr",
        "/live/news/17339-angelo-state-earns-national-great-college-to",
        "/live/news/17339-angelo-state-earns-national-great-college-to",
        "/live/news/17306-multiple-angelo-state-faculty-win-research-g",
        "/live/news/17306-multiple-angelo-state-faculty-win-research-g",
        "/live/news/17276-angelo-states-2018-19-rodgers-distinguished-",
        "/live/news/17276-angelo-states-2018-19-rodgers-distinguished-",
        "/live/news/17266-weise-named-angelo-states-first-davidson-cha",
        "/live/news/17266-weise-named-angelo-states-first-davidson-cha",
        "/live/news/17236-asu-wins-international-catalyst-award-for",
        "/live/news/17236-asu-wins-international-catalyst-award-for",
        "/live/news/17219-education-prof-awarded-phi-kappa-phi-literac",
        "/live/news/17219-education-prof-awarded-phi-kappa-phi-literac",
        "/live/news/17128-new-dean-appointed-for-asu-college-of-arts-a",
        "/live/news/17128-new-dean-appointed-for-asu-college-of-arts-a",
        "/live/news/17111-2019-faculty-excellence-awards-winners",
        "/live/news/17111-2019-faculty-excellence-awards-winners",
        "/live/news/17071-2019-faculty-excellence-awards-nominees",
        "/live/news/17071-2019-faculty-excellence-awards-nominees",
        "/live/news/17035-asu-staff-excellence-awards-winners",
        "/live/news/17035-asu-staff-excellence-awards-winners",
        "/live/news/17019-annual-staff-awards-nominees",
        "/live/news/17019-annual-staff-awards-nominees",
        "/live/news/17005-education-profs-win-grant-for-girls-robotics",
        "/live/news/17005-education-profs-win-grant-for-girls-robotics",
        "/live/news/17001-asu-alum-appointed-new-college-of-graduate-s",
        "/live/news/17001-asu-alum-appointed-new-college-of-graduate-s",
        "/live/news/16959-freshman-college-dean-earns-national-recogni",
        "/live/news/16959-freshman-college-dean-earns-national-recogni",
        "/live/news/16953-psych-prof-elected-president-of-regional",
        "/live/news/16953-psych-prof-elected-president-of-regional",
        "/live/news/16859-psychology-prof-receives-regional-counseling",
        "/live/news/16859-psychology-prof-receives-regional-counseling",
        "/live/news/16825-faculty-staff-receive-awards-for-years-of",
        "/live/news/16825-faculty-staff-receive-awards-for-years-of",
        "/live/news/16804-ttus-chancellors-council-2019-distinguished",
        "/live/news/16804-ttus-chancellors-council-2019-distinguished",
        "/live/news/16797-biology-prof-alums-publish-first-guide-to-ba",
        "/live/news/16797-biology-prof-alums-publish-first-guide-to-ba",
        "/live/news/16776-angelo-state-natural-history-collections-fea",
        "/live/news/16776-angelo-state-natural-history-collections-fea",
        "/live/news/16766-political-science-prof-publishes-new-book-on",
        "/live/news/16766-political-science-prof-publishes-new-book-on",
        "/live/news/16738-security-studies-prof-publishes-new-book-on",
        "/live/news/16738-security-studies-prof-publishes-new-book-on",
        "/live/news/16683-english-prof-publishes-new-poetry-collection",
        "/live/news/16683-english-prof-publishes-new-poetry-collection",
        "/live/news/16655-security-studies-prof-named-editor-of-new-bo",
        "/live/news/16655-security-studies-prof-named-editor-of-new-bo",
        "/live/news/16579-biology-prof-awarded-contract-for-spotted-sk",
        "/live/news/16579-biology-prof-awarded-contract-for-spotted-sk",
        "/live/news/16455-security-studies-prof-publishes-new-book-on-",
        "/live/news/16455-security-studies-prof-publishes-new-book-on-",
        "/live/news/16374-security-studies-prof-publishes-new-book-on-",
        "/live/news/16374-security-studies-prof-publishes-new-book-on-",
        "/live/news/16354-2018-asu-rodgers-distinguished-awards-winner",
        "/live/news/16354-2018-asu-rodgers-distinguished-awards-winner",
        "/live/news/16341-new-director-for-asu-porter-henderson-librar",
        "/live/news/16341-new-director-for-asu-porter-henderson-librar",
        "/live/news/16257-asu-earns-national-great-college-to-work-for",
        "/live/news/16257-asu-earns-national-great-college-to-work-for",
        "/live/news/16180-biology-prof-wins-national-parks-research-gr",
        "/live/news/16180-biology-prof-wins-national-parks-research-gr",
        "/live/news/16103-global-security-exchange",
        "/live/news/16103-global-security-exchange",
        "/live/news/16037-history-instructor-wins-research-fellowship",
        "/live/news/16037-history-instructor-wins-research-fellowship",
        "/live/news/16017-2018-faculty-excellence-awards-winners",
        "/live/news/16017-2018-faculty-excellence-awards-winners",
        "/live/news/15992-2017-18-faculty-excellence-awards-nominees",
        "/live/news/15992-2017-18-faculty-excellence-awards-nominees",
        "/live/news/15945-psychology-prof-publishes-new-book",
        "/live/news/15945-psychology-prof-publishes-new-book",
        "/live/news/15872-annual-asu-staff-excellence-awards-winners",
        "/live/news/15872-annual-asu-staff-excellence-awards-winners",
        "/live/news/15792-2017-facultystaff-service-awards-recipients",
        "/live/news/15792-2017-facultystaff-service-awards-recipients",
        "/live/news/15782-ttus-chancellors-council-distinguished-facul",
        "/live/news/15782-ttus-chancellors-council-distinguished-facul",
        "/live/news/15749-robledo-takes-on-new-role-to-support-asus-hi",
        "/live/news/15749-robledo-takes-on-new-role-to-support-asus-hi",
        "/live/news/15726-engineering-chair-heading-nsf-grant-project",
        "/live/news/15726-engineering-chair-heading-nsf-grant-project",
        "/live/news/15674-national-award-for-student-refunds-disbursem",
        "/live/news/15674-national-award-for-student-refunds-disbursem",
        "/live/news/15647-security-studies-prof-wins-multiple-research",
        "/live/news/15647-security-studies-prof-wins-multiple-research",
        "/live/news/15625-political-science-prof-publishes-new-book",
        "/live/news/15625-political-science-prof-publishes-new-book",
        "/live/news/15571-all-the-tesol-in-china",
        "/live/news/15571-all-the-tesol-in-china",
        "/live/news/15587-vp-named-to-state-education-organization-boa",
        "/live/news/15587-vp-named-to-state-education-organization-boa",
        "/live/news/15521-range-reclamation-project-wins-environmental",
        "/live/news/15521-range-reclamation-project-wins-environmental",
        "/live/news/15393-chilling-in-chile",
        "/live/news/15393-chilling-in-chile",
        "/live/news/15039-resident-expert-media-magnet",
        "/live/news/15039-resident-expert-media-magnet",
        "/live/news/14867-a-philosophy-of-excellence",
        "/live/news/14867-a-philosophy-of-excellence",
        "/live/news/14715-national-science-foundation-grant-for-engine",
        "/live/news/14672-2016-17-rodgers-distinguished-awards-winners",
        "/live/news/14672-2016-17-rodgers-distinguished-awards-winners",
        "/live/news/14523-living-to-serve",
        "/live/news/14523-living-to-serve",
        "/live/news/14408-vetsmilitary-services-director-named-to-stat",
        "/live/news/14408-vetsmilitary-services-director-named-to-stat",
        "/live/news/14235-breathing-life-into-history",
        "/live/news/14235-breathing-life-into-history",
        "/live/news/14102-2017-faculty-excellence-awards-winners",
        "/live/news/14012-biology-prof-awarded-federal-grant-for-bat",
        "/live/news/14012-biology-prof-awarded-federal-grant-for-bat",
        "/live/news/13897-biology-students-prof-honored-at-regional",
        "/live/news/13897-biology-students-prof-honored-at-regional",
        "/live/news/13880-arts-humanities-dean-edits-new-reference-boo",
        "/live/news/13880-arts-humanities-dean-edits-new-reference-boo",
        "/live/news/13737-leader-of-the-pack",
        "/live/news/13737-leader-of-the-pack",
        "/live/news/13705-psych-prof-elected-to-regional-executive-cou",
        "/live/news/13705-psych-prof-elected-to-regional-executive-cou",
        "/live/news/13655-engineering-prof-wins-research-publication-a",
        "/live/news/13655-engineering-prof-wins-research-publication-a",
        "/live/news/13647-annual-staff-excellence-awards-winners",
        "/live/news/13534-achieving-excellence",
        "/live/news/13534-achieving-excellence",
        "/live/news/13572-geology-prof-named-alma-maters-distinguished",
        "/live/news/13572-geology-prof-named-alma-maters-distinguished",
        "/live/news/13532-teacher-ed-prof-wins-dept-of-education-grant",
        "/live/news/13532-teacher-ed-prof-wins-dept-of-education-grant",
        "/live/news/13451-connecting-cultures",
        "/live/news/13451-connecting-cultures",
        "/live/news/13381-2016-facultystaff-service-awards-recipients",
        "/live/news/13381-2016-facultystaff-service-awards-recipients",
        "/live/news/13375-engineering-prof-wins-nsf-grant",
        "/live/news/13375-engineering-prof-wins-nsf-grant",
        "/live/news/13094-a-year-to-remember",
        "/live/news/13094-a-year-to-remember",
        "/live/news/12868-akin-promoted-to-vice-president",
        "/live/news/12868-akin-promoted-to-vice-president",
        "/live/news/12692-communication-prof-named-editor-of-industry",
        "/live/news/12598-economics-prof-named-new-norris-family-chair",
        "/live/news/12598-economics-prof-named-new-norris-family-chair",
        "/live/news/12592-history-prof-elected-to-historical-associati",
        "/live/news/12489-arts-and-humanities-dean-published-in",
        "/live/news/12360-administrator-honored-for-extracurricular-wo",
        "/live/news/12360-administrator-honored-for-extracurricular-wo",
        "/live/news/12277-english-prof-publishes-poetry-collection",
        "/live/news/12277-english-prof-publishes-poetry-collection",
        "/live/news/12181-history-profs-win-grant-for-world-war-i-prog",
        "/live/news/12157-psychology-prof-publishes-new-textbook",
        "/live/news/11262-2016-faculty-and-staff-service-awards",
        "/live/news/11262-2016-faculty-and-staff-service-awards",
        "/live/news/8992-faculty-and-staff-service-awards",
        "/live/news/8992-faculty-and-staff-service-awards",
        "/live/news/6171-asu-facultystaff-service-awards",
        "/live/news/6171-asu-facultystaff-service-awards",
        "/live/news/3338-asu-faculty-staff-service-awards",
        "/live/news/3338-asu-faculty-staff-service-awards",
        "/live/news/1484-asu-faculty-staff-earn-service-awards",
        "/live/news/1484-asu-faculty-staff-earn-service-awards",
        "/live/news/183-asu-faculty-staff-earn-awards-for-decades-of",
        "/live/news/748-asu-faculty-staff-earn-awards-for-decades-of",
        "/live/news/748-asu-faculty-staff-earn-awards-for-decades-of"
    ],
    "tables": []
}