{
    "file_name": "sites-service-animals.html",
    "title": "Animals for Students with Disabilities  · Angelo State University",
    "description": "Read this information to learn more about how service animals can be used at Angelo State University.",
    "meta_tags": {
        "viewport": "width=device-width, initial-scale=1",
        "generator": "LiveWhale",
        "og:title": "Animals for Students with Disabilities",
        "og:type": "website",
        "og:url": "https://www.angelo.edu/current-students/disability-services/service-animals/",
        "pagename": "Animals for Students with Disabilities",
        "og:description": "Read this information to learn more about how service animals can be used at Angelo State University.",
        "description": "Read this information to learn more about how service animals can be used at Angelo State University.",
        "og:image": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "og:image:secure_url": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "og:image:width": "1260",
        "og:image:height": "630",
        "twitter:card": "summary_large_image",
        "twitter:title": "Animals for Students with Disabilities",
        "twitter:description": "Read this information to learn more about how service animals can be used at Angelo State University.",
        "twitter:image": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "lw-template-updated": "02/17/2022 03:22pm CST"
    },
    "headings": [
        "Quick Links",
        "Information For",
        "Animals for Students with Disabilities",
        "Emotional Support Animal Checklist",
        "Emotional Support Animal FAQs",
        "What is an Emotional Support Animal?",
        "What type of animal can be an ESA?",
        "How can a student request to have an ESA in on-campus housing?",
        "Responsibilities of Individuals with ESAs",
        "Is an ESA the same as a Service Animal?",
        "What is the difference between a Service Animal and an ESA?",
        "Can a student take their ESA to class?",
        "Can I bring my ESA to campus while waiting for approval from Student Disability Services?",
        "What type of documentation do I need?",
        "The ESA Approval Process",
        "Service Animals",
        "What is a Service Animal?",
        "Where are Service Animals Allowed to go?",
        "How Should Service Animals be Controlled?",
        "Other Provisions",
        "Questions About Service",
        "Pet Allergies and Fears",
        "Faculty/Staff Resources"
    ],
    "paragraphs": [
        "Please Note:ESAs are not permitted on campus until they are approved.",
        "Provide documentation verifying diagnosis AND the need for an Emotional Support Animal from an off-campus medical provider licensed in Texas. This documentation should come from a student’s primary mental health care provider.",
        "Student Disability Services discourages paying individuals found on websites for certificates or template letters. As per the guidance document by the U.S. Department of Housing and Urban Development (HUD):",
        "Some websites sell certificates, registrations, and licensing documents for assistance animals to anyone who answers certain questions or participates in a short interview and pays a fee.",
        "In HUD’s experience, such documentation from the internet is not, by itself, sufficient to reliably establish that an individual has a non-observable disability or disability-related need for an assistance animal.",
        "Contact usfor more information.",
        "An Emotional Support Animal (sometimes referred to as an assistance animal) is an animal needed for emotional support. Federal law allows individuals with disabilities the presence of a broader range of animals (“assistance animals”) in University housing as compared with the campus as a whole.",
        "“ESA types are typically animals commonly kept in households. Examples include but are not limited to a dog, cat, small bird, rabbit, hamster, gerbil, other rodent, fish, turtle, or other small, domesticated animal that is traditionally kept in the home”.(hud.gov)",
        "In general, reptiles, other than turtles, barnyard animals and exotic animals are not considered household pets. If the individual is requesting to keep a unique type of animal that is not commonly kept in households as described above, then the requester has the substantial burden of demonstrating a disability-related, therapeutic need for the specific type of animal. The individual is encouraged to submit documentation from a healthcare professional confirming the need for this unique type of animal.",
        "To request to have an ESA in on-campus housing, a student must complete the accommodation request process with Student Disability Services. The student must have a recognized disability as defined by the Americans with Disabilities Act (ADA) and show that the request for an ESA is a reasonable accommodation that is directly related to their disability needs.",
        "Documentation must indicate how the ESA alleviates one or more of the identified symptoms or effects of an existing disability.",
        "The University is not responsible for the care or supervision of an assistance animal.",
        "Individuals with disabilities are solely responsible for the care, supervision, and control of their assistance animal at all times, and for ensuring the immediate clean-up and proper disposal of all animal waste.",
        "Individuals must comply with all applicable laws and regulations, including vaccination, licensure, animal health and leash laws, as well as the University’s rules in lease provisions regarding vaccination, licensure, leash control, cleanup rules, animal health, and community relationships.",
        "Students with ESAs are responsible for the charges associated with cleaning the room, pest control, or damages necessary to return the room to the same condition as before the animal was brought to campus. The student will be required to sign a Rights and Responsibilities Acknowledgement before being approved to bring the animal to campus housing.",
        "No. While ESAs are often used as part of a medical treatment plan, they are not considered Service Animals under the ADA. However, they are viewed as a “reasonable accommodation” under the Fair Housing Act (FHA) in those housing communities that have a “no pets” rule.",
        "Service animals are defined as dogs (or miniature horses in limited situations) that are individually trained to do work or perform tasks for people with disabilities. The work or task a service animal does must be directly related to the person’s disability. Service animals may accompany persons with disabilities into places that the public normally goes.",
        "An ESA generally provides assistance and/or emotional support to persons with disabilities who have a disability-related need for such support. While dogs are the most common type of ESA, other animals can also be ESAs. The animal need not be specifically trained to perform tasks for a person who has a mental health or medical disability. Unlike a service animal, an ESA is not granted access to all places of public accommodation. As noted above, under the FHA, an ESA is viewed as a “reasonable accommodation” in a housing unit.",
        "ESAs are generally only allowed in the dwelling (housing environment) of students and places that any animal is allowed in public. ESAs are typically not allowed in other campus buildings, including academic buildings, the Library, the University Center, and The CAF. If you have specific questions about where an ESA is permitted in the housing environment, please consult with Student Disability Services.",
        "ESAs should not be brought into on-campus housing until approved by Student Disability Services.",
        "“Reasonably supporting information often consists of information from a licensed health care professional – e.g., physician, optometrist, psychiatrist, psychologist, physician’s assistant, nurse practitioner, or nurse – general to the condition but specific as to the individual with a disability and the assistance or therapeutic emotional support provided by the animal. A relationship or connection between the disability and the need for the assistance animal must be provided.” (hud.gov).",
        "Complete documentation will be reviewed in the order received and eligibility will be determined as quickly as possible. Placement timeframe is based on availability of housing space and roommate consent.",
        "The steps to follow before the ESA request process is complete:",
        "Please note that if an ESA request is not approved, Student Disability Services staff will contact the student to request additional documentation and/or provide rationale.",
        "Service animals are defined as dogs (or miniature horses in rare instances) that are individually trained to do work or perform tasks for people with disabilities.",
        "Service animals are working animals, not pets. The work or task a service animal has been trained to do must be directly related to the person’s disability.",
        "Animals whose sole function is to provide comfort or emotional support do not qualify as service animals under the ADA.",
        "Service animals are allowed to accompany people with disabilities in all areas of a facility where the public is normally allowed to go.",
        "Some restrictions may be appropriate, however, if the presence of the animal would compromise the integrity of the setting.",
        "Under the ADA, service animals must be harnessed, leashed or tethered, unless these devices interfere with the service animal’s work or the individual’s disability prevents using these devices. In these cases, the individual must maintain control of the animal through voice, signal or other effective controls at all times.",
        "When it is not obvious what service an animal provides, only limited inquiries are allowed. Staff may ask two questions:",
        "Staff cannot ask about the person’s disability, require medical documentation or training documentation for the animal, or ask for a demonstration of the ability to perform the work or task.",
        "Allergies and fear are not valid reasons for denying access or refusing service to people using service animals.",
        "When a person who is allergic to dander and a person who uses a service animal must spend time in the same room or facility, they both should be accommodated by assigning them, if possible, to different locations within the room or different rooms in the facility.",
        "A person with a disability cannot be asked to remove his or her animal from the premises unless one of these conditions exists:",
        "When there is a legitimate reason to ask that a service animal be removed, staff must offer the person with the disability the opportunity to obtain goods or services without the animal’s presence."
    ],
    "list_items": [
        "AcademicsAcademic ProgramsDepartmentsCollegesCoursesAcademic Calendar",
        "Academic Programs",
        "Departments",
        "Colleges",
        "Courses",
        "Academic Calendar",
        "About ASUHistoryCore ValuesNewsTraditionsAbout San AngeloWelcome from the PresidentMission Statement",
        "History",
        "Core Values",
        "News",
        "Traditions",
        "About San Angelo",
        "Welcome from the President",
        "Mission Statement",
        "Admissions & AidApply to ASUAdmitted StudentsRequest More InformationVisit Angelo State UniversityPaying for College",
        "Apply to ASU",
        "Admitted Students",
        "Request More Information",
        "Visit Angelo State University",
        "Paying for College",
        "Life on CampusLivePlayLeadWorkExplore",
        "Live",
        "Play",
        "Lead",
        "Work",
        "Explore",
        "CommunityASU Mayer MuseumAlumni AssociationSmall Business Development CenterWest Texas CollectionNatural History CollectionsKay Bailey Hutchison Center for Cyber Intelligence, Innovation, and Security StudiesLaura W. Bush Institute for Women’s HealthArts at ASUPlanetariumStephens ChapelRanch and Meat MarketASU Ticket OfficeSummer Camps and Conferences",
        "ASU Mayer Museum",
        "Alumni Association",
        "Small Business Development Center",
        "West Texas Collection",
        "Natural History Collections",
        "Kay Bailey Hutchison Center for Cyber Intelligence, Innovation, and Security Studies",
        "Laura W. Bush Institute for Women’s Health",
        "Arts at ASU",
        "Planetarium",
        "Stephens Chapel",
        "Ranch and Meat Market",
        "ASU Ticket Office",
        "Summer Camps and Conferences",
        "Give to ASUMake a GiftSignature EventsJoin",
        "Make a Gift",
        "Signature Events",
        "Join",
        "Athletics",
        "RamPort",
        "Library",
        "Bookstore",
        "Events",
        "Public Health Updates",
        "Administration",
        "Research",
        "Mental Health Services",
        "Title IX/Incident Report",
        "En Español",
        "Current Students",
        "Faculty & Staff",
        "Admitted Students",
        "Military",
        "Parents & Families",
        "Alumni",
        "Visitors",
        "School Counselors",
        "Online Students",
        "Documenting a Disability",
        "Test Accommodations",
        "High School vs. College",
        "Service and Emotional Support Animals",
        "Policy Statements",
        "Outside Agencies",
        "Training Resources",
        "Student Resources",
        "Faculty Resources",
        "Contact Us",
        "Apply for Disability Accommodations.",
        "Provide documentation verifying diagnosis AND the need for an Emotional Support Animal from an off-campus medical provider licensed in Texas. This documentation should come from a student’s primary mental health care provider.Student Disability Services discourages paying individuals found on websites for certificates or template letters. As per the guidance document by the U.S. Department of Housing and Urban Development (HUD):Some websites sell certificates, registrations, and licensing documents for assistance animals to anyone who answers certain questions or participates in a short interview and pays a fee.In HUD’s experience, such documentation from the internet is not, by itself, sufficient to reliably establish that an individual has a non-observable disability or disability-related need for an assistance animal.",
        "Meet with Student Disability Services staff.",
        "Provide required documentation about your Emotional Support Animal if applicable.",
        "Wait for Notification from Student Disability Services of Emotional Support Animal approval!",
        "Documentation from a qualified evaluator to whom a student has an established relationship. (An evaluator that the student has only met with once or twice should not complete forms).",
        "Documentation should articulate the need for the ESA based upon the student’s medical and/or mental health condition.",
        "Complete an application for disability accommodations.",
        "Meet with Student Disability Services staff to complete additional documentation (ESA Rights and Responsibilities, and documentation specific to the ESA).",
        "Student Disability Services will work with Housing to continue processing the request.",
        "Student Disability Services will notify the student via email as soon as the request has been approved.",
        "Is the service animal required because of a disability?",
        "What work or task has the animal been trained to perform?",
        "The animal is out of control and the handler does not take effective action to control it.",
        "The animal is not housebroken.",
        "2601 W. Avenue NSan Angelo, TX 76909",
        "1-800-946-8627",
        "Campus Map",
        "Contact ASU",
        "University Directory",
        "RamPort",
        "Jobs at ASU",
        "Facebook",
        "X",
        "Instagram",
        "YouTube",
        "©2024 Angelo State University",
        "All Rights Reserved",
        "Editor Login",
        "TTU System",
        "Texas Tech University",
        "TTU Health Sciences Center",
        "TTUHSC El Paso",
        "Midwestern State University",
        "ASU Privacy Policy",
        "Weather and Emergency Notifications",
        "Mental Health Services",
        "Title IX/Incident Report",
        "State of Texas",
        "Statewide Search",
        "Texas Homeland Security",
        "Texas Veterans Portal",
        "State Auditor’s Office",
        "Fraud Prevention",
        "Site Policies"
    ],
    "table_headers": [],
    "table_data": [],
    "captions": [],
    "links": [
        "#main-content",
        "/",
        "/academics/",
        "/academics/programs/",
        "/departments/",
        "/colleges/",
        "/courses/",
        "/current-students/registrar/academic_calendar.php",
        "/about-asu/",
        "/about-asu/history.php",
        "/about-asu/core-values/",
        "/about-asu/news/",
        "/about-asu/traditions/",
        "/about-asu/san-angelo.php",
        "/about-asu/president/",
        "/about-asu/mission-statement.php",
        "/admissions-and-aid/",
        "/admissions-and-aid/apply/",
        "/admissions-and-aid/admitted/",
        "/admissions-and-aid/info/",
        "/admissions-and-aid/visit/",
        "/admissions-and-aid/paying-for-college/",
        "/life-on-campus/",
        "/life-on-campus/live/",
        "/life-on-campus/play/",
        "/life-on-campus/lead/",
        "/life-on-campus/work/",
        "/life-on-campus/explore/",
        "/community/",
        "/community/mayer-museum/",
        "/alumni/",
        "/community/small-business-development-center/",
        "/community/west-texas-collection/",
        "/departments/biology/angelo-state-natural-history-collection/",
        "/community/kay-bailey-hutchison-center/",
        "/colleges/archer-college-of-health-and-human-services/laura-w-bush-institute-for-womens-health/",
        "/departments/visual-performing-arts/theatre/subscriptions.php",
        "/departments/physics-geosciences/planetarium/",
        "/community/stephens-chapel.php",
        "/community/asu-ranch/",
        "/community/ticket-office/",
        "/community/summer-camps-and-conferences/",
        "/give/",
        "/give/make_gift/",
        "/give/signature-events/",
        "/give/join/",
        "https://www.angelosports.com/",
        "https://ramport.angelo.edu/",
        "/library/",
        "http://bookstore.angelo.edu/",
        "/events/",
        "/public-health/",
        "/administrative-support/",
        "/research/",
        "/current-students/counseling-services/",
        "/current-students/title-ix/",
        "/en-espanol/",
        "/current-students/",
        "/faculty-and-staff/",
        "/admissions-and-aid/admitted/",
        "/active-duty-veterans/",
        "/parents-and-families/",
        "/alumni/",
        "/visitors/",
        "/school-counselors/",
        "/online/",
        "/current-students/disability-services/",
        "/current-students/disability-services/documenting-a-disability.php",
        "/current-students/disability-services/test-accomodations-for-students.php",
        "/current-students/disability-services/how-disability-services-differ-between-high-school-and-college.php",
        "/current-students/disability-services/service-animals/",
        "/current-students/disability-services/disability-services-policy-statement.php",
        "/current-students/disability-services/outside-agencies-for-disability-services.php",
        "/current-students/disability-services/training-resources/",
        "/current-students/disability-services/learning-devices-and-textbooks.php",
        "/current-students/disability-services/faculty-resources.php",
        "/current-students/disability-services/contact.php",
        "/",
        "/current-students/",
        "/current-students/disability-services/",
        "/current-students/disability-services/",
        "/current-students/disability-services/contact.php",
        "https://www.hud.gov/",
        "tel:18009468627",
        "/map/",
        "/contact/",
        "/directory/",
        "https://ramport.angelo.edu/",
        "/work-at-asu/",
        "https://www.facebook.com/angelostateuniversity",
        "https://twitter.com/AngeloState",
        "https://www.instagram.com/angelostate/",
        "https://www.youtube.com/user/AngeloStateU",
        "/livewhale/?login&referer=1",
        "http://www.texastech.edu/",
        "https://www.ttu.edu/",
        "https://www.ttuhsc.edu/",
        "https://elpaso.ttuhsc.edu/",
        "https://msutexas.edu/",
        "https://apps.highered.texas.gov/resumes/",
        "/privacy_policy.php",
        "/emergency-notifications/",
        "/current-students/counseling-services/",
        "/current-students/title-ix/",
        "https://www.texas.gov/",
        "https://www.tsl.texas.gov/trail/index.html",
        "https://gov.texas.gov/organization/hsgd",
        "https://veterans.portal.texas.gov/",
        "https://sao.fraud.texas.gov/",
        "/administrative-support/audit-services/fraud_prevention.php",
        "/site-policies/"
    ],
    "tables": []
}