{
    "file_name": "sites-history.html",
    "title": "No Title",
    "description": "No Description",
    "meta_tags": {},
    "headings": [
        "History Professor Selected for Prestigious Overseas Seminar",
        "Library of Congress Grant for West Texas History Project",
        "History Lecture Series: Fort Hays State Professor visits Angelo State",
        "Recent Graduate Chosen for Fulbright Program to Bulgaria",
        "History Professor Earns Prestigious Fellowship",
        "New Article Explores Regional Park System",
        "Geography Professor Reflects on Reading",
        "Fort Concho Elementary Students Texas History Course",
        "Prof. Dickmeyer Named NEH Summer Scholar",
        "Prof. Lynch Publishes a New Book",
        "Welcome Back Picnic",
        "Prof. Ostrofsky Publishes on CNN",
        "Angelo State History Department In the Top 10 of National Universities With Increasing Majors",
        "Prof. Ostrofsky Publishes an Annotated Bibliography",
        "Department Faculty Present at the Annual Western History Association Meeting",
        "Humanities Month 2018 Ends with a Discussion of Wartime Culture, Memory, and Remembrance",
        "Great War Series: TCU Professor Discusses Women’s Experiences in the War",
        "War Stories Project Featured in Magazine for the American Historical Association",
        "Angelo State University Faculty and Students Participate in First Humanities Month Event",
        "Great War Lecture Series/First Humanities Month Event Featuring Prof. David Krugler",
        "Prof. Klingemann Participates in Hispanic Heritage Month Event",
        "Welcome Back Picnic",
        "Prof. Lynch Publishes New Book",
        "Wongsrichanalai Publishes New Essay",
        "Prof. Archer Wins Portal to Texas History Research Fellowship",
        "Archer Wins Research Fellowship from UNT",
        "Great War Series: Fulbright Scholar Discusses the Armenian Genocide",
        "Great War Series: Prof. John Irish Discusses the Musical Culture of the Great War Era",
        "Great War Series: Prof. Allison Robbins on Female Impersonation in Great War Service Shows",
        "Great War Series: Preston Lewis Introduces Audience to Great War Hero Daniel R. Edwards",
        "TTUS Chancellor’s Council Distinguished Teaching and Research Features Two Angelo State Faculty Members",
        "Prof. Ostrofsky Publishes Article About Sesame Street",
        "Great War Series: Veterans Roundtable Brings Together Students and Community Members",
        "Prof. Ostrofsky Shares Her Work at the Library of Congress",
        "Great War Series: MIT Prof. Christopher Capozzola Lectures on the Great War Experience in the United States",
        "Prof. Wongsrichanalai Interviewed Holland Symposium Speaker, Prof. Zeynep Tufekci",
        "Prof. Heineman Interviewed on Civil War Talk Radio",
        "Prof. Heineman Quoted in Story About the Vietnam Era",
        "Great War Series: Charles Endress Discusses the War in the Air",
        "History Through Photos",
        "History Department Hosts Its Annual Welcome Back Barbecue for Majors",
        "Klingemann Participates in Hispanic Heritage Month Event",
        "Breathing Life into History",
        "Prof. Lynch Named to Medieval Academy of America Committee",
        "Great War Series: Profs. Grear & Mendoza Discuss Challenges for Minorities in Texas During the Great War",
        "S. C. Gwynne Visits Campus",
        "World War I Exhibit On Display at Fort Concho",
        "Prof. Ostrofsky Publises Essay",
        "Prof. Lynch Presents at Annual Meeting of the Renaissance Society of America",
        "Great War Series: Voices of WWI & Veterans Roundtable",
        "Prof. Ostrofsky Presents at SCMS",
        "Prof. Wongsrichanalai at the Virginia Festival of the Book",
        "Great War Series: Antle Discusses Wartime Propaganda",
        "Prof. Heineman’s Latest Publications",
        "Great War Series: Professors Discuss Photography and Physical Therapy",
        "Great War Series: Renowned Scholar Explains the Great War’s Lasting Effects on America",
        "Archer Accepts the Guittard Book Award for Historical Scholarship",
        "Great War Series: Prof. Hama Explains Changes to British Poetry",
        "Heineman Elected to Council of the Pennsylvania Historical Association",
        "Prof. Pumphrey Among Those Honored with NCSS Grant",
        "Great War Series: Prof. Charles Endress Lectures on the Experience of Battle on the Western Front",
        "Prof. Ostrofsky’s Work Featured on OAH Blog",
        "Prof. Heineman Publishes New Encyclopedia Entry",
        "Texas A&M Professor Discusses the Lessons of History For Final Event in 2015-2016 Great War Series",
        "Latino American History Series: The Sleepy Lagoon Trial",
        "Latino American History Series: Renowned Scholar Visits Campus",
        "Latino American History Series: Latino Americans on Sesame Street Event Draws Adults and Children",
        "War Stories Project Featured on Front Page of Angelo State Site",
        "Great War Lecture Series: Chemical Warfare in the Great War",
        "Latino-American Veterans Roundtable",
        "History Professor Publishes New Essay on the Election of 1880",
        "Great War Lecture Series: Cornell History Professor Discusses How Culture Influenced Soldiers’ Experiences in War",
        "Latino American History Series: Leading Scholars and Friends Honor the Scholarship of Arnoldo De León",
        "War Stories Project Featured on Local Television Station on Veterans Day 2015",
        "Retired Professor Honored for Latino-American History Work",
        "Bridging the Academic and Public Divide",
        "Great War Lecture Series: Former Angelo State President Hindman Discusses Diplomacy and U-Boats",
        "Archer Promotes Her Book",
        "Latino American History Series Features Documentary Filmmaker",
        "Latino American History Series Holds Second Event",
        "Latino American History Series Commences",
        "Great War Lecture Series Commences",
        "2015 History Department Barbecue",
        "History Department Adjunct Promoted at Fort Concho",
        "Wongsrichanalai Publishes Essay on Reconciliation",
        "“War Stories” Project Featured on Marfa Public Radio",
        "Archer Speaks at the San Antonio Book Festival",
        "Civil War Lecture Series Wraps Up",
        "Wongsrichanalai’s Co-Edited Volume Published By Fordham University Press",
        "Recording the War",
        "Scholars Discuss Antebellum and Wartime Musical Traditions",
        "Legal Scholar Discusses Three Cases from the Civil War",
        "Kenna Archer’s Book to be Released on May 1",
        "University of Mississippi Professor Discusses Religion and the Civil War",
        "History Professors Receive NEH Grant",
        "Hindman Highlights Football’s Civil War Connections",
        "Duncan Knox: ASU Envoy",
        "Emmett Essin Discusses Cavalry Horses",
        "Clifton Truman Daniel Speaks to History Students",
        "Dirck Inaugurates the Final Year of the Civil War Lecture Series",
        "History Department Welcomes Students Back",
        "Pierce Publishes Article about Mesquite Trees",
        "Hicks Lectures on Civil War Medicine",
        "De León Honored For 40 Years of Service",
        "Civil Rights Stories",
        "Lamberson Presents Her Work at the OAH",
        "Heineman Talks to the D.C. Civil War Roundtable",
        "Archer Speaks to the Texas Map Society",
        "Dewar Discusses Baseball and the Civil War",
        "What Has the THC Been Up To?",
        "Busby Discusses Civil War Monuments",
        "Pierce and Archer Discuss the West and the Environment",
        "ASU History Department Well Represented at Christmas at Old Fort Concho, Volunteers’ Thank You Dinner, December 12, 2013",
        "Texas A&M Professor Comes to ASU for Civil War Lecture Series",
        "DeLeón Celebrates Milestone with Book",
        "Heineman’s Book Gets New Review",
        "Civil War Lecture Series: Republican Party Discussion",
        "DeLeón Discusses Book at South Texas College",
        "Civil War Lecture Series: Trans-Atlantic Slave Trade",
        "Heineman’s Book Quoted in New York Times Blog",
        "De León Leads Fall Convocation Procession",
        "Pumphrey Featured in ASU Magazine",
        "Letters Take to the Stage as Part of the Civil War Lecture Series",
        "Wongsrichanalai Honored as supporter of Early Alert Program."
    ],
    "paragraphs": [
        "November 19, 2024",
        "Dr. Rebekah McMillan of the Angelo State University history faculty has been selected for a 2025 Overseas Faculty Development Seminar by the Council for American Overseas Research Center (CAORC) and will spend about three weeks in India in January.",
        "November 21, 2023",
        "Angelo State University has been awarded a $69,999 grant from the Library of Congress (LOC) in Washington, D.C., to fund a new project to create historical information resources for local and regional K-12 schools and ASU academic programs.",
        "September 29, 2023",
        "The History Lecture Series recently welcomed Dr. Marco Macias out of Fort Hays State University for a guest lecture on the cultural impact of Francisco “Pancho” Villa. This lecture was made possible by the Dorsey B. Hardeman Endowed Chair in History and the generosity of the Hardeman family.",
        "June 20, 2023",
        "Price Tarbet of Big Spring, a May 2022 graduate of Angelo State University, has been awarded a prestigious Fulbright U.S. Student English Teaching Assistantship to teach English in Bulgaria for the 2023-24 academic year.",
        "March 28, 2023",
        "Dr. Laura Hooton of the Angelo State University history faculty has been named one of only four 2023-24 Research Fellows for the Clements Center for Southwest Studies in the Dedman College of Humanities and Sciences at Southern Methodist University.",
        "February 26, 2021",
        "Geographer Rob Briwa shines some light on state parks, which are often an understudied feature of United States cultural landscapes, but a treasure trove cultural and heritage.",
        "February 26, 2021",
        "Geographer Rob Briwa hasn’t let the trials of the last year impede on his research, recently publishing the article, “Bird Watching with The Peregrine: Towards Literary Geographies of Comfort Reading.”",
        "November 20, 2019",
        "On Nov. 20, 2019, 85 Concho Elementary 5th graders’ visited Dr. Powers’ History of Texas class. The Education Majors in History of Texas led a mini-Texas history lesson plan with groups of eight 5th graders. It was a great learning moment for both the college students as well as the Concho students!",
        "October 1, 2019",
        "Prof. Dickmeyer won a competitive fellowship from the National Endowment for the Humanities (NEH) to attend the 4-week 2019 summer institute “Colonial Experiences and Their Legacies in Southeast Asia.” She is incorporating this material into several Asian history courses at ASU.",
        "October 1, 2019",
        "Prof. Sarah Lynch published a new book, Medieval Pedagogical Writings: An Epitome, Fall 2018, which is out now in paperback and downloadable e-book. Check it out here.",
        "October 1, 2019",
        "Students and faculty from the Department of History gathered at the Angelo State University Lake House on Tuesday, September 19, 2019 for the annual welcome back picnic.",
        "December 17, 2018",
        "Prof. Kathryn Ostrofsky has just published an opinion piece for CNN about Sesame Street’s latest storyline tackling homelessness. Her expertise is based on her research on “Sesame Street.” Read the article here.",
        "December 3, 2018",
        "In recent years, the numbers of history majors has been on the decline nationwide.",
        "November 29, 2018",
        "Prof. Kathryn Ostrofsky has just published an annotated bibliography for interdisciplinary research on “Sesame Street” as part of Oxford University Press’s online collection of Bibliographies in Cinema and Media Studies. She will continue to update it on www.oxfordbibliographies.com as new works on the subject are published.",
        "November 17, 2018",
        "On October 19 – 20, Profs. Jason Pierce and Kenna Lang Archer traveled to San Antonio to participate in the annual meeting of the Western History Association. Prof. Pierce talked about the disparate views of Texas created by different groups that settled the state while Prof. Archer talked about the politics of river improvement and the ways in which the state’s highly varied ecology complicated policy-making.",
        "October 30, 2018",
        "Faculty members from three departments in the College of Arts & Humanities participated in the final Humanities Month event for the fall 2018 semester. All of these faculty members used material collected by History Department faculty and students for the NEH-funding War Stories Project. Prof. Timothy Bonenfant (Dept. of Visual & Performing Arts) discussed the musical culture of the Vietnam War Era. Prof. ?JongHwa Lee? (Dept. of Communications & Mass Media) talked about the importance of war memorials and focused on the Vietnam War Memorial in Washington, D.C. Prof. ?Laurence Musgrove? (Dept. of English & Modern Languages) analyzed the poems of local veteran Glenn Allison.",
        "October 27, 2018",
        "Prof. Kara Vuic, a professor of history at Texas Christian University, spoke with a packed audience in the C. J. Davidson Conference Center on Tuesday, October 23. This was the final event in the fall 2018 Great War Series and the third event in the Humanities Month series. Prof. Vuic talked about the experiences of women who wished to contribute to the Great War effort and answered multiple questions from the engaged audience.",
        "October 18, 2018",
        "The National Endowment for the Humanities-funded War Stories Project, co-directed by Profs. ?Christine Lamberson? and ?Kanisorn Wongsrichanalai?, was featured in ?Perspectives?, the magazine of the American Historical Association. Interested parties can read the article by clicking this link.",
        "October 16, 2018",
        "The College of Arts & Humanities began its first Humanities Month in October 2018. The events feature lectures by both Angelo State faculty and outside guests. The first event with Angelo State faculty took place on October 16 in the Eldon Black Recital Hall and featured lectures by Prof. William A. Taylor (Dept. of Security Studies & Criminal Justice) and Prof. Matthew Gritter (Dept. of Political Science & Philosophy). Both professors used material collected by the History Department’s War Stories team over the course of four years. In addition, Profs. Ashley Meyer and Daniel Anderson from the Theatre Program (Dept. of Visual & Performing Arts), used select stories from the collection to put together a dramatic presentation that featured some first-year students. Around 200 attendees came out for this event.",
        "October 11, 2018",
        "In the first Great War Centennial Commemoration Lecture Series event of the 2018-19 Academic Year, Prof. David Krugler (University of Wisconsin–Platteville) spoke to over 200 attendees about the challenges that African Americans faced during the Great War Era. He talked about their fight for equality in a deeply racist American society, in the press, and in the criminal justice system.",
        "September 13, 2018",
        "Prof. ?John E. Klingemann?, department chair, spoke at this year’s Hispanic Heritage Month event on September 13, 2018 in the C. J. Davidson Conference Center.",
        "September 11, 2018",
        "Students and faculty from the Department of History gathered at the Angelo State University Lake House on Tuesday, September 11, 2018 for the annual welcome back picnic.",
        "July 11, 2018",
        "Medieval Pedagogical Writings: An Epitome? has been published by Kismet Press.",
        "May 9, 2018",
        "Prof. Wongsrichanalai’s essay “Loyal to the Union: College-Educated Soldiers, Military Leadership, Politics, and the Question of Loyalty” has been published in a new work edited by Robert Sandow. Fordham University Press released the volume, Contested Loyalty: Debates Over Patriotism in the Civil War North, in its spring catalog.",
        "April 23, 2018",
        "Prof. Kenna Archer has won a Portal to Texas History Research Fellowship to facilitate use of the Portal to Texas History, a digital repository of primary sources. She is currently working on her third book manuscript, which is a social, cultural, and environmental history of air conditioning in Texas.",
        "April 13, 2018",
        "Dr. Kenna Archer recently won a Special Collections Fellowship from the University of North Texas. She is currently working on a history of riparian development in Texas (tentatively titled Mucking it Up:  A History of Rivers, Politics, and Improvements in Texas) and will visit the Special Collections at UNT this summer.",
        "April 5, 2018",
        "Prof. Julien Zarifian, a Fulbright scholar from the University of Cergy-Pontoise (France), who is spending the year at the Shoah Foundation Center for Advanced Genocide Research at the University of Southern California, visited Angelo State University for the Great War Series. He spoke on the Armenian Genocide and America’s response to the event. He also visited several classes while on campus and also spoke to students in the Honors Program. His visit was made possible by the Outreach Lecture Fund as well as the National Endowment for the Humanities.",
        "March 26, 2018",
        "Prof. ?John Irish?, Dept. of Visual & Performing Arts, spoke to a crowd of over 150 at the C. J. Davidson Center about the musical traditions of the Great War Era. Going through some of the popular musical trends of the period, Prof. Irish also noted the contributions of African-American musicians and the emergence of jazz.",
        "March 22, 2018",
        "Prof. ?Allison Robbins?, Dept. of Music, University of Central Missouri, shared her research on female impersonation in Great War Era U.S. armed forces camps with an audience of over 150 in Cavness 100. Prof. ?Robbins? showed clips and also provided some background on the culture of the period.",
        "February 15, 2018",
        "In the first event in the Great War Centennial Commemoration Lecture Series of the spring 2018 semester, ?Preston Lewis?, an author for former director of the Angelo State University Office of Communications and Marketing, introduced the audience to the story of Daniel R. Edwards, a recipient of the Congressional Medal of Honor. ?Lewis? told more than just Edwards’s biography, however. He also discussed the difficulties of telling truth from fiction in writing about an individual who claims to have accomplished tasks that were impossible. The audience of nearly 170 learned a great deal about Mr. Edwards’s service but also about the job that an historian performs in studying the past.",
        "February 9, 2018",
        "Profs. ?Susana Badiola? (Dept. of Political Science & Philosophy) and ?Kanisorn Wongsrichanalai? (Dept. of History) were honored at the Texas Tech University System’s Chancellor’s Council Gala in Lubbock on February 9. Both of them were featured in the video produced for all of the system’s award winners.",
        "December 13, 2017",
        "Current, the trade periodical for public broadcasting, published an article by Prof. Kathryn Ostrofsky about Sesame Street ?and the history of public television. Read the article here.",
        "November 15, 2017",
        "As part of the “World War I and America” initiative from the Library of America, the Gilder Lehrman Institute of American History, and the National Endowment for the Humanities, this event brought together students from the Department of Visual & Performing Arts to reenact the voices of the World War I generation. Local veterans provided commentary and discussed their own experiences in the armed forces. The event at the San Angelo Museum of Fine Arts drew an audience of over 140. The grant was co-directed by Profs. ?Lamberson? and ?Wongsrichanalai???.",
        "November 3, 2017",
        "Prof. ?Kathryn Ostrofsky? discussed media preservation and teaching with public media on a symposium at the Library of Congress to commemorate the fiftieth anniversary of the signing of the National Public Broadcasting Act.",
        "October 30, 2017",
        "Prof. ?Christopher Capozzola?, associate professor at the Massachusetts Institute of Technology, visited campus and spoke about how the federal government mobilized the American population for the Great War. Over 200 attendees from the student body and San Angelo community attended the event in the Angelo State University Auditorium on October 30, 2017.",
        "October 16, 2017",
        "On October 16, 2017, Prof. Wongsrichanalai, a member of the university’s Holland Symposium Committee, interviewed Prof. Zeynep Tufekci from the University of North Carolina at Chapel Hill about “machine intelligence.”",
        "October 6, 2017",
        "Prof. ?Ken Heineman? was interviewed about his book ?Civil War Dynasty? on Civil War Talk Radio. Listen to the interview here.",
        "October 6, 2017",
        "Prof. ?Ken Heineman? was quoted in an article examining how the Vietnam War affected the nation’s churches. The article is titled “‘The Vietnam Years’: How the conflict ripped the nation’s religious fabric” and was published in the Religion News Service.",
        "September 29, 2017",
        "Prof. ?Charles Endress? (ret.) captivated an audience of over 350 in the C. J. Davidson Center on the evening of September 28, 2017. He discussed the evolution of aircraft and their use during the Great War. This is the first event in the Department of History’s 2017-18 Great War Centennial Commemoration Lecture Series made possible by generous support from the National Endowment for the Humanities.",
        "September 25, 2017",
        "While making summer plans for this year, ASU Honors Program student Jessica Tharp decided to go Dutch.",
        "September 14, 2017",
        "Students, faculty, and guests enjoyed a pleasant evening at the Angelo State Lake House on September 13, 2017 as the Department of History hosted its annual barbecue to inaugurate the new academic year.",
        "September 12, 2017",
        "Prof. John Klingemann joined faculty from other departments to address issues and answer questions at the Hispanic Heritage Month event on September 12, 2017.",
        "May 30, 2017",
        "For Dr. Kanisorn Wongsrichanalai, research and teaching go hand in hand.",
        "April 22, 2017",
        "Prof. Sarah Lynch has been officially named to sit on the Medieval Academy of America’s K-12 Committee,",
        "April 20, 2017",
        "Prof. Charles Grear (Central Texas College) & Alexander Mendoza (University of North Texas) closed out the History Department’s 2016-17 Great War Centennial Commemoration Lecture Series on April 20 at the Fort Concho Commissary. Prof. Grear discussed the plight of ethnic Germans in Texas during the war and Prof. Mendoza discussed the challenges that Mexican Americans faced during that same conflict. Audience members also had the opportunity to view the “World War I and America” traveling exhibit.",
        "April 4, 2017",
        "Bestselling author ?S. C. Gwynne? spoke about his books in the C. J. Davidson Center on April 4, 2017. The event was sponsored by the Department of History and the Friends of the Porter Henderson Library.",
        "April 3, 2017",
        "The World War I traveling exhibit, part of the “World War I & America” grant co-directed by Profs. ?Lamberson? & ?Wongsrichanalai?, is on display at Fort Concho (Barracks 2). It is free and open to the public from April 1-24.",
        "April 1, 2017",
        "Professor Kathryn Ostrofsky has just published an essay, “Sesame Street as a Musical Comedy-Variety Show,” in a volume published by Routledge called Music in Comedy Television: Notes on Laughs, edited by Liz Guiffre and Philip Hayward.",
        "March 31, 2017",
        "Dr. Lynch recently presented a paper on what was meant by Renaissance education in France. When and how did French education become influenced by trends from Italy? What parts of the medieval curriculum were retained or discarded? Examining an early “schoolbook” produced by the noted Renaissance editor and printer, Jodocus Badius Ascensius (1462–1535), she discussed how traveling teachers such as Badius spread new teaching techniques and new textbooks across the Alps and into France. She also looked at how wealthy urbanites in cities like Lyon were eager to learn how Italian schools worked and were happy to spend their own – and their city’s – money on attracting these more up-to-date educators to their regions.",
        "March 30, 2017",
        "Theatre students brought WWI voices to life and local veterans from the Vietnam and Iraq conflicts discussed whether the issues that Americans faced a century ago are still relevant in the late 20th and early 21st centuries in this Great War Series event. Almost 130 attendees turned out for the performances and panel discussion at the Stephens Central Library in downtown San Angelo on March 30, 2017.",
        "March 24, 2017",
        "Professor Kathryn Ostrofsky presented a paper entitled “Publicity as Activism on Sesame Street,” on a panel about “The Advocacy Strategies of Noncommercial Media, 1930-1970,” at the Society for Cinema and Media Studies in Chicago on March 24, 2017.",
        "March 23, 2017",
        "Prof. ?Wongsrichanalai? discussed his book, ?Northern Character: College-Educated New Englanders, Honor, Nationalism, and Leadership in the Civil War Era?, at the Virginia Festival of the Book in Charlottesville, Virginia.",
        "March 6, 2017",
        "Great War Series examines propaganda posters presented by Prof. Jay Antle, Angelo State alumnus and professor at Johnson County Community College.",
        "February 28, 2017",
        "",
        "February 21, 2017",
        "First Spring 2017 Event in the Great War Series Discusses Developments in Two Fields",
        "November 29, 2016",
        "Prof. Jennifer Keene of Chapman University, one of the nation’s leading World War I scholars, visited students in Prof. David Dewar’s constitutional history class before giving a lecture on the effects of the conflict on American life to a crowd of almost 200 attendees in the C. J. Davidson Center. This is the last event in the Great War Series for the fall 2016 semester. Prof. Keene discussed how the war led people to wear wristwatches, use certain words, organize for different causes, and develop policies that affected Americans of future 20th century generations.",
        "November 21, 2016",
        "Prof. Kenna Archer recently traveled to Baylor University to accept the Guittard Book Award for Historical Scholarship for her book, Unruly Waters:  A Social and Environmental History of the Brazos River (published in 2015 by the University of New Mexico Press).  After accepting the award, she answered questions from faculty members, donors, and history majors about the publication process, the Brazos River, and broader efforts to develop water resources in the state.  Unruly Waters had previously been named a finalist for a Spur Award in the non-fiction category from the Western Writers of America.",
        "October 27, 2016",
        "Prof. Mark Hama of the Dept. of English & Modern Languages discussed how World War I affected British poetry. Beginning with a look at Georgian poetry, Prof. Hama then turned to the devastating conflict and introduced several important poets and their key works. The event attracted over 200 attendees from both the student body and San Angelo community.",
        "October 10, 2016",
        "Kenneth J. Heineman, professor of history, was elected to his first three-year term on the Council of the Pennsylvania Historical Association.  Founded in 1932, “The Pennsylvania Historical Association advocates and advances knowledge about the history and culture of Pennsylvania and the mid-Atlantic region, because understanding how the past informs the present helps us shape a better future.”     The PHA publishes Pennsylvania History: A Journal of Mid-Atlantic Studies, a book series, hosts an annual conference, and helps connect scholars.",
        "September 23, 2016",
        "Dr. Charlene Bustos and Dr. R. Gary Pumphrey, along with Ms. Torrey Clay and Ms. Linda Stevens from the Education Service Center Region #XV in San Angelo, have been accepted as the sole national recipient of the 2016 National Council for the Social Studies (NCSS) Grant for the Enhancement of Geographic Literacy, co-sponsored by the Geography Education National Implementation Project (GENIP). This grant was created to promote, enhance, and reinforce geographic literacy in the classroom. The project is designed to “teach the teacher” through professional development programs focusing on ways to integrate cross-curricular connections between geography, math, and reading. The award is $2,500. Classroom resources will be provided to attendees with the money provided by the grant.",
        "September 17, 2016",
        "Prof. Charles Endress, former head of the Department of History and distinguished professor emeritus, opened the 2016-2017 Great War Centennial Commemoration Lecture Series by discussing the experience of fighting on the Western Front. Over 200 students and San Angelo residents came out for the evening programming in the C. J. Davidson Center.",
        "July 21, 2016",
        "Prof. Kathryn Ostrofsky’s work on American cultural history has been featured on “Process,” the blog of the Organization of American Historians. You may read the entry by clicking on this link.",
        "May 16, 2016",
        "Prof. Heineman has published a new encyclopedia entry titled “Pacifism, Peace Activism, and Gender” in Nancy Naples, ed., Wiley-Blackwell Encyclopedia of Gender and Sexuality Studies, online (April 2016).",
        "April 26, 2016",
        "Prof. Adam Seipp from Texas A&M University, discussed how people take different lessons from history and especially the history of World War I in the final event in the 2015-2016 Great War Lecture Series, sponsored by the Angelo State Department of History and the National Endowment for the Humanities. The well-attended event in the C. J. Davidson Center drew a diverse crowd of Angelo State students and San Angelo residents.",
        "April 12, 2016",
        "Mark Weitz, Ph.D., a practicing attorney and independent scholar, discussed the details of and civil rights issues involved in the 1942 Sleepy Lagoon murder trial as part of the Department of History and Porter Henderson Library’s Latino American History Series. Weitz spoke to a crowd of over 60 at the Sugg Community Room at the Stephens Central Library.",
        "March 29, 2016",
        "Prof. Jesus F. de la Teja of Texas State University, a renowned scholars of the Spanish colonial period and early Texas, spoke to an audience of over 150 as part of the Department of History and Porter Henderson Library’s Latino American History Series. Prof. de la Teja explained how Spanish colonization influenced the development of America’s Latino population.",
        "March 6, 2016",
        "Prof. Kathryn Ostrofsky, an instructor in the Department of History, discussed the role of Latino Americans on the children’s television show Sesame Street. The event, part of the Latino American History Series, drew over 60 adults and children to the Sugg Community Room at the Stephens Central Library in downtown San Angelo.",
        "February 20, 2016",
        "The Department of History’s War Stories Project, sponsored by the National Endowment for the Humanities and co-directed by Profs. Christine Lamberson and Kanisorn Wongsrichanalai, was featured on the front page of the Angelo State University website. The feature story link can be found here.",
        "February 16, 2016",
        "Profs. John Osterhout, Ralph Zehnder, and Gregory Smith from the Department of Chemistry at Angelo State University spoke to an audience of over 250 on the topic of “Chemical Warfare in the Great War.” Prof. Osterhout provided historical background, Prof. Zehnder discussed scientist Fritz Haber, and Prof. ?Smith? elaborated on the types of chemicals used in the conflict.",
        "February 9, 2016",
        "Seven local Latino-American veterans participated in a roundtable discussion about their experiences at Fort Concho on February 9, 2016. George Marquez, Domingo Luna, America Garcia, Eugenio Garcia, Primo Gonzalez, Tony Ramirez, and Joe Arzate shared their experiences of service with the audience of 60. Prof. John Klingemann also delivered some opening remarks and placed the service of these individuals in historical context.",
        "December 12, 2015",
        "The Civil War Monitor? recently published Prof. Kanisorn Wongsrichanalai’s latest essay about the presidential election of 1880. The contest, Wongsrichanalai argues, reopened debates about the Civil War since both major party candidates, Gens. Winfield Scott Hancock (D) and James Garfield (R), had served in the Union army during the conflict. The essay is dedicated to the memory of former Department of History faculty member, Prof. Joe Zheng? who passed away in 2012.",
        "November 16, 2015",
        "Prof. David J. Silbey, associate director of the Cornell in Washington Program and adjunct associate professor of history at Cornell University, visited with Angelo State history students before speaking to a 175-person audience as part of the “Great War Centennial Commemoration Lecture Series.” Silbey discussed how cultural backgrounds influence soldiers’ experiences on the battlefield.",
        "November 15, 2015",
        "The fourth event in the Latino American History Series sponsored by the Department of History and the Porter Henderson Library and funded by the National Endowment for the Humanities and the American Library Association paid tribute to one of the leading scholars in the field of Latino-American history, Angelo State’s own Arnoldo De León. Prof. De León retired from Angelo State in the summer of 2015 after over 41 years of service. He was one of the first scholars to work in the field and has over 20 books to his name. Profs. Neil Foley (Southern Methodist University) and Jose Angel Hernandez (University of Houston) spoke about Prof. De León’s career and his influence on their work. A crowd of friends, students, colleagues, and San Angelo residents were also on hand to honor Prof. De León at the San Angelo Museum of Fine Arts.",
        "November 11, 2015",
        "Rob Harris of KIDY in San Angelo interviewed War Stories project co-director Prof. Christine Lamberson and several student workers on Veterans Day 2015.",
        "November 9, 2015",
        "For Dr. Arnoldo De León, a member of Angelo State University’s history faculty for 42 years until his retirement in June, his proudest career moment came in 1987.",
        "November 6, 2015",
        "Christine Lamberson, assistant professor and co-director of the “War Stories” project, published a post on the History News Network site. She describes a disconnect between academic scholarship focused on foreign policy, a public focused on “supporting the troops,” and veterans’ needs. She advocates increasing involvement in veteran-focused public history projects in order to bridge the gap. Read the post here.",
        "October 27, 2015",
        "Retired professor of history and president emeritus Jim Hindman spoke to a crowd of students and San Angelo residents during the second event in the Great War Centennial Commemoration Lecture Series. Hindman discussed the use of u-boats and the complicated issues of neutrality that President Woodrow Wilson had to contend with as the United States became entangled in the desperate fight between the warring powers. Hindman paid particular attention to the sinking of the Lusitania in 1915.",
        "October 15, 2015",
        "Prof. Kenna Archer recently spoke at a meeting of the Dynamic Downtown Lions Club about her book, Unruly Waters:  A Social and Environmental History of the Brazos River.  She offered an overview of the river’s development and concluded with a top ten list of the most memorable times that the river had defied those efforts at development.",
        "October 8, 2015",
        "The Department of History and the Porter Henderson Library hosted filmmaker John J. Valadez at the third event in their Latino American History Series sponsored by the National Endowment for the Humanities and the American Library Association. Mr. Valadez screened his upcoming PBS film, The Head of Joaquin Murrieta and discussed his experiences producing the PBS series Latino Americans with the audience of over 200. The event was made possible by the Center for Community Engagement at Angelo State University as well as the office of the provost.",
        "October 1, 2015",
        "The National Endowment for the Humanities and American Library Association-sponsored series on Latino Americans history and culture continued on Thursday, October 1 with a viewing of the PBS documentary Latino Americans. After viewing episode 5 of the series, the audience of 120 participated in a discussion segment with History Department faculty members Profs. Kenna Archer, Christine Lamberson, and John Klingemann.",
        "September 25, 2015",
        "The National Endowment for the Humanities and American Library Association-sponsored series on Latino Americans history and culture commenced on Thursday, September 24 with a viewing of the PBS documentary Latino Americans. After viewing episode 1 of the series, the audience of 170 then discussed their impressions with History Department faculty members Profs. Kenna Archer, Jason Pierce, and John Klingemann.",
        "September 17, 2015",
        "Prof. John Klingemann, chair of the department, started the Great War Centennial Commemoration Lecture Series by discussing the exploits of the 36th Division (mostly made up of Texas and Oklahoma troops) during World War I. Profs. Christine Lamberson and Kanisorn Wongsrichanalai, co-directors of the NEH-sponsored grant, which made the lecture series possible, also introduced their War Stories Project. Over one hundred and thirty students and San Angelo residents turned out for the event.",
        "September 9, 2015",
        "History Department faculty and staff welcomed their majors and minors back to another school year by hosting a barbecue at the Angelo State Lake Facility in early September of 2015. Students as well as graduates returned to share stories and mingle over burgers and hotdogs.",
        "August 25, 2015",
        "History Department adjunct faculty Cory Robinson has recently been promoted to curator at Fort Concho National Historic Landmark. Robinson earned his master’s degree from the Angelo State Department of History and has worked at the fort for thirteen years.",
        "July 15, 2015",
        "Prof. Kanisorn Wongsrichanalai has published a new essay in an edited collection titled Massachusetts and the Civil War: The Commonwealth and National Disunion (University of Massachusetts Press, 2015). Wongsrichanalai first presented the essay titled “The Union of Gentlemen Restored: College-Educated Northern Veterans, Reconciliation, and Northern Honor” at a conference at the Massachusetts Historical Society in 2013. Wongsrichanalai argues that northern gentlemen’s concept of honor helped foster their reconciliation with their southern counterparts after the Civil War.",
        "June 30, 2015",
        "Profs. Christine Lamberson and Kanisorn Wongsrichanalai sat down for an interview with Marfa Public Radio when they visited the West Texas town for their National Endowment for the Humanities-sponsored project,” War Stories: West Texans and the Experience of War, World War I to the Present.” While there, they interviewed local residents about their service experiences. Profs. John E. Klingemann and Kathryn Ostrofsky also participated in the Marfa event.  Listen to their interview with Marfa Public Radio here.",
        "April 13, 2015",
        "Prof. Kenna Archer recently spoke at the San Antonio Book Festival about her book, Unruly Waters:  A Social and Environmental History of the Brazos River.  The festival, held annually by the San Antonio Public Library Foundation, attracted more than 10,000 visitors last year and was expected to pass that number this year.  Roughly ninety authors from around the country were invited to speak at the festival.  Prof. Archer spoke on a panel about water policy and water concerns in western states.  Her panel - “Running (Out of) Water” - was singled out by the directors before the festival as one of the four panels they were most excited about attending.   After the talk, she signed copies of her book and answered questions about water issues specific to this state.",
        "April 9, 2015",
        "The Department of History’s Civil War Sesquicentennial Commemoration Lecture Series concluded on April 9, 2015, the one hundred and fiftieth anniversary of the surrender of the Confederate Army of Northern Virginia to Union forces. Profs. Kanisorn Wongsrichanalai and Christine Lamberson discussed the legacy of the Civil War. Wongsrichanalai spoke about Reconstruction and the process of reconciliation while Lamberson noted the unfulfilled promises of the war on the Civil Rights Movement in the twentieth century.",
        "April 1, 2015",
        "On April 1, 2015, Fordham University Press published Prof. Kanisorn Wongsrichanalai’s co-edited (with Prof. Lorien Foote, Texas A&M) volume of essays about intellectual life in the Civil War Era. Wongsrichanalai’s essay “Lessons of War” is also in the collection, which showcases work from both established and up-and-coming scholars. The book, So Conceived and So Dedicated: Intellectual Life in the Civil War-Era North, is part of Fordham University Press’s “The North’s Civil War” series and seeks to expand on the idea of intellectual life and culture. The volume was inspired by the late George M. Fredrickson’s 1965 publication, The Inner Civil War.",
        "April 1, 2015",
        "Mr. Preston Lewis, former director of the Office of Communications, and Prof. Tina Doyle from the Department of Communications spoke to an audience at the C. J. Davidson Center on the topics of journalism and photography during the Civil War era. Mr. Lewis discussed several important developments and individuals that helped record events of the war while Prof. Doyle explained the technological advances made in photography as well as the challenges that photographers faced during the period.",
        "March 10, 2015",
        "Profs. Jeff Womack (Department of Visual and Performing Arts) and Kathryn Ostrofsky (Department of History) gave two lectures about the musical traditions that informed Civil War Era Americans. Prof. Womack discussed the New England Singing School movement while Prof. Ostrofsky introduced the audience to artists such as Elizabeth Taylor Greenfield, Stephen Foster, and the Hutchinsons.",
        "February 26, 2015",
        "Dr. Mark Weitz, Ph.D., a practicing attorney at Weitz Morgan PLLC and Civil War historian, discussed three cases that highlight the legal aspects confronting the Confederate and Union governments during the early months of the American Civil War. The event, which was held at the Fort Concho Commissary, attracted a crowd of both students and town residents. The History Department wishes to thank Dr. Weitz, Fort Concho Site Manager Robert Bluthardt, and the Fort Concho Foundation for making this event possible.",
        "January 30, 2015",
        "Dr. Kenna Lang Archer’s book Unruly Waters: A Social and Environmental History of the Brazos River will be released in May 2015 by the University of New Mexico Press. Unruly Waters studies the efforts of engineers and politicians to tame the 950-mile Brazos River and focuses on the period between 1821 to 1980. The book argues that although the development projects proposed for this river were well-intentioned and ambitious in their scope, control over the Brazos proved elusive. Dr. Archer completed her book at the same time that Baylor University opened a $260 million dollar football stadium alongside the Brazos River in Waco, suggesting that the topic of river improvement remains an important one.",
        "January 26, 2015",
        "Prof. April Holm, assistant professor of history and associate director of the Center for Civil War Research at the University of Mississippi, discussed the rupture between northern and southern evangelicals during the Civil War Era. Prof. Holm also briefly discussed her research with the crowd of 180 attendees.",
        "December 9, 2014",
        "Drs. Christine Lamberson and Kanisorn Wongsrichanalai, both assistant professors in the Department of History, have received a grant from the National Endowment for the Humanities to collect, preserve, and analyze stories from veterans and their families. The project titled “West Texans and the Experience of War” will culminate in an online repository and public website displaying interviews, letters, diaries, and other items chronicling the experience of America’s wars during the long Twentieth Century. The grant will also fund the department’s forthcoming lecture series to commemorate the centennial of World War I.  This is Angelo State’s first major NEH grant.  Please read the official news release by the university here.",
        "November 20, 2014",
        "Former Angelo State University President Jim Hindman returned to campus as part of the History Department’s Civil War Sesquicentennial Commemoration Lecture Series. President Hindman, who used to teach a course on sports history, enlightened the crowd about how post-Civil War concerns about masculinity led to the development of American Football.",
        "November 17, 2014",
        "For the past three years, ASU senior Duncan Knox has spent almost as much time as an emissary for the university as he has just being a student.",
        "October 21, 2014",
        "As part of the fall 2014 Civil War Lecture Series, Dr. Emmett Essin from East Tennessee State University presented his research on cavalry horses at the Fort Concho Stables to an audience of 125. Dr. Essin, who spoke as part of the Civil War Lecture Series in 2012, is an expert on the history of the army mule.",
        "September 19, 2014",
        "Clifton Truman Daniel, grandson of former President Harry Truman, spoke to students in Dr. Christine Lamberson’s class about the process of reconciliation and healing between the United States and Japan after World War II.",
        "September 18, 2014",
        "Dr. Brian Dirck of Anderson University discussed “Abraham Lincoln’s Constitution” as part of the American Library Association’s traveling exhibit, “Lincoln: The Constitution and the Civil War. Dr. Dirck’s talk was the first of eight, which will conclude the four-year long series. The traveling exhibit will be available for viewing in the C. J. Davidson Center until September 26 and then at the West Texas Collection until mid-October.",
        "September 10, 2014",
        "History Department faculty members, majors, and guests congregated at the Angelo State University Lake House to kick off the new academic year.",
        "April 24, 2014",
        "Dr. Jason Pierce’s article “Marvelous, Maligned, and Misunderstood: The Strange History of the Mesquite Tree in Texas” examines the environmental and cultural influence of this iconic plant on Texas history from Native American times to the present.  Dr. Pierce shows how this native plant has inadvertently come to dominate landscapes across much of the state—often to the consternation of farmers and ranchers.  The article appears in the April issue of the Southwestern Historical Quarterly.",
        "April 22, 2014",
        "On April 22, 2014, Dr. Robert Hicks, director of the Mutter Museum and Historical Medical Library of the College of Physicians of Philadelphia, made two presentations on Civil War medicine.  At 3 P.M., Dr. Hicks met with Angelo State University pre-med and physical therapy students at the historical Fort Concho post hospital.  Dr. Hicks incorporated artifacts at the hospital in his discussion of Civil War medicine and the lives, illnesses, and deaths of Civil War soldiers.  At 7 P.M. Dr. Hicks then gave a lecture on Civil War medicine at the Fort Concho Stables.  Approximately 136 community members, medical personnel, and Angelo State University faculty and students attended this evening event.  The audience learned about the organization of the Union medical corps, the training of Army doctors, and the challenges they faced with sanitation, disease, and the frequent necessity for amputations.  Topics included the introduction of women into the nascent nursing profession, as well as the role climate played in soldiers’ health.  Dr. Hicks observed that a number of the practices used today in American civilian and military medicine were first derived from Civil War experiences.",
        "April 14, 2014",
        "On Monday, April 14, 2014, Angelo State University honored Dr. Arnoldo De León for his 40 years of service to the institution.  Dr. De León, fresh out of the Air Force, first set foot at ASU in 1967 as a student.  When he is asked about his longevity at ASU, he answers “I needed to work!”",
        "April 14, 2014",
        "On April 14, the History Department and ASU Multicultural Center hosted “San Angelo and Civil Rights: Local Stories of Integration in San Angelo Schools.” Two local community residents spoke about the integration of San Angelo schools during the 1950s to an audience of 150 students and members of the community. Coach Phil George, a former ASU athletic director and coach, spoke about the integration of Angelo State College, particularly the role of Ben Kelly in integrating the football program. Mary Frances Owens is a retired SAISD schoolteacher who spoke about the integration of San Angelo public schools. Dr. Christine Lamberson introduced the speakers and moderated the event.",
        "April 11, 2014",
        "Dr. Christine Lamberson recently spoke at the annual meeting of the Organization of American Historians about the legacies and consequences of the My Lai Massacre for military policy and public opinion. Her talk, “American War Crimes: The My Lai Massacre in American Military Policy” was part of a panel titled: “Boundless War: The Legal, Military, and Psychological Effects of the Vietnam War Across Time and Space.” The talk discussed how the military revised its training after the My Lai Massacre, how the public responded to the prosecution of one massacre participant, and the memory of the massacre.",
        "April 9, 2014",
        "On April 9th, 2014, Ken Heineman gave a talk on his most recent book, Civil War Dynasty, as a guest of the Washington, D.C. Civil War Roundtable.",
        "April 5, 2014",
        "Dr. Kenna Archer recently spoke to members of the Texas Map Society about the historical applications of cartography in her talk “To highlight the hills, to corral the creeks:  Mapwork along the Brazos River.”  The talk highlighted the map collections and mapping tools that she used in the writing of her book manuscript.",
        "March 27, 2014",
        "Dr. David Dewar discussed the origins of baseball and the game’s connection to the American Civil War.  This event, part of the department’s Civil War Lecture Series, was held at Fort Concho and also featured Fort Concho site manager Bob Bluthardt.  Mr. Bluthardt discussed how baseball developed into the nation’s favorite pastime by the twentieth century.  Attendees also witnessed (and some participated in) a demonstration game using nineteenth century rules.",
        "March 4, 2014",
        "William McWhorter, coordinator of the Military Sites Program for the Texas Historical Commission (THC), discussed what his organization has been doing to commemorate the Civil War’s sesquicentennial as part of the History Department’s Civil War lecture series.  Mr. McWhorter spoke to an audience of over 135 in the C. J. Davidson Center.",
        "February 17, 2014",
        "In the second Civil War lecture event of the spring semester, Dr. Kimberly Busby (Department of Visual and Performing Arts) discussed how ancient art and architectural designs influenced Civil War monuments around the nation.",
        "January 28, 2014",
        "In the first Civil War Lecture event of the spring 2014 semester, Drs. Jason Pierce and Kenna Archer spoke to an audience of over 320 on Tuesday, January 28.  Pierce discussed President Lincoln’s policy towards Native Americans and the West.  Archer argued that the Civil War’s devastation affected the nation’s conservation policies later in the nineteenth century.  Dr. Christine Lamberson introduced the speakers and moderated the event.",
        "December 13, 2013",
        "Pictured from left to right: History major and intern Celia Phillips; History major and intern Nathan Cumberland, History instructor Dr. Kenna Archer; and History alum and Fort Concho archivist Evelyn Lemons.",
        "November 14, 2013",
        "Dr. Lorien Foote (Texas A&M) spoke to a crowd of over five hundred as part of the History Department’s Civil War commemoration lecture series.  Dr. Foote described her latest research project about how escaped Union prisoners of war weakened the authority of the South Carolina state government even before the arrival of Gen. William T. Sherman’s armies in the winter of 1865.",
        "November 14, 2013",
        "In celebration of the thirtieth anniversary of his book, They Called Them Greasers: Anglo Attitudes Toward Mexicans in Texas, 1821-1900, Dr. Arnoldo DeLeón, spoke to an audience at Lone Star College-Kingwood on November 14, 2013.",
        "November 8, 2013",
        "Civil War Book Review has published a review of Dr. Ken Heineman’s book Civil War Dynasty: The Ewing Family of Ohio.",
        "October 16, 2013",
        "Drs. Tony Bartyl (left), Deanna Watts (center), and Matthew Gritter (right) from the Department of Political Science and Philosophy  discussed the formation of the Republican Party and President Lincoln as party leader for the History Department’s Civil War Lecture series.  Dr. Jack Barbour (not pictured), chair of the Department of Political Science and Philosophy moderated the event.  A crowd of more than 360 students and San Angelo residents attended the event in the C. J. Davidson Center.",
        "October 10, 2013",
        "Dr. Arnoldo DeLeón, author of the groundbreaking book They Called Them Greasers: Anglo Attitudes Toward Mexicans in Texas, 1821-1900, spoke to an enthralled audience at South Texas College in McAllen, Texas, on October 10, 2013, in commemoration of the book’s 30th year since publication.      (Image courtesy of South Texas College.)",
        "September 17, 2013",
        "Drs. John Klingemann and Kanisorn Wongsrichanalai spoke about the trans-Atlantic slave trade as part of the Civil War Lecture Series.  The event, which started the third year of the series and was also part of the Muslim Journeys program sponsored by the Angelo State University Library, attracted more than three hundred attendees.",
        "September 6, 2013",
        "Dr. Ken Heineman’s work on the Ewing Family has been quoted yet again in the New York Times’s ‘Disunion’ Blog (September 6, 2013).  Read the selection here.",
        "August 23, 2013",
        "Dr. Arnoldo De León had the honor of carrying the university’s mace during the 2013 convocation ceremonies at the Junell Center on August 23, 2013.     (Photograph by Danny Meyer.)",
        "May 15, 2013",
        "Dr. Gary Pumphrey is featured in the summer 2013 edition of the Angelo State University Magazine.  The article, entitled “H2Oooooh,” can be viewed here.  Drs. Arnoldo DeLeon, Ken Heineman, John Klingemann, and Kanisorn Wongsrichanalai are also mentioned in the magazine.",
        "April 17, 2013",
        "April 16-17, 2013: Dr. Bill Doll (Department of Visual and Performing Arts) directed a stage production of “Beloved Companion: The Civil War Letters of James and Frances Catherine Wood” as part of the History Department’s Civil War lecture series.  Based on actual letters belonging to the great-great grandparents of Harriet Lewis (of Angelo State’s physical therapy program), the script was adapted by Lewis and her husband, Preston (Angelo State’s director of Communications and Marketing).  Students Adam Rich and Blair Hitch portrayed the characters on stage while Harriet Lewis narrated and Preston Lewis introduced the production.  “Beloved Companion” was made possible thanks to contributions from the Office of the ASU President and the University Center Program Council (UCPC).  Approximately 500 attendees came out to view the production over the course of its two night run in the Angelo State University Auditorium.     (Image credit: Danny Meyer.  From left to right: Harriet Lewis, Preston Lewis, Adam Rich, and Blair Hitch.)",
        "April 15, 2013",
        "Dr. Andrew Wallace (dean of the Freshman College) awarded Dr. Kanisorn Wongsrichanalai a certificate recognizing his contributions as one of the top supporters of the university’s Early Alert Program.     (Image credit: Mary K. Larson)"
    ],
    "list_items": [],
    "table_headers": [],
    "table_data": [],
    "captions": [],
    "links": [
        "/live/news/19514-history-professor-selected-for-prestigious",
        "/live/news/19514-history-professor-selected-for-prestigious",
        "/live/news/19260-library-of-congress-grant-for-west-texas-his",
        "/live/news/19260-library-of-congress-grant-for-west-texas-his",
        "/live/news/19215-history-lecture-series-fort-hays-state-profe",
        "/live/news/19215-history-lecture-series-fort-hays-state-profe",
        "/live/news/19181-recent-graduate-chosen-for-fulbright-program",
        "/live/news/19181-recent-graduate-chosen-for-fulbright-program",
        "/live/news/19138-history-professor-earns-prestigious-fellowsh",
        "/live/news/19138-history-professor-earns-prestigious-fellowsh",
        "/live/news/18248-new-article-explores-regional-park-system",
        "/live/news/18248-new-article-explores-regional-park-system",
        "/live/news/18246-geography-professor-reflects-on-reading",
        "/live/news/18246-geography-professor-reflects-on-reading",
        "/live/news/17572-fort-concho-elementary-students-texas-histor",
        "/live/news/17360-prof-dickmeyer-named-neh-summer-scholar",
        "/live/news/17359-prof-lynch-publishes-a-new-book",
        "/live/news/16780-prof-ostrofsky-publishes-on-cnn",
        "/live/news/16698-angelo-state-history-department-in-the-top-1",
        "/live/news/16698-angelo-state-history-department-in-the-top-1",
        "/live/news/16689-prof-ostrofsky-publishes-an-annotated-biblio",
        "/live/news/16669-department-faculty-present-at-the-annual-wes",
        "/live/news/16619-humanities-month-2018-ends-with-a-discussion",
        "/live/news/16596-great-war-series-tcu-professor-discusses-wom",
        "/live/news/16596-great-war-series-tcu-professor-discusses-wom",
        "/live/news/16597-war-stories-project-featured-in-magazine-for",
        "/live/news/16595-angelo-state-university-faculty-and-students",
        "/live/news/16595-angelo-state-university-faculty-and-students",
        "/live/news/16503-great-war-lecture-seriesfirst-humanities-mon",
        "/live/news/16503-great-war-lecture-seriesfirst-humanities-mon",
        "/live/news/16433-prof-klingemann-participates-in-hispanic-her",
        "/live/news/16434-welcome-back-picnic",
        "/live/news/16253-prof-lynch-publishes-new-book",
        "/live/news/16253-prof-lynch-publishes-new-book",
        "/live/news/16034-wongsrichanalai-publishes-new-essay",
        "/live/news/15980-prof-archer-wins-portal-to-texas-history-res",
        "/live/news/15956-archer-wins-research-fellowship-from-unt",
        "/live/news/15981-great-war-series-fulbright-scholar-discusses",
        "/live/news/15930-great-war-series-prof-john-irish-discusses-t",
        "/live/news/15931-great-war-series-prof-allison-robbins-on-fem",
        "/live/news/15821-great-war-series-preston-lewis-introduces-au",
        "/live/news/15820-ttus-chancellors-council-distinguished-teach",
        "/live/news/15719-prof-ostrofsky-publishes-article-about-sesam",
        "/live/news/15618-great-war-series-veterans-roundtable-brings",
        "/live/news/15718-prof-ostrofsky-shares-her-work-at-the-librar",
        "/live/news/15718-prof-ostrofsky-shares-her-work-at-the-librar",
        "/live/news/15617-great-war-series-mit-prof-christopher-capozz",
        "/live/news/15616-prof-wongsrichanalai-interviewed-holland-sym",
        "/live/news/15063-prof-heineman-interviewed-on-civil-war-talk-",
        "/live/news/15062-prof-heineman-quoted-in-story-about-the-viet",
        "/live/news/15004-great-war-series-charles-endress-discusses-t",
        "/live/news/14878-history-through-photos",
        "/live/news/14878-history-through-photos",
        "/live/news/14866-history-department-hosts-its-annual-welcome-",
        "/live/news/14865-klingemann-participates-in-hispanic-heritage",
        "/live/news/14235-breathing-life-into-history",
        "/live/news/14235-breathing-life-into-history",
        "/live/news/14010-prof-lynch-named-to-medieval-academy-of-amer",
        "/live/news/14010-prof-lynch-named-to-medieval-academy-of-amer",
        "/live/news/14011-great-war-series-profs-grear-mendoza-discuss",
        "/live/news/13904-s-c-gwynne-visits-campus",
        "/live/news/13903-world-war-i-exhibit-on-display-at-fort-conch",
        "/live/news/13879-prof-ostrofsky-publises-essay",
        "/live/news/13893-prof-lynch-presents-at-annual-meeting-of-the",
        "/live/news/13861-great-war-series-voices-of-wwi-veterans",
        "/live/news/13878-prof-ostrofsky-presents-at-scms",
        "/live/news/13778-prof-wongsrichanalai-at-the-virginia-festiva",
        "/live/news/13778-prof-wongsrichanalai-at-the-virginia-festiva",
        "/live/news/13700-great-war-series-antle-discusses-wartime",
        "/live/news/13700-great-war-series-antle-discusses-wartime",
        "/live/news/13614-prof-heinemans-latest-publications",
        "/live/news/13614-prof-heinemans-latest-publications",
        "/live/news/13571-great-war-series-professors-discuss-photogra",
        "/live/news/13571-great-war-series-professors-discuss-photogra",
        "/live/news/13081-great-war-series-renowned-scholar-explains-t",
        "/live/news/13093-archer-accepts-the-guittard-book-award-for",
        "/live/news/12813-great-war-series-prof-hama-explains-changes-",
        "/live/news/12591-heineman-elected-to-council-of-the-pennsylva",
        "/live/news/12444-prof-pumphrey-among-those-honored-with-ncss-",
        "/live/news/12388-great-war-series-prof-charles-endress-lectur",
        "/live/news/11979-prof-ostrofskys-work-featured-on-oah-blog",
        "/live/news/11709-prof-heineman-publishes-new-encyclopedia-ent",
        "/live/news/11723-texas-aampm-professor-discusses-the-lessons-",
        "/live/news/11485-latino-american-history-series-the-sleepy-la",
        "/live/news/11484-latino-american-history-series-renowned-scho",
        "/live/news/11205-latino-american-history-series-latino-americ",
        "/live/news/11103-war-stories-project-featured-on-front-page-o",
        "/live/news/11101-great-war-lecture-series-chemical-warfare-in",
        "/live/news/11101-great-war-lecture-series-chemical-warfare-in",
        "/live/news/11097-latino-american-veterans-roundtable",
        "/live/news/11097-latino-american-veterans-roundtable",
        "/live/news/10718-history-professor-publishes-new-essay-on-the",
        "/live/news/10719-great-war-lecture-series-cornell-history-pro",
        "/live/news/10719-great-war-lecture-series-cornell-history-pro",
        "/live/news/10552-latino-american-history-series-leading-schol",
        "/live/news/10530-war-stories-project-featured-on-local-television",
        "/live/news/10499-retired-professor-honored-for-latino-america",
        "/live/news/10499-retired-professor-honored-for-latino-america",
        "/live/news/10599-bridging-the-academic-and-public-divide",
        "/live/news/10532-great-war-lecture-series-former-angelo-state",
        "/live/news/10253-archer-promotes-her-book",
        "/live/news/10159-latino-american-history-series-features",
        "/live/news/10159-latino-american-history-series-features",
        "/live/news/10092-latino-american-history-series-holds-second-",
        "/live/news/10092-latino-american-history-series-holds-second-",
        "/live/news/10025-latino-american-history-series-commences",
        "/live/news/10025-latino-american-history-series-commences",
        "/live/news/10024-great-war-lecture-series-commences",
        "/live/news/10023-2015-history-department-barbecue",
        "/live/news/9432-wongsrichanalai-publishes-essay-on-reconcilia",
        "/live/news/9338-war-stories-project-featured-on-marfa-public-",
        "/live/news/8776-archer-speaks-at-the-san-antonio-book-festiva",
        "/live/news/8846-civil-war-lecture-series-wraps-up",
        "/live/news/8697-wongsrichanalais-co-edited-volume-published-b",
        "/live/news/8696-recording-the-war",
        "/live/news/8583-scholars-discuss-antebellum-and-wartime-music",
        "/live/news/8438-legal-scholar-discusses-three-cases-from-the-",
        "/live/news/8288-kenna-archers-book-to-be-released-on-may-1",
        "/live/news/8241-university-of-mississippi-professor-discusses",
        "/live/news/8025-history-professors-receive-neh-grant",
        "/live/news/8024-hindman-highlights-footballs-civil-war-connec",
        "/live/news/7861-duncan-knox-asu-envoy",
        "/live/news/7700-emmett-essin-discusses-cavalry-horses",
        "/live/news/7276-clifton-truman-daniel-speaks-to-history-stude",
        "/live/news/7275-dirck-inaugurates-the-final-year-of-the-civil",
        "/live/news/7274-history-department-welcomes-students-back",
        "/live/news/6276-pierce-publishes-article-about-mesquite-trees",
        "/live/news/6333-hicks-lectures-on-civil-war-medicine",
        "/live/news/6333-hicks-lectures-on-civil-war-medicine",
        "/live/news/6193-de-leon-honored-for-40-years-of-service",
        "/live/news/6173-civil-rights-stories",
        "/live/news/6244-lamberson-presents-her-work-at-the-oah",
        "/live/news/6142-heineman-talks-to-the-dc-civil-war-roundtable",
        "/live/news/6125-archer-speaks-to-the-texas-map-society",
        "/live/news/6081-dewar-discusses-baseball-and-the-civil-war",
        "/live/news/5863-what-has-the-thc-been-up-to",
        "/live/news/5862-busby-discusses-civil-war-monuments",
        "/live/news/5589-pierce-and-archer-discuss-the-west-and-the",
        "/live/news/4946-asu-history-department-well-represented-at",
        "/live/news/4749-texas-aampm-professor-comes-to-asu-for-civil-",
        "/live/news/4750-heinemans-book-gets-new-review",
        "/live/news/4751-civil-war-lecture-series-republican-party",
        "/live/news/4752-deleon-discusses-book-at-south-texas-college",
        "/live/news/4753-civil-war-lecture-series-trans-atlantic-slave",
        "/live/news/4755-heinemans-book-quoted-in-new-york-times-blog",
        "/live/news/4754-de-leon-leads-fall-convocation-procession",
        "/live/news/4756-pumphrey-featured-in-asu-magazine",
        "/live/news/4757-letters-take-to-the-stage-as-part-of-the-civi",
        "/live/news/4758-wongsrichanalai-honored-as-supporter-of-early"
    ],
    "tables": []
}