{
    "file_name": "sites-accessibility-glossary.html",
    "title": "Accessibility Glossary  · Angelo State University",
    "description": "Discover Angelo State’s Accessibility Glossary, defining key terms to promote inclusivity and enhance understanding of accessibility for all.",
    "meta_tags": {
        "viewport": "width=device-width, initial-scale=1",
        "generator": "LiveWhale",
        "og:title": "Accessibility Glossary",
        "og:type": "website",
        "og:url": "https://www.angelo.edu/accessibility/accessibility-glossary/",
        "pagename": "Accessibility Glossary",
        "og:description": "Discover Angelo State’s Accessibility Glossary, defining key terms to promote inclusivity and enhance understanding of accessibility for all.",
        "description": "Discover Angelo State’s Accessibility Glossary, defining key terms to promote inclusivity and enhance understanding of accessibility for all.",
        "og:image": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "og:image:secure_url": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "og:image:width": "1260",
        "og:image:height": "630",
        "twitter:card": "summary_large_image",
        "twitter:title": "Accessibility Glossary",
        "twitter:description": "Discover Angelo State’s Accessibility Glossary, defining key terms to promote inclusivity and enhance understanding of accessibility for all.",
        "twitter:image": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "lw-template-updated": "10/20/2021 02:04pm CDT"
    },
    "headings": [
        "Quick Links",
        "Information For",
        "Accessibility Glossary",
        "Accessibility",
        "Accommodation",
        "Disability",
        "Documents",
        "Educational or Training Materials",
        "Electronic Information, Communication, and Technology Resources (EICT)",
        "Electronic and Information Technology (EIT)",
        "Electronic Media",
        "Equally Effective Alternative Access Plan (EEAAP)",
        "OER",
        "Procurement/Purchases",
        "Section 504",
        "Section 508",
        "Software, Hardware and IT Systems",
        "Universal Design for Learning (UDL)",
        "Voluntary Product Accessibility Template (VPAT)",
        "Web",
        "Web Content Accessibility Guidelines (WCAG)"
    ],
    "paragraphs": [
        "Accessibility sometimes refers to the characteristic that products, services, and facilities can be independently used by people with a variety of disabilities. The ability to access something should be the ability to use it independently without needing to ask for a modification or alternative format.",
        "Accessibilityis…",
        "This term may be used to describe an alteration of environment, curriculum format, or equipment that allows an individual with a disability to gain access to content and/or complete assigned tasks. They allow students with disabilities to pursue a regular course of study and participate as fully as others with modification. Accommodations are made on an individual, as-needed, basis. Since accommodations do not alter learning outcomes, instructors should be able to implement the same grading scale for students with disabilities as they do for students without disabilities.",
        "Anaccommodationis…",
        "Aperson with a disabilityis defined as an individual who has or is regarded as having any mental or physical condition that substantially impairs or restricts one or more major life activities such as performing normal tasks, walking, seeing, hearing, speaking, breathing, learning and working. This includes, but is not limited to, such disabling conditions as visual impairments, psychological/ emotional disabilities, speech and/or hearing impairments, mobility impairments or learning disabilities.",
        "All University produced, maintained or distributed electronic documents must be accessible. This includes, but is not limited to, word processing documents, PDFs, presentations, publications and spreadsheets that are scanned, uploaded, posted or otherwise published or distributed electronically.",
        "All electronic instructional materials, optional and required, must be accessible. This includes, but is not limited to, syllabi, textbooks, presentations, and handouts delivered within the University’s learning management system, via email or via another electronic means for face-to-face classes as well as e-learning courses. It also includes electronic instructional activities such as instructional videos, online collaborative writing, Web conferencing, blogging, etc.",
        "Includes, but is not limited to, information technology and any equipment or interconnected system or subsystem of equipment that is used in the creation, conversion, duplication, or delivery of data or information.",
        "Describes any equipment or interconnected system or subsystem of equipment used in the creation, conversion, or duplication of data or information.",
        "All electronic multimedia resources used by the University for instruction, communication, marketing, promotion or other academic or business purposes must be accessible. Video must be closed-captioned and audio-described and audio resources must be transcribed.",
        "A plan that describes how the institution will provide “equally effective alternate access” to the same information or services offered by a technology that is less than accessible.",
        "Teaching, learning, and research materials that are either (a) in the public domain or (b)licensedin a manner that provides everyone with free and perpetual permission to engage in the 5R activities:",
        "Please see OP 44.XX for details on the rules for the procurement, development, maintenance, and use of electronic and information resources that will be accessible to persons with disabilities.",
        "Section 504 of the Rehabilitation Act defines “disability” as any physical or mental impairment that “substantially limits one or more major life activities”. Individuals with a history of their specific impairment or who are regarded as having an impairment will also be extended protection.",
        "Enacted to eliminate barriers in information technology, to make available new opportunities for people with disabilities, and to encourage development of technologies that will help achieve these goals. The law applies to all Federal agencies when they develop, procure, maintain, or use electronic and information technology. Under Section 508 (29 U.S.C.794d), agencies must give employees with disabilities and members of the public access to information that is comparable to the access available to others.",
        "All software, hardware and IT systems used for academic and research purposes, administrative and business purposes, and customer service must be accessible and produce accessible products or content, which includes compatibility with assistive technology. Software, hardware and IT systems include, but are not limited to, learning management, content management, library systems, email, human resources administration, financial systems, course or event registration, freeware, shareware, enterprise systems and online or remotely hosted software.",
        "An educational framework based on research in the learning sciences, including cognitive neuroscience, that guides the development of flexible learning environments and learning spaces that can accommodate individual learning differences.",
        "A Voluntary Product Accessibility Template (VPAT™) is a document that explains how information and communication technology (ICT) products such as software, hardware, electronic content, and support documentation meet (conform to) theRevised 508 Standardsfor IT accessibility. VPATs™ help Federal agency contracting officials and government buyers to assess ICT for accessibility when doing market research and evaluating proposals.",
        "A VPAT consists of two major sections. The first section includes extensive instructions for completing the VPAT, including essential requirements, best practices, and frequently asked questions. Upon completion, the vendor removes the instructions, leaving only the Accessibility Compliance Report (ACR). The ACR is what is made available as documentation of a product’s conformance to Section 508.",
        "All websites, web pages and web-based software published or hosted by the University or used to conduct University business (including remotely hosted sites and software) must meet the above standards and indicate in plain text a method of contact for Persons with Disabilities having trouble accessing content.",
        "Covers a wide range of recommendations for making Web content more accessible. Following these guidelines will make content accessible to a wider range of people with disabilities, including blindness and low vision, deafness and hearing loss, learning disabilities, cognitive limitations, limited movement, speech disabilities, photosensitivity and combinations of these. Following these guidelines will also often make your Web content more usable to users in general."
    ],
    "list_items": [
        "AcademicsAcademic ProgramsDepartmentsCollegesCoursesAcademic Calendar",
        "Academic Programs",
        "Departments",
        "Colleges",
        "Courses",
        "Academic Calendar",
        "About ASUHistoryCore ValuesNewsTraditionsAbout San AngeloWelcome from the PresidentMission Statement",
        "History",
        "Core Values",
        "News",
        "Traditions",
        "About San Angelo",
        "Welcome from the President",
        "Mission Statement",
        "Admissions & AidApply to ASUAdmitted StudentsRequest More InformationVisit Angelo State UniversityPaying for College",
        "Apply to ASU",
        "Admitted Students",
        "Request More Information",
        "Visit Angelo State University",
        "Paying for College",
        "Life on CampusLivePlayLeadWorkExplore",
        "Live",
        "Play",
        "Lead",
        "Work",
        "Explore",
        "CommunityASU Mayer MuseumAlumni AssociationSmall Business Development CenterWest Texas CollectionNatural History CollectionsKay Bailey Hutchison Center for Cyber Intelligence, Innovation, and Security StudiesLaura W. Bush Institute for Women’s HealthArts at ASUPlanetariumStephens ChapelRanch and Meat MarketASU Ticket OfficeSummer Camps and Conferences",
        "ASU Mayer Museum",
        "Alumni Association",
        "Small Business Development Center",
        "West Texas Collection",
        "Natural History Collections",
        "Kay Bailey Hutchison Center for Cyber Intelligence, Innovation, and Security Studies",
        "Laura W. Bush Institute for Women’s Health",
        "Arts at ASU",
        "Planetarium",
        "Stephens Chapel",
        "Ranch and Meat Market",
        "ASU Ticket Office",
        "Summer Camps and Conferences",
        "Give to ASUMake a GiftSignature EventsJoin",
        "Make a Gift",
        "Signature Events",
        "Join",
        "Athletics",
        "RamPort",
        "Library",
        "Bookstore",
        "Events",
        "Public Health Updates",
        "Administration",
        "Research",
        "Mental Health Services",
        "Title IX/Incident Report",
        "En Español",
        "Current Students",
        "Faculty & Staff",
        "Admitted Students",
        "Military",
        "Parents & Families",
        "Alumni",
        "Visitors",
        "School Counselors",
        "Online Students",
        "Accessibility Glossary",
        "the responsibility of all who create or publish digital content",
        "provided for all students, with no expectation of an explanation of need",
        "expected for disabilities that are easily anticipated",
        "provided based on specific needs of a student with a documented disability",
        "determined by an accommodations officer, such as the Director of Student Disabilities Services, on a case-by-case basis",
        "provided for students whose needs require great intervention, such as live American Sign Language (ASL) interpreters or lecture transcripts for live courses",
        "for circumstances that are difficult to anticipate and prepare for",
        "Retain – make, own, and control a copy of the resource",
        "Reuse – use your original, revised, or remixed copy of the resource publicly",
        "Revise – edit, adapt, and modify your copy of the resource",
        "Remix – combine your original or revised copy of the resource with other existing material to create something new",
        "Redistribute – share copies of your original, revised, or remixed copy of the resource with others",
        "2601 W. Avenue NSan Angelo, TX 76909",
        "1-800-946-8627",
        "Campus Map",
        "Contact ASU",
        "University Directory",
        "RamPort",
        "Jobs at ASU",
        "Facebook",
        "X",
        "Instagram",
        "YouTube",
        "©2024 Angelo State University",
        "All Rights Reserved",
        "Editor Login",
        "TTU System",
        "Texas Tech University",
        "TTU Health Sciences Center",
        "TTUHSC El Paso",
        "Midwestern State University",
        "ASU Privacy Policy",
        "Weather and Emergency Notifications",
        "Mental Health Services",
        "Title IX/Incident Report",
        "State of Texas",
        "Statewide Search",
        "Texas Homeland Security",
        "Texas Veterans Portal",
        "State Auditor’s Office",
        "Fraud Prevention",
        "Site Policies"
    ],
    "table_headers": [],
    "table_data": [],
    "captions": [],
    "links": [
        "#main-content",
        "/",
        "/academics/",
        "/academics/programs/",
        "/departments/",
        "/colleges/",
        "/courses/",
        "/current-students/registrar/academic_calendar.php",
        "/about-asu/",
        "/about-asu/history.php",
        "/about-asu/core-values/",
        "/about-asu/news/",
        "/about-asu/traditions/",
        "/about-asu/san-angelo.php",
        "/about-asu/president/",
        "/about-asu/mission-statement.php",
        "/admissions-and-aid/",
        "/admissions-and-aid/apply/",
        "/admissions-and-aid/admitted/",
        "/admissions-and-aid/info/",
        "/admissions-and-aid/visit/",
        "/admissions-and-aid/paying-for-college/",
        "/life-on-campus/",
        "/life-on-campus/live/",
        "/life-on-campus/play/",
        "/life-on-campus/lead/",
        "/life-on-campus/work/",
        "/life-on-campus/explore/",
        "/community/",
        "/community/mayer-museum/",
        "/alumni/",
        "/community/small-business-development-center/",
        "/community/west-texas-collection/",
        "/departments/biology/angelo-state-natural-history-collection/",
        "/community/kay-bailey-hutchison-center/",
        "/colleges/archer-college-of-health-and-human-services/laura-w-bush-institute-for-womens-health/",
        "/departments/visual-performing-arts/theatre/subscriptions.php",
        "/departments/physics-geosciences/planetarium/",
        "/community/stephens-chapel.php",
        "/community/asu-ranch/",
        "/community/ticket-office/",
        "/community/summer-camps-and-conferences/",
        "/give/",
        "/give/make_gift/",
        "/give/signature-events/",
        "/give/join/",
        "https://www.angelosports.com/",
        "https://ramport.angelo.edu/",
        "/library/",
        "http://bookstore.angelo.edu/",
        "/events/",
        "/public-health/",
        "/administrative-support/",
        "/research/",
        "/current-students/counseling-services/",
        "/current-students/title-ix/",
        "/en-espanol/",
        "/current-students/",
        "/faculty-and-staff/",
        "/admissions-and-aid/admitted/",
        "/active-duty-veterans/",
        "/parents-and-families/",
        "/alumni/",
        "/visitors/",
        "/school-counselors/",
        "/online/",
        "/accessibility/",
        "/accessibility/accessibility-glossary/",
        "/",
        "/accessibility/",
        "https://creativecommons.org/licenses/",
        "https://en.wikipedia.org/wiki/Title_29_of_the_United_States_Code",
        "https://www.law.cornell.edu/uscode/text/29/794d",
        "https://www.access-board.gov/guidelines-and-standards/communications-and-it/about-the-ict-refresh/final-rule",
        "tel:18009468627",
        "/map/",
        "/contact/",
        "/directory/",
        "https://ramport.angelo.edu/",
        "/work-at-asu/",
        "https://www.facebook.com/angelostateuniversity",
        "https://twitter.com/AngeloState",
        "https://www.instagram.com/angelostate/",
        "https://www.youtube.com/user/AngeloStateU",
        "/livewhale/?login&referer=1",
        "http://www.texastech.edu/",
        "https://www.ttu.edu/",
        "https://www.ttuhsc.edu/",
        "https://elpaso.ttuhsc.edu/",
        "https://msutexas.edu/",
        "https://apps.highered.texas.gov/resumes/",
        "/privacy_policy.php",
        "/emergency-notifications/",
        "/current-students/counseling-services/",
        "/current-students/title-ix/",
        "https://www.texas.gov/",
        "https://www.tsl.texas.gov/trail/index.html",
        "https://gov.texas.gov/organization/hsgd",
        "https://veterans.portal.texas.gov/",
        "https://sao.fraud.texas.gov/",
        "/administrative-support/audit-services/fraud_prevention.php",
        "/site-policies/"
    ],
    "tables": []
}