{
    "file_name": "sites-ondemand-webinars.html",
    "title": "On-Demand Webinars  · Angelo State University",
    "description": "COVID-19 business-related training webinars",
    "meta_tags": {
        "viewport": "width=device-width, initial-scale=1",
        "generator": "LiveWhale",
        "og:title": "On-Demand Webinars",
        "og:type": "website",
        "og:url": "https://www.angelo.edu/community/small-business-development-center/training/ondemand-webinars/",
        "pagename": "On-Demand Webinars",
        "og:description": "COVID-19 business-related training webinars",
        "description": "COVID-19 business-related training webinars",
        "og:image": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "og:image:secure_url": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "og:image:width": "1260",
        "og:image:height": "630",
        "twitter:card": "summary_large_image",
        "twitter:title": "On-Demand Webinars",
        "twitter:description": "COVID-19 business-related training webinars",
        "twitter:image": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "lw-template-updated": "02/17/2022 03:31pm CST",
        "keywords": "COVID-19 Webinars, business management, PPP, EIDL, Financing, on-demand, training"
    },
    "headings": [
        "Quick Links",
        "Information For",
        "On-Demand Webinars",
        "November 15th, 2024",
        "November 14th, 2024",
        "November 13th, 2024",
        "November 12th, 2024",
        "November 11th, 2024",
        "October 25th, 2024",
        "October 24th, 2024",
        "October 16th, 2024",
        "October 3rd, 2024",
        "August 13th, 2024",
        "Contact Us!",
        "Find us on…"
    ],
    "paragraphs": [
        "Below is a list of previous live webinars hosted by the ASU SBDC. Please use the register now button attached to each event to access the on-demand version of the webinar.",
        "Looking for details about past events? Contact our training coordinator at 325-942-2098 orsbdctraining@angelo.edu.",
        "Master the art of effective communication with D – Disseminating U – Understanding H – Honesty. This class is tailored for women entrepreneurs seeking to enhance their leadership skills and foster a collaborative team environment. Learn practical tips to improve communication with your staff, cultivate a positive team culture, and boost your business performance. Transform your team’s dynamics and see a direct impact on your bottom line with these essential strategies.",
        "Register Now",
        "The “Time-Saving Marketing Tips for Women-Owned Small Businesses” seminar is designed to empower female entrepreneurs with strategies to streamline their marketing. Tailored for the unique challenges women business owners face, this workshop will provide actionable insights on automating social media, optimizing content creation, leveraging affordable tools, and building a powerful brand presence without overwhelming time commitments. Participants will leave with techniques that not only save time, but allow more focus on achieving a healthy work-life balance.",
        "Register Now",
        "No fancy camera required! Feel empowered to grab your phone and be creative. Discover video as a powerful tool for self-expression, education, and community building. This workshop will help you explore and develop your own video ideas. Learn to maximize visual thinking with filmmaking techniques. Find your unique voice and share it with the world.",
        "Register Now",
        "Join us for an inspiring and practical workshop that unlocks the transformative power of mentorship for women entrepreneurs. In this session, we’ll explore how strategic mentorship can propel your career, expand your network, and equip you with the tools to break through barriers in the business world.",
        "Register Now",
        "Join us for an engaging webinar to empower small business owners with the tools and strategies needed to thrive in today’s digital landscape. Learn how to grow your contact list effectively, turn leads into loyal customers, and maintain seamless follow-up communication using the power of Email marketing and Constant Contact. This session will cover key topics like building an effective email strategy, leveraging automation, and creating targeted campaigns that drive results. Whether new to email marketing or looking to refine your approach, this webinar will provide practical insights to elevate your business.",
        "Register Now",
        "Trust yourself or trust others? This is the dilemma many highly-capable business owners face when they recognize differences in their own and others’ assessments of their entrepreneurial competence. In this session, Dr. Richmond shares adult entrepreneurs’ stories related to perceived differences in their own and others’ assessments of competence, how these entrepreneurs coped with perceived differences, and what they learned. These stories form the basis of an emerging research study that is aimed at gaining insight into the self-devised and self-chosen learning and coping strategies of adult entrepreneurs when they are aware of a mismatch between their own and others’ judgement of their skills. Using entrepreneurs’ own preferred and proven methods to cope and learn can help educators and advisors as they create programming to both train and bolster entrepreneurs’ competencies and confidence.",
        "Register Now",
        "In the fast-paced, interconnected world of business, networking emerges not just as a skill, but as a vital tool for success. “The Power of Connections” offers you a roadmap to master this art, essential for thriving across industries and sectors.",
        "Register Now",
        "In this presentation, we will explore the strategic use of paid advertisements across various social media platforms to enhance your business’s online presence and drive growth. Join us to gain practical insights and strategies to maximize the impact of paid social media ads and achieve your business goals.",
        "Register Now",
        "We’re living in a smartphone world and it’s clear that we have to be prepared to further leverage how people communicate on this device. With mobile, you’ve got an amazing opportunity to reach customers regularly on a device they carry with them at all times. You can win by enhancing the customer experience by using social, email, and text in concert to drive engagement and sales.",
        "Register Now",
        "Tired of feeling awkward or sleazy every time you follow up with a prospect? Want a sales process that works, but feels more authentic to your business and you?",
        "Register Now",
        "The holiday season is a make-or-break moment for small businesses, and it’s about more than just Small Business Saturday. With major shopping events like Black Friday and Cyber Monday approaching, having a solid marketing strategy in place is crucial for grabbing customers’ attention and boosting sales.",
        "Register Now",
        "If your business is NOT producing raving fans and repeat customers, your marketing messaging is probably the problem. Sophisticated Beginner shares a new approach to payoff marketing so your social media does the selling for you. Stop wasting time and effort guessing about what to post!",
        "Register Now",
        "If you had to, could you create a cash flow plan? When great investors like Warren Buffet look at a company’s cash flow, they use that information to know the value of a company. You may not even plan on selling your business, but planning your cash flows is one of the most important things you can do for the financial health of your business. In this workshop, you’ll learn industry best practices that no one else is talking about. Learn from a FP&A and cash forecasting professional how the pros manage cash, and how you can add huge value to your company with just a few minutes each week.",
        "Register Now",
        "Showing up when customers are searching online iscrucial. Customersneedto find accurate, updated information about your local business on Google Search and Google Maps, no matter which device they use. In this workshop, you will learn how to create and manage a Google Business Profile from start to finish.",
        "Register Now",
        "Managing your cash flow can be tricky! At this training event, we will help you better understand how to maximize your cash flow and keep a steady flow moving in and out of your business. We will cover various topics, and key terms to help you manage your cash flow such as fixed & variable costs, contribution margin, and your break-even point. By understanding the 3 key drivers; managing inventory, accounts receivable and expenses, you will be more confident in making business decisions based on the business financials.",
        "Register Now"
    ],
    "list_items": [
        "AcademicsAcademic ProgramsDepartmentsCollegesCoursesAcademic Calendar",
        "Academic Programs",
        "Departments",
        "Colleges",
        "Courses",
        "Academic Calendar",
        "About ASUHistoryCore ValuesNewsTraditionsAbout San AngeloWelcome from the PresidentMission Statement",
        "History",
        "Core Values",
        "News",
        "Traditions",
        "About San Angelo",
        "Welcome from the President",
        "Mission Statement",
        "Admissions & AidApply to ASUAdmitted StudentsRequest More InformationVisit Angelo State UniversityPaying for College",
        "Apply to ASU",
        "Admitted Students",
        "Request More Information",
        "Visit Angelo State University",
        "Paying for College",
        "Life on CampusLivePlayLeadWorkExplore",
        "Live",
        "Play",
        "Lead",
        "Work",
        "Explore",
        "CommunityASU Mayer MuseumAlumni AssociationSmall Business Development CenterWest Texas CollectionNatural History CollectionsKay Bailey Hutchison Center for Cyber Intelligence, Innovation, and Security StudiesLaura W. Bush Institute for Women’s HealthArts at ASUPlanetariumStephens ChapelRanch and Meat MarketASU Ticket OfficeSummer Camps and Conferences",
        "ASU Mayer Museum",
        "Alumni Association",
        "Small Business Development Center",
        "West Texas Collection",
        "Natural History Collections",
        "Kay Bailey Hutchison Center for Cyber Intelligence, Innovation, and Security Studies",
        "Laura W. Bush Institute for Women’s Health",
        "Arts at ASU",
        "Planetarium",
        "Stephens Chapel",
        "Ranch and Meat Market",
        "ASU Ticket Office",
        "Summer Camps and Conferences",
        "Give to ASUMake a GiftSignature EventsJoin",
        "Make a Gift",
        "Signature Events",
        "Join",
        "Athletics",
        "RamPort",
        "Library",
        "Bookstore",
        "Events",
        "Public Health Updates",
        "Administration",
        "Research",
        "Mental Health Services",
        "Title IX/Incident Report",
        "En Español",
        "Current Students",
        "Faculty & Staff",
        "Admitted Students",
        "Military",
        "Parents & Families",
        "Alumni",
        "Visitors",
        "School Counselors",
        "Online Students",
        "Business AdvisingSuccess StoriesOnline LibraryBusiness TipsAnti-Fraud and Anti-Embezzlement InitiativeRural Business Program",
        "Success Stories",
        "Online Library",
        "Business Tips",
        "Anti-Fraud and Anti-Embezzlement Initiative",
        "Rural Business Program",
        "Training & EventsUpcoming EventsOn-Demand WebinarsQuickBooks TrainingBusiness Resource Center Facilities",
        "Upcoming Events",
        "On-Demand Webinars",
        "QuickBooks Training",
        "Business Resource Center Facilities",
        "Corporate Sponsors",
        "Small Business Management Certificate ProgramSBMCP FAQsRequest for Certificate",
        "SBMCP FAQs",
        "Request for Certificate",
        "Leadercast Angelo State",
        "San Angelo Business Plan CompetitionBusiness Plan Competition Winners",
        "Business Plan Competition Winners",
        "The Business Factory - Business IncubatorHow to Apply to the Business FactoryThe Business Factory PricingBusiness Factory Success Stories",
        "How to Apply to the Business Factory",
        "The Business Factory Pricing",
        "Business Factory Success Stories",
        "BizPitch Student Business Competition",
        "About the ASU Small Business Development Center",
        "SBDC Frequently Asked Questions",
        "Contact SBDC Staff",
        "WEW 2024 - Chic Speak: Revolutionizing Your Team’s Dynamics and Your Bottom LineMaster the art of effective communication with D – Disseminating U – Understanding H – Honesty. This class is tailored for women entrepreneurs seeking to enhance their leadership skills and foster a collaborative team environment. Learn practical tips to improve communication with your staff, cultivate a positive team culture, and boost your business performance. Transform your team’s dynamics and see a direct impact on your bottom line with these essential strategies.Register Now",
        "WEW 2024 - Time Saving Marketing Tips for Women-Owned Small BusinessesThe “Time-Saving Marketing Tips for Women-Owned Small Businesses” seminar is designed to empower female entrepreneurs with strategies to streamline their marketing. Tailored for the unique challenges women business owners face, this workshop will provide actionable insights on automating social media, optimizing content creation, leveraging affordable tools, and building a powerful brand presence without overwhelming time commitments. Participants will leave with techniques that not only save time, but allow more focus on achieving a healthy work-life balance.Register Now",
        "WEW 2024 - Short Form Visual StorytellingNo fancy camera required! Feel empowered to grab your phone and be creative. Discover video as a powerful tool for self-expression, education, and community building. This workshop will help you explore and develop your own video ideas. Learn to maximize visual thinking with filmmaking techniques. Find your unique voice and share it with the world.Register Now",
        "WEW 2024 - Scaling New Heights: How Mentorship Propels Women Entrepreneurs to SuccessJoin us for an inspiring and practical workshop that unlocks the transformative power of mentorship for women entrepreneurs. In this session, we’ll explore how strategic mentorship can propel your career, expand your network, and equip you with the tools to break through barriers in the business world.Register Now",
        "WEW 2024 - The Power of the Inbox!: Attract and Retain Customers with Email MarketingJoin us for an engaging webinar to empower small business owners with the tools and strategies needed to thrive in today’s digital landscape. Learn how to grow your contact list effectively, turn leads into loyal customers, and maintain seamless follow-up communication using the power of Email marketing and Constant Contact. This session will cover key topics like building an effective email strategy, leveraging automation, and creating targeted campaigns that drive results. Whether new to email marketing or looking to refine your approach, this webinar will provide practical insights to elevate your business.Register Now",
        "WEW 2024 - Whispers to Wins: Transforming Murmurs into Entrepreneurial MomentumTrust yourself or trust others? This is the dilemma many highly-capable business owners face when they recognize differences in their own and others’ assessments of their entrepreneurial competence. In this session, Dr. Richmond shares adult entrepreneurs’ stories related to perceived differences in their own and others’ assessments of competence, how these entrepreneurs coped with perceived differences, and what they learned. These stories form the basis of an emerging research study that is aimed at gaining insight into the self-devised and self-chosen learning and coping strategies of adult entrepreneurs when they are aware of a mismatch between their own and others’ judgement of their skills. Using entrepreneurs’ own preferred and proven methods to cope and learn can help educators and advisors as they create programming to both train and bolster entrepreneurs’ competencies and confidence.Register Now",
        "WEW 2024 - The Power of ConnectionsIn the fast-paced, interconnected world of business, networking emerges not just as a skill, but as a vital tool for success. “The Power of Connections” offers you a roadmap to master this art, essential for thriving across industries and sectors.Register Now",
        "WEW 2024 - Ad Queens: Reigning Over Paid Ads CampaignsIn this presentation, we will explore the strategic use of paid advertisements across various social media platforms to enhance your business’s online presence and drive growth. Join us to gain practical insights and strategies to maximize the impact of paid social media ads and achieve your business goals.Register Now",
        "WEW 2024 - How to Own the Smartphone with Social, Email, and TextWe’re living in a smartphone world and it’s clear that we have to be prepared to further leverage how people communicate on this device. With mobile, you’ve got an amazing opportunity to reach customers regularly on a device they carry with them at all times. You can win by enhancing the customer experience by using social, email, and text in concert to drive engagement and sales.Register Now",
        "WEW 2024 - Sales Doesn’t Have To Be Cringe: Have Fun & Slay Your SalesTired of feeling awkward or sleazy every time you follow up with a prospect? Want a sales process that works, but feels more authentic to your business and you?Register Now",
        "Holiday Ready Maximize Your Holiday MarketingThe holiday season is a make-or-break moment for small businesses, and it’s about more than just Small Business Saturday. With major shopping events like Black Friday and Cyber Monday approaching, having a solid marketing strategy in place is crucial for grabbing customers’ attention and boosting sales.Register Now",
        "Master Your Social Media Message: 10X Your Content + CommunicationIf your business is NOT producing raving fans and repeat customers, your marketing messaging is probably the problem. Sophisticated Beginner shares a new approach to payoff marketing so your social media does the selling for you. Stop wasting time and effort guessing about what to post!Register Now",
        "Cash Flow Planning Isn’t Just For EmergenciesIf you had to, could you create a cash flow plan? When great investors like Warren Buffet look at a company’s cash flow, they use that information to know the value of a company. You may not even plan on selling your business, but planning your cash flows is one of the most important things you can do for the financial health of your business. In this workshop, you’ll learn industry best practices that no one else is talking about. Learn from a FP&A and cash forecasting professional how the pros manage cash, and how you can add huge value to your company with just a few minutes each week.Register Now",
        "Get Found on Google Search and MapsShowing up when customers are searching online iscrucial. Customersneedto find accurate, updated information about your local business on Google Search and Google Maps, no matter which device they use. In this workshop, you will learn how to create and manage a Google Business Profile from start to finish.Register Now",
        "Analyzing and Managing Your Cash FlowManaging your cash flow can be tricky! At this training event, we will help you better understand how to maximize your cash flow and keep a steady flow moving in and out of your business. We will cover various topics, and key terms to help you manage your cash flow such as fixed & variable costs, contribution margin, and your break-even point. By understanding the 3 key drivers; managing inventory, accounts receivable and expenses, you will be more confident in making business decisions based on the business financials.Register Now",
        "Facebook",
        "X",
        "LinkedIn",
        "2601 W. Avenue NSan Angelo, TX 76909",
        "1-800-946-8627",
        "Campus Map",
        "Contact ASU",
        "University Directory",
        "RamPort",
        "Jobs at ASU",
        "Facebook",
        "X",
        "Instagram",
        "YouTube",
        "©2024 Angelo State University",
        "All Rights Reserved",
        "Editor Login",
        "TTU System",
        "Texas Tech University",
        "TTU Health Sciences Center",
        "TTUHSC El Paso",
        "Midwestern State University",
        "ASU Privacy Policy",
        "Weather and Emergency Notifications",
        "Mental Health Services",
        "Title IX/Incident Report",
        "State of Texas",
        "Statewide Search",
        "Texas Homeland Security",
        "Texas Veterans Portal",
        "State Auditor’s Office",
        "Fraud Prevention",
        "Site Policies"
    ],
    "table_headers": [],
    "table_data": [],
    "captions": [],
    "links": [
        "#main-content",
        "/",
        "/academics/",
        "/academics/programs/",
        "/departments/",
        "/colleges/",
        "/courses/",
        "/current-students/registrar/academic_calendar.php",
        "/about-asu/",
        "/about-asu/history.php",
        "/about-asu/core-values/",
        "/about-asu/news/",
        "/about-asu/traditions/",
        "/about-asu/san-angelo.php",
        "/about-asu/president/",
        "/about-asu/mission-statement.php",
        "/admissions-and-aid/",
        "/admissions-and-aid/apply/",
        "/admissions-and-aid/admitted/",
        "/admissions-and-aid/info/",
        "/admissions-and-aid/visit/",
        "/admissions-and-aid/paying-for-college/",
        "/life-on-campus/",
        "/life-on-campus/live/",
        "/life-on-campus/play/",
        "/life-on-campus/lead/",
        "/life-on-campus/work/",
        "/life-on-campus/explore/",
        "/community/",
        "/community/mayer-museum/",
        "/alumni/",
        "/community/small-business-development-center/",
        "/community/west-texas-collection/",
        "/departments/biology/angelo-state-natural-history-collection/",
        "/community/kay-bailey-hutchison-center/",
        "/colleges/archer-college-of-health-and-human-services/laura-w-bush-institute-for-womens-health/",
        "/departments/visual-performing-arts/theatre/subscriptions.php",
        "/departments/physics-geosciences/planetarium/",
        "/community/stephens-chapel.php",
        "/community/asu-ranch/",
        "/community/ticket-office/",
        "/community/summer-camps-and-conferences/",
        "/give/",
        "/give/make_gift/",
        "/give/signature-events/",
        "/give/join/",
        "https://www.angelosports.com/",
        "https://ramport.angelo.edu/",
        "/library/",
        "http://bookstore.angelo.edu/",
        "/events/",
        "/public-health/",
        "/administrative-support/",
        "/research/",
        "/current-students/counseling-services/",
        "/current-students/title-ix/",
        "/en-espanol/",
        "/current-students/",
        "/faculty-and-staff/",
        "/admissions-and-aid/admitted/",
        "/active-duty-veterans/",
        "/parents-and-families/",
        "/alumni/",
        "/visitors/",
        "/school-counselors/",
        "/online/",
        "/community/small-business-development-center/",
        "/community/small-business-development-center/business-advising.php",
        "/community/small-business-development-center/success_stories.php",
        "/community/small-business-development-center/business_tools.php",
        "/community/small-business-development-center/tips.php",
        "/community/small-business-development-center/anti-fraud-and-anti-embezzlement-initiative/",
        "/community/small-business-development-center/rural-business-program.php",
        "/community/small-business-development-center/training/",
        "/community/small-business-development-center/calendar/",
        "/community/small-business-development-center/training/ondemand-webinars/",
        "/community/small-business-development-center/training/quickbooks-training/",
        "/community/small-business-development-center/training/brc-training-room-reservation.php",
        "/community/small-business-development-center/sbdc-sponsorship/",
        "/community/small-business-development-center/small-business-management-certificate-program/",
        "/community/small-business-development-center/small-business-management-certificate-program/faqs.php",
        "/community/small-business-development-center/small-business-management-certificate-program/request-graduation.php",
        "/community/small-business-development-center/leadercast-live/",
        "/community/small-business-development-center/business-plan-competition/",
        "/community/small-business-development-center/business-plan-competition/winners/",
        "/community/small-business-development-center/the-business-factory/",
        "/community/small-business-development-center/the-business-factory/how-to-apply.php",
        "/community/small-business-development-center/the-business-factory/pricing.php",
        "/community/small-business-development-center/the-business-factory/success-stories.php",
        "/community/small-business-development-center/bizpitch/",
        "/community/small-business-development-center/about_us.php",
        "/community/small-business-development-center/faqs.php",
        "/community/small-business-development-center/contact.php",
        "/",
        "/community/",
        "/community/small-business-development-center/",
        "/community/small-business-development-center/training/",
        "mailto:sbdctraining@angelo.edu",
        "https://angelo-edu.zoom.us/webinar/register/WN_BYsEfXZXQWelTJZIxuWFbg",
        "https://angelo-edu.zoom.us/webinar/register/WN_n4sqHJIEQzmRsWixKbdrOA#/registration",
        "https://angelo-edu.zoom.us/webinar/register/WN_ooS-ihHnRZ6JmaFYbEdIyA#/registration",
        "https://angelo-edu.zoom.us/webinar/register/WN_jw7XELE2Q4afExD9JRHr2w",
        "https://angelo-edu.zoom.us/webinar/register/WN_Be7mF0i9R0SriGwm8UqjQQ",
        "https://angelo-edu.zoom.us/webinar/register/WN_6DaClPeZTaOz4SJX44mwXQ",
        "https://angelo-edu.zoom.us/webinar/register/WN_6d-byIRHSL28o24VqznNjg",
        "https://angelo-edu.zoom.us/webinar/register/WN_dr-2g7ClTiStVsnxfvSvnA#/registration",
        "https://angelo-edu.zoom.us/webinar/register/WN_vBfPw-s7R7utOwVSQyaeNA#/registration",
        "https://angelo-edu.zoom.us/webinar/register/WN_dZH0x2V_SseW6vqstwuiZw#/registration",
        "https://uhv.zoom.us/webinar/register/2817284145136/WN_z6_KotDhTYKQANabusuDoA#/registration",
        "https://angelo-edu.zoom.us/webinar/register/WN_Xd8A6F-OTBeYwG9ATHJ_4Q",
        "https://angelo-edu.zoom.us/webinar/register/WN_izI3hcLyTma6cY6KE5BykQ",
        "https://angelo-edu.zoom.us/webinar/register/WN_6cJm2ef1RHiP0EAbop8eUA",
        "https://angelo-edu.zoom.us/webinar/register/WN_Wi5-WcfSTUaxamOgqD_V8g",
        "mailto:sbdc@angelo.edu",
        "/map/?Business Resource Center",
        "https://www.facebook.com/asusbdc",
        "https://twitter.com/ASUSBDC",
        "https://www.linkedin.com/company/45836658/admin/feed/posts/",
        "tel:18009468627",
        "/map/",
        "/contact/",
        "/directory/",
        "https://ramport.angelo.edu/",
        "/work-at-asu/",
        "https://www.facebook.com/angelostateuniversity",
        "https://twitter.com/AngeloState",
        "https://www.instagram.com/angelostate/",
        "https://www.youtube.com/user/AngeloStateU",
        "/livewhale/?login&referer=1",
        "http://www.texastech.edu/",
        "https://www.ttu.edu/",
        "https://www.ttuhsc.edu/",
        "https://elpaso.ttuhsc.edu/",
        "https://msutexas.edu/",
        "https://apps.highered.texas.gov/resumes/",
        "/privacy_policy.php",
        "/emergency-notifications/",
        "/current-students/counseling-services/",
        "/current-students/title-ix/",
        "https://www.texas.gov/",
        "https://www.tsl.texas.gov/trail/index.html",
        "https://gov.texas.gov/organization/hsgd",
        "https://veterans.portal.texas.gov/",
        "https://sao.fraud.texas.gov/",
        "/administrative-support/audit-services/fraud_prevention.php",
        "/site-policies/"
    ],
    "tables": []
}