{
    "file_name": "sites-college-of-graduate-studies-and-research.html",
    "title": "No Title",
    "description": "No Description",
    "meta_tags": {},
    "headings": [
        "2024 Outstanding Graduate Students",
        "Fortune Magazine Recognizes Online Graduate Degrees",
        "National Science Foundation Grant for Innovation Partnerships",
        "ASU Adds New Doctorate in Transformative Leadership",
        "Angelo State Ranked Among Top Online Colleges in U.S.",
        "New Athletic Academic Advising Certificate Program",
        "English Grad Student Pursuing His Calling",
        "ASU Honors Master’s Candidate Battling Cancer"
    ],
    "paragraphs": [
        "May 9, 2024",
        "Angelo State University honored its 2024 Outstanding Graduate Students, as well as the recipients of three superlative awards, during the recent Graduate Research Symposium and Awards Ceremony in the Houston Harte University Center.",
        "January 10, 2024",
        "Angelo State University’s online master’s degree programs in applied psychology, business administration and nursing have again been ranked among the best in the nation by Fortune magazine, a global leader in business journalism with a worldwide readership of nearly 5 million.",
        "October 10, 2023",
        "Angelo State University has received a $400,000 grant from the National Science Foundation (NSF) to initiate the creation of the ASU Innovation Hub that will be a focal resource for collaboration between faculty, students and industry partners to promote research and workforce development.",
        "May 19, 2023",
        "Angelo State University has added a new Doctor of Education (Ed.D.) in transformative leadership degree program that will prepare graduates for senior leadership positions at institutions and organizations in any industry. It is the fourth doctoral degree now offered by ASU.",
        "January 25, 2023",
        "Angelo State University has been ranked among the nation’s top 25 “Best Online Colleges for 2023” by the EDsmart higher education resource guide. This marks the fourth straight year ASU has made the EDsmart rankings.",
        "January 5, 2017",
        "Angelo State University’s graduate program in coaching, sport, recreation and fitness administration (CSRF) has added a new Athletic Academic Advising Certificate program that will be available to students starting in the spring 2017 semester.",
        "May 24, 2016",
        "Influenced by his grandmother, his ASU mentor, and renowned author James Joyce, graduate student Alex Barchet has embarked on a journey that will soon take him to a new and exciting destination.",
        "June 4, 2015",
        "Most of the graduate students in Angelo State University’s College of Education are working professionals, juggling family, life and career expectations."
    ],
    "list_items": [],
    "table_headers": [],
    "table_data": [],
    "captions": [],
    "links": [
        "/live/news/19363-2024-outstanding-graduate-students",
        "/live/news/19363-2024-outstanding-graduate-students",
        "/live/news/19289-fortune-magazine-recognizes-online-graduate",
        "/live/news/19289-fortune-magazine-recognizes-online-graduate",
        "/live/news/19220-national-science-foundation-grant-for-innova",
        "/live/news/19220-national-science-foundation-grant-for-innova",
        "/live/news/19167-asu-adds-new-doctorate-in-transformative",
        "/live/news/19167-asu-adds-new-doctorate-in-transformative",
        "/live/news/19124-angelo-state-ranked-among-top-online-college",
        "/live/news/19124-angelo-state-ranked-among-top-online-college",
        "/live/news/13168-new-athletic-academic-advising-certificate-p",
        "/live/news/13168-new-athletic-academic-advising-certificate-p",
        "/live/news/11539-english-grad-student-pursuing-his-calling",
        "/live/news/11539-english-grad-student-pursuing-his-calling",
        "/live/news/9200-asu-honors-masters-candidate-battling-cancer",
        "/live/news/9200-asu-honors-masters-candidate-battling-cancer"
    ],
    "tables": []
}