{
    "file_name": "sites-title-ix-definitions-and-examples.html",
    "title": "Title IX Definitions and Examples  · Angelo State University",
    "description": "Title IX Definitions and Examples",
    "meta_tags": {
        "viewport": "width=device-width, initial-scale=1",
        "generator": "LiveWhale",
        "og:title": "Title IX Definitions and Examples",
        "og:type": "website",
        "og:url": "https://www.angelo.edu/current-students/title-ix/title-ix-definitions-and-examples/",
        "pagename": "Title IX Definitions and Examples",
        "og:description": "Title IX Definitions and Examples",
        "description": "Title IX Definitions and Examples",
        "og:image": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "og:image:secure_url": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "og:image:width": "1260",
        "og:image:height": "630",
        "twitter:card": "summary_large_image",
        "twitter:title": "Title IX Definitions and Examples",
        "twitter:description": "Title IX Definitions and Examples",
        "twitter:image": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "lw-template-updated": "10/20/2021 02:05pm CDT",
        "keywords": "Title IX Definitions and Examples"
    },
    "headings": [
        "Quick Links",
        "Information For",
        "Title IX Definitions and Examples",
        "Title IX Sexual Misconduct",
        "Quid Pro Quo",
        "Severe, Pervasive, and Objectively Offensive Conduct",
        "Dating Violence",
        "Domestic Violence",
        "Stalking",
        "Non-Title IX Sexual Misconduct",
        "Interpersonal Violence",
        "Public Indecency",
        "Sexual Assault",
        "Sex Discrimination",
        "Sexual Exploitation",
        "Sexual Harassment",
        "Stalking"
    ],
    "paragraphs": [
        "Behaviors covered by ASU’s Sexual Misconduct policy",
        "Sexual Harassment, Sexual Assault, Sexual Exploitation, Sex Discrimination, Stalking, Public Indecency, Interpersonal (Dating, Domestic, or Family) Violence, Sexual Violence, and any other misconduct based on sex are all behaviors covered under ASU’s sexual misconduct policy.",
        "Conduct that allegedly occurred against a person in the United States, in University’s Education Program or Activity, on the basis of sex, and that satisfies one or more of the following:",
        "A University employee conditioning the provision of an aid, benefit, or service of the University on an individual’s participation in unwelcome sexual conduct;",
        "Example:Logan is Tatum’s supervisor. Logan forces Tatum to engage in sexual activity and notes that if Tatum does not comply, Tatum will be fired.",
        "Unwelcome conduct determined by a reasonable person to be severe, pervasive, and objectively offensive that it effectively denies a person equal access to the University’s Education Program or Activity.",
        "Example:Reese and Sawyer have class together once a week. Each week, Reese arrives 15 minutes before class, stands at the classroom entrance and offers all classmates sexually explicit photos and provides their number for “a good time.” Sawyer and many other classmates are offended by Reese’s behavior and have reported the behavior multiple times.",
        "The following incidents are deemed to meet the Severe, Pervasive, and Objectively Offensive standard:",
        "Sexual Assault",
        "An offense classified as a forcible or nonforcible sex offense.",
        "Violence committed by a person who is or has been in a social relationship of a romantic nature with the victim, and where the existence of such a relationship shall be determined based on a consideration of the length of the relationship, the type of relations, and the frequency of interaction between the persons involved in the relationship.",
        "Example:Morgan and Peyton have been dating for a few months. They routinely meet on campus at 12:00p.m. for lunch. When Morgan was late for lunch one day, Peyton became angry and hit Morgan.",
        "Felony or misdemeanor crimes of violence committed by a current or former spouse or intimate partner of the victim, by a person with whom the victim shares a child in common, by a person cohabitation with or has cohabitated with the victim as a spouse or intimate partner, by a person similarly situated to a spouse of the victim under the laws of the jurisdiction, or by any other person against an adult or youth victim who is protected from that person’s acts under the domestic or family violence laws of the jurisdiction.",
        "Example:Parker and Ryan live together in an on campus apartment. When Ryan arrives at their apartment late after school, Parker hits Ryan and accuses Ryan of not being faithful.",
        "Engaging in a course of conduct directed at a specific person that would cause a reasonable person to fear for their safety or the safety of others, or suffer substantial emotional distress.",
        "Example:Taylor broke up with Drew weeks ago. However, Drew continues to show up in various places on campus where Taylor is and calls 20 to 30 times a day. Taylor recently found a threatening note from Drew stating that Taylor “would be hurt if someone else replaced Drew.”",
        "An offense that meets the definition of dating violence, or domestic or family violence",
        "Dating Violence",
        "Physical, sexual, or verbal abuse or violence, or threat of abuse or violence committed by an individual who is or has been in a social relationship of a romantic or intimate nature with the Complainant. The existence of such a relationship will be determined based on the type and length of the relationship and the frequency of interaction between the persons involved in the relationship. A casual acquaintanceship or ordinary socializing between two individuals does not constitute a romantic or intimate relationship. This definition does not include acts covered under Domestic or Family Violence.",
        "Example:Bobbi and Kym have been seeing each other for a couple of weeks. Kym continues to ask to look through Bobbi’s phone. The last time Kym asked, Bobbi said no, Kym slapped Bobbi so Kym has complied since then.",
        "Domestic Violence or Family Violence",
        "Physical, sexual, or verbal abuse, or threat of abuse or violence committed by a current or former spouse or intimate partner of the Complainant, by a person with whom the Complainant shares a child in common, by a person with whom the Complainant is cohabiting (or has cohabited) with a spouse or intimate partner, by a person similarly situated to a spouse of the Complainant under the Domestic or Family Violence laws of the State of Texas, or by any other person against an adult or youth victim who is protected from that person’s acts under the domestic or family violence laws of the State of Texas.",
        "Example:Sam and Jo live together. When Jo comes home late from work, Sam threatens to hit her each time. One time, when Jo came home from work, Sam pushed Jo against the wall and accused her of staying out late to see other people.",
        "Engaging in private or sexual acts in a publicly viewable location, such that it is offensive to accepted standards of decency including, but not limited to:",
        "Example:Erin and Kym left the windows to their room open in the residence hall so those walking by could witness their sexual interaction.",
        "Sexual contact or intercourse with a person without the person’s consent, including sexual contact or intercourse against the person’s will or in a circumstance in which the person is incapable of consenting to the contact or intercourse. Sexual assault includes Non-Consensual Sexual Contact and Non-Consensual Sexual Intercourse:",
        "Non-Consensual Sexual Contact",
        "Intentional sexual touching, however slight, with any object or part of one’s body of another’s private areas without consent. Sexual Contact includes:",
        "Example:Jordan and Harper are both at a party. Harper agrees to dance with Jordan, while dancing Jordan slips a hand in Harpers shorts and begins to grope under the shorts.",
        "Non-Consensual Sexual Intercourse",
        "Sexual penetration or intercourse, however slight, with a penis, tongue, finger, or any object, and without consent. Penetration can be oral, anal, or vaginal. The following offenses are examples of sexual assault: rape, incest, fondling, and statutory rape.",
        "Example:Terry and Kelli have sex often however, one night Kelli tells Terry no. Terry says Kelli has said yes multiple times before so Terry forces Kelli to have sexual intercourse.",
        "An act that deprives a member of the University Community of their right of access to campuses and facilities and/or of participation in education, services, programs, operations, employment, benefits or opportunities with the University on the basis of the person’s sex.",
        "Example:Aaron was not offered a job on campus because Aaron was told they were looking for someone of a different sex.",
        "Taking non-consensual or abusive sexual advantage of another for the benefit of oneself or a third party. Prohibited behavior includes, but is not limited to:",
        "Example:Jesse sends a nude photo to a friend who promises it won’t be shared. Two days later Jesse learns the photo was posted on Instagram without Jesse’s permission.",
        "Unwelcome sex-based verbal or physical conduct that:",
        "Example:Jules is told unless she has sex with the Graduate Assistant, Jules will not get the internship requested.",
        "Example:Carol continues to post sexually explicit photos in the online discussion board for a class and encourages other students to call for a good time. Students are offended and have reported this behavior to the online professor multiple times.",
        "A course of conduct directed at a specific person that would cause a reasonable person to fear for the person’s own safety or the safety of others or would cause that person to suffer substantial emotional distress. A “course of conduct” means two or more acts in which a person directly, indirectly or through third parties, by any action, method, device or means, follows, monitors, observes, surveils, threatens, or communicates to or about a person or interferes with a person’s property. “Substantial emotional distress” means significant mental suffering or anguish that may, but does not necessarily, require medical or other professional treatment or counseling.",
        "Example:Jean broke up with Jamey weeks ago. However, Jamey continues to show up wherever Jean is and calls 20 to 30 times a day. Jean recently found a threatening note from Jamey stating that Jean “would be hurt if someone else replaced Jamey.”"
    ],
    "list_items": [
        "AcademicsAcademic ProgramsDepartmentsCollegesCoursesAcademic Calendar",
        "Academic Programs",
        "Departments",
        "Colleges",
        "Courses",
        "Academic Calendar",
        "About ASUHistoryCore ValuesNewsTraditionsAbout San AngeloWelcome from the PresidentMission Statement",
        "History",
        "Core Values",
        "News",
        "Traditions",
        "About San Angelo",
        "Welcome from the President",
        "Mission Statement",
        "Admissions & AidApply to ASUAdmitted StudentsRequest More InformationVisit Angelo State UniversityPaying for College",
        "Apply to ASU",
        "Admitted Students",
        "Request More Information",
        "Visit Angelo State University",
        "Paying for College",
        "Life on CampusLivePlayLeadWorkExplore",
        "Live",
        "Play",
        "Lead",
        "Work",
        "Explore",
        "CommunityASU Mayer MuseumAlumni AssociationSmall Business Development CenterWest Texas CollectionNatural History CollectionsKay Bailey Hutchison Center for Cyber Intelligence, Innovation, and Security StudiesLaura W. Bush Institute for Women’s HealthArts at ASUPlanetariumStephens ChapelRanch and Meat MarketASU Ticket OfficeSummer Camps and Conferences",
        "ASU Mayer Museum",
        "Alumni Association",
        "Small Business Development Center",
        "West Texas Collection",
        "Natural History Collections",
        "Kay Bailey Hutchison Center for Cyber Intelligence, Innovation, and Security Studies",
        "Laura W. Bush Institute for Women’s Health",
        "Arts at ASU",
        "Planetarium",
        "Stephens Chapel",
        "Ranch and Meat Market",
        "ASU Ticket Office",
        "Summer Camps and Conferences",
        "Give to ASUMake a GiftSignature EventsJoin",
        "Make a Gift",
        "Signature Events",
        "Join",
        "Athletics",
        "RamPort",
        "Library",
        "Bookstore",
        "Events",
        "Public Health Updates",
        "Administration",
        "Research",
        "Mental Health Services",
        "Title IX/Incident Report",
        "En Español",
        "Current Students",
        "Faculty & Staff",
        "Admitted Students",
        "Military",
        "Parents & Families",
        "Alumni",
        "Visitors",
        "School Counselors",
        "Online Students",
        "Title IX Definitions and Examples",
        "Get HelpFile a ReportThe Grievance ProcessSupportive MeasuresResources",
        "File a Report",
        "The Grievance Process",
        "Supportive Measures",
        "Resources",
        "Safety & Prevention411 on ConsentSafety PlanningTips on How to Stay SafeMandatory Trainings for StudentsRequest a ProgramInformation for Families",
        "411 on Consent",
        "Safety Planning",
        "Tips on How to Stay Safe",
        "Mandatory Trainings for Students",
        "Request a Program",
        "Information for Families",
        "Title IX Annual Reports",
        "Pregnant & Parenting Students",
        "Resource Guide for Students about Sexual Misconduct",
        "Guide for Responsible Employees",
        "Learn MoreFAQPolicies and Procedures",
        "FAQ",
        "Policies and Procedures",
        "The Sexual Assault and Title IX Response TeamMeet the TeamTeam Trainings",
        "Meet the Team",
        "Team Trainings",
        "Forcible sex offense- Any sexual act directed against another person, without the consent of the victim, including instances where the victim is incapable of giving consent, including Rape, Sodomy (oral or anal sexual intercourse), Sexual Assault with an Object, and Fondling",
        "Non-forcible sex offense- Unlawful, non-forcible sexual intercourse including incest and statutory rape.",
        "Exposing one’s genitals or private areas;",
        "Public urination;",
        "Public defecation; and/or",
        "Public sex acts.",
        "Intentional contact with the breasts, buttock, groin, or genitals;",
        "Touching another with any of these body parts;",
        "Making another touch you or themselves with or on any of these body parts; or",
        "Any other intentional bodily contact in a sexual manner.",
        "Rape– The penetration, no matter how slight, of the vagina or anus with any body part or object, or oral penetration by a sex organ of another person, without the consent of the Complainant.",
        "Incest– Sexual intercourse between persons who are related to each other within the degrees wherein marriage is prohibited by law.",
        "Fondling– The touching of the private body parts of another person for the purpose of sexual gratification, without the consent of the Complainant, including instances where the Complainant is incapable of giving consent because of his/her age or because of his/her temporary or permanent mental incapacity",
        "Statutory Rape– Sexual intercourse with a person who is under the statutory age of consent.",
        "Purposeful recording, distribution, or dissemination of sexual or intimate images or recordings of another person without that person’s full knowledge or consent;",
        "Sexual voyeurism;",
        "Inducing another to expose one’s genitals or private areas;",
        "Prostituting another; or",
        "Knowingly exposing someone to or transmitting a sexually transmitted disease without the person’s full knowledge and consent.",
        "In the employment context, unreasonably interferes with a person’s work performance or creates an intimidating, hostile, or offensive work environment;",
        "In the education context, is sufficiently severe, persistent, or pervasive that the conduct interferes with a student’s ability to participate in or benefit from education programs or activities.",
        "2601 W. Avenue NSan Angelo, TX 76909",
        "1-800-946-8627",
        "Campus Map",
        "Contact ASU",
        "University Directory",
        "RamPort",
        "Jobs at ASU",
        "Facebook",
        "X",
        "Instagram",
        "YouTube",
        "©2024 Angelo State University",
        "All Rights Reserved",
        "Editor Login",
        "TTU System",
        "Texas Tech University",
        "TTU Health Sciences Center",
        "TTUHSC El Paso",
        "Midwestern State University",
        "ASU Privacy Policy",
        "Weather and Emergency Notifications",
        "Mental Health Services",
        "Title IX/Incident Report",
        "State of Texas",
        "Statewide Search",
        "Texas Homeland Security",
        "Texas Veterans Portal",
        "State Auditor’s Office",
        "Fraud Prevention",
        "Site Policies"
    ],
    "table_headers": [],
    "table_data": [],
    "captions": [],
    "links": [
        "#main-content",
        "/",
        "/academics/",
        "/academics/programs/",
        "/departments/",
        "/colleges/",
        "/courses/",
        "/current-students/registrar/academic_calendar.php",
        "/about-asu/",
        "/about-asu/history.php",
        "/about-asu/core-values/",
        "/about-asu/news/",
        "/about-asu/traditions/",
        "/about-asu/san-angelo.php",
        "/about-asu/president/",
        "/about-asu/mission-statement.php",
        "/admissions-and-aid/",
        "/admissions-and-aid/apply/",
        "/admissions-and-aid/admitted/",
        "/admissions-and-aid/info/",
        "/admissions-and-aid/visit/",
        "/admissions-and-aid/paying-for-college/",
        "/life-on-campus/",
        "/life-on-campus/live/",
        "/life-on-campus/play/",
        "/life-on-campus/lead/",
        "/life-on-campus/work/",
        "/life-on-campus/explore/",
        "/community/",
        "/community/mayer-museum/",
        "/alumni/",
        "/community/small-business-development-center/",
        "/community/west-texas-collection/",
        "/departments/biology/angelo-state-natural-history-collection/",
        "/community/kay-bailey-hutchison-center/",
        "/colleges/archer-college-of-health-and-human-services/laura-w-bush-institute-for-womens-health/",
        "/departments/visual-performing-arts/theatre/subscriptions.php",
        "/departments/physics-geosciences/planetarium/",
        "/community/stephens-chapel.php",
        "/community/asu-ranch/",
        "/community/ticket-office/",
        "/community/summer-camps-and-conferences/",
        "/give/",
        "/give/make_gift/",
        "/give/signature-events/",
        "/give/join/",
        "https://www.angelosports.com/",
        "https://ramport.angelo.edu/",
        "/library/",
        "http://bookstore.angelo.edu/",
        "/events/",
        "/public-health/",
        "/administrative-support/",
        "/research/",
        "/current-students/counseling-services/",
        "/current-students/title-ix/",
        "/en-espanol/",
        "/current-students/",
        "/faculty-and-staff/",
        "/admissions-and-aid/admitted/",
        "/active-duty-veterans/",
        "/parents-and-families/",
        "/alumni/",
        "/visitors/",
        "/school-counselors/",
        "/online/",
        "/current-students/title-ix/",
        "/current-students/title-ix/title-ix-definitions-and-examples/",
        "#",
        "/current-students/title-ix/file-a-complaint.php",
        "/current-students/title-ix/complaint-process.php",
        "/current-students/title-ix/supportive-measures/",
        "/current-students/title-ix/supportive-measures/resources/",
        "#",
        "/current-students/title-ix/411-on-consent/",
        "/current-students/title-ix/safety-planning/",
        "/current-students/title-ix/risk-reduction-tips.php",
        "/current-students/title-ix/alcoholedu-and-haven.php",
        "/live/forms/856-request-a-title-ix-program-or-training",
        "/current-students/title-ix/information-for-families/",
        "/current-students/title-ix/annual-reports/",
        "/current-students/title-ix/pregnant-and-parenting-students/",
        "/current-students/title-ix/resource-guide-for-students-about-sexual-misconduct/",
        "/current-students/title-ix/employee-help-guide/",
        "#",
        "/current-students/title-ix/frequently-asked-questions.php",
        "/current-students/title-ix/policies-and-procedures/",
        "#",
        "/current-students/title-ix/contacts.php",
        "/current-students/title-ix/trainings.php",
        "/",
        "/current-students/",
        "/current-students/title-ix/",
        "tel:18009468627",
        "/map/",
        "/contact/",
        "/directory/",
        "https://ramport.angelo.edu/",
        "/work-at-asu/",
        "https://www.facebook.com/angelostateuniversity",
        "https://twitter.com/AngeloState",
        "https://www.instagram.com/angelostate/",
        "https://www.youtube.com/user/AngeloStateU",
        "/livewhale/?login&referer=1",
        "http://www.texastech.edu/",
        "https://www.ttu.edu/",
        "https://www.ttuhsc.edu/",
        "https://elpaso.ttuhsc.edu/",
        "https://msutexas.edu/",
        "https://apps.highered.texas.gov/resumes/",
        "/privacy_policy.php",
        "/emergency-notifications/",
        "/current-students/counseling-services/",
        "/current-students/title-ix/",
        "https://www.texas.gov/",
        "https://www.tsl.texas.gov/trail/index.html",
        "https://gov.texas.gov/organization/hsgd",
        "https://veterans.portal.texas.gov/",
        "https://sao.fraud.texas.gov/",
        "/administrative-support/audit-services/fraud_prevention.php",
        "/site-policies/"
    ],
    "tables": []
}