{
    "file_name": "sites-freshman-college.html",
    "title": "Advising Frequently Asked Questions · Freshman College · Angelo State University",
    "description": "Explore the advising FAQs at Angelo State to get answers to common questions and enhance your academic experience as a freshman student on campus.",
    "meta_tags": {
        "viewport": "width=device-width, initial-scale=1",
        "generator": "LiveWhale",
        "og:title": "Advising Frequently Asked Questions",
        "og:type": "website",
        "og:url": "https://www.angelo.edu/current-students/freshman-college/advising-faq.php",
        "pagename": "Advising Frequently Asked Questions",
        "og:description": "Explore the advising FAQs at Angelo State to get answers to common questions and enhance your academic experience as a freshman student on campus.",
        "description": "Explore the advising FAQs at Angelo State to get answers to common questions and enhance your academic experience as a freshman student on campus.",
        "og:image": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "og:image:secure_url": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "og:image:width": "1260",
        "og:image:height": "630",
        "twitter:card": "summary_large_image",
        "twitter:title": "Advising Frequently Asked Questions",
        "twitter:description": "Explore the advising FAQs at Angelo State to get answers to common questions and enhance your academic experience as a freshman student on campus.",
        "twitter:image": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "lw-template-updated": "02/17/2022 03:22pm CST"
    },
    "headings": [
        "Quick Links",
        "Information For",
        "Advising Frequently Asked Questions",
        "Who is my academic advisor?",
        "When should I make an appointment with my advisor?",
        "What should I talk to my advisor about?",
        "When am I eligible to register?",
        "Do I have to see an advisor to register?",
        "Where do I register?",
        "What are the core requirements?",
        "Is it a good idea to take all the core classes first and then concern myself with choosing a major?",
        "Who can I contact if I have general advising questions?",
        "What is a major?",
        "Do all majors require a minor?",
        "What is a minor?",
        "How and when do I need to declare a major?",
        "How do I change a major?",
        "What if I don’t know what I want to major in?",
        "What is a degree plan?",
        "How do I apply for a degree plan?",
        "How do I drop a course",
        "If I stop attending a course will I automatically be dropped?",
        "When should I consider dropping a course?",
        "What is the deadline for dropping a course?",
        "How do I withdraw from the university?",
        "How is grade point average (GPA) calculated?",
        "Are there minimum GPA requirements to be eligible to graduate?",
        "What is academic standing?"
    ],
    "paragraphs": [
        "Declared Major:Your academic department assigns an advisor to you according to your major. Contact the office coordinator in your major department to figure out who will be your advisor.",
        "Undeclared Major:Students who have not chosen a major will be classified as undeclared majors and be advised in the Freshman College. Angelo State expects students to declare a major before they earn 30 semester credit hours, at which point students receive advising through their chosen major department.",
        "Any time you have academic questions, feel free to contact your academic advisor. It is a good idea to schedule an appointment with your advisor as soon asclass schedulesare available for online viewing.",
        "Talk to your advisor about any academic need or concern you may have. Your advisor should be knowledgeable in degree requirements, as well as ASU policies and services, to advise you or refer you to other campus resources.",
        "During early registration, students are assigned a registration time based on the number of credit hours earned, identified as their classification. The more credit hours that are earned, the sooner students are eligible to register. Classifications are broken down as follows:",
        "Yes. Generally speaking, students are required to see an advisor and discuss future semester plans in order for the advisor to clear the advising hold placed on all students prior to registration. Each department has specific advising criteria for their students. Consult with your major department regarding its advising policy and scheduling.",
        "A student may register in person through the Registrar’s Office or online through the ASU portalRamPort.",
        "Thecore curriculum requirements(often referred to as the basics or general requirements) are a 42-credit-hour block of courses that all students must complete, regardless of their major. Certain majors require specific courses from the core. For example, a B.B.A. degree requires BCIS 1305 for the computer literacy requirement.",
        "Not necessarily. Many majors prefer that students take specific courses from the core requirements (nursing, computer science and business majors to name a few).",
        "Discuss your ideas with your advisor to avoid taking classes that may not apply to the major you choose. Some majors have prerequisite courses that need to be completed early to avoid a delay in projected graduation.",
        "If you are an undeclared major but are considering a particular major, you may want to take an introductory course in that academic area to get a better idea about what you want to do.",
        "Contact the Office of Undeclared Advising at 325-942-2595 orfreshman_college@angelo.edu.",
        "A major is a group of courses that constitutes a principal field of study. In most cases, it includes courses from only one academic specialization. In some majors, it will include courses from two or more disciplines. Specific requirements for each major are defined in theUniversity Catalog.",
        "Most degrees do require a minor. Exceptions include majors in business, social work and other degrees with an interdisciplinary major that states the minor as optional.",
        "A minor is a group of courses that constitutes a secondary, less intensive field of study.",
        "Asingle-area minormust have 18 semester credit hours, of which a minimum of six must be at the advanced level (i.e., junior or senior level) and taken in residence (at ASU).",
        "Amultiple-area minoris a set of courses from two or three selected academic disciplines. Nine semester credit hours, including at least six advanced hours taken in residence, are required in each component discipline of a multiple-area minor.",
        "To declare a major, a student must go to the department of the desired major to complete the necessary paperwork. Declaring a major can be done at any time, but it is highly recommended that it be done by the beginning of the sophomore year. Declaring a major does not lock a student into a certain major forever. A student may change a major at any time.",
        "Go to the department of the desired major, speak with an advisor and fill out a change of major form. The form will be forwarded to the Registrar’s Office to complete the process.",
        "Many students are unsure of what to major in. During the first year of college, many students take courses in the core. You may be encouraged to take a course outside of the core that is of interest to you. Visit theCareer Developmentoffice (UC 114) to work with a career counselor. The career counselors work with students to find their weaknesses and their strengths and correlate these to a major field of study and career choice.",
        "A degree plan is a formalized plan that shows the requirements and courses that must be successfully completed to graduate, initiated by the department of the student’s major.",
        "Go to the department of the desired major, speak with an advisor and fill out an application for a degree plan. This form will be forwarded to the dean of the specific college and will become official. The dean’s office will send a letter to you acknowledging that the degree plan has been filed.",
        "To drop a course, a student must go to the Registrar’s Office during the first 12 class days of a long semester or the first four days of a summer term and complete the necessary paperwork. After the 12th class day during a long semester or after the fourth class day of a summer term, a student must get a signed drop slip from the instructor of the course and take it to the Registrar’s Office to complete the process of dropping a course.",
        "No. A student who stops attending class willnotautomatically be dropped from the course. You must follow the required procedure to drop a course. Failure to follow required procedure for dropping a course will result in a grade of “F” in that course.",
        "Dropping a course is a personal choice. A student may want to consider dropping a course if, after consulting with the instructor of the course, there is little or no chance of passing the course. If attendance declines due to unforeseen circumstances, dropping the course may be an option. However, there may be ramifications from dropping a course. Financial aid, scholarships, health insurance and residence hall eligibility may be affected.",
        "Each semester will have a cutoff date for dropping courses. Please check theImportant Datescalendar at the beginning of each semester for the last day to drop a course.",
        "Students may initiate withdrawal from the university by going to the Registrar’s Office inHardeman 200.",
        "A student’s academic progress is measured in terms of the student’s overall grade point average, which is based on all course work (including developmental courses) taken in which a computable grade is awarded.",
        "The student’s overall grade point average is computed by dividing the total number of quality (grade) points earned by the total number of quality hours. For example, a sophomore student who has 35 quality hours and has earned 85 quality points would have a 2.43 overall grade point average: 85 quality points ÷ 35 quality hours = 2.43 GPA.",
        "Yes, based on which major you are following. Consult graduation requirements by department in the University Catalog or department web pages that show degree plans for the major.",
        "Academic standing is determined by a student’s academic progress at ASU based on GPA. GPA requirements for academic standing are NOT the same as GPA requirements for financial aid eligibility. Contact the Financial Aid Office for details.",
        "Academic Standing",
        "GPA Requirement",
        "Dean’s List (fall and spring only with at least 12 college-level hours completed)",
        "3.25–4.00",
        "Good Standing",
        "2.0 and above",
        "Academic Probation",
        "Less than 2.0",
        "Academic Suspension",
        "00–29 hours, less than 1.35;30–59 hours, less than 1.60;60–89 hours, less than 1.80;90 or more hours, less than 1.90"
    ],
    "list_items": [
        "AcademicsAcademic ProgramsDepartmentsCollegesCoursesAcademic Calendar",
        "Academic Programs",
        "Departments",
        "Colleges",
        "Courses",
        "Academic Calendar",
        "About ASUHistoryCore ValuesNewsTraditionsAbout San AngeloWelcome from the PresidentMission Statement",
        "History",
        "Core Values",
        "News",
        "Traditions",
        "About San Angelo",
        "Welcome from the President",
        "Mission Statement",
        "Admissions & AidApply to ASUAdmitted StudentsRequest More InformationVisit Angelo State UniversityPaying for College",
        "Apply to ASU",
        "Admitted Students",
        "Request More Information",
        "Visit Angelo State University",
        "Paying for College",
        "Life on CampusLivePlayLeadWorkExplore",
        "Live",
        "Play",
        "Lead",
        "Work",
        "Explore",
        "CommunityASU Mayer MuseumAlumni AssociationSmall Business Development CenterWest Texas CollectionNatural History CollectionsKay Bailey Hutchison Center for Cyber Intelligence, Innovation, and Security StudiesLaura W. Bush Institute for Women’s HealthArts at ASUPlanetariumStephens ChapelRanch and Meat MarketASU Ticket OfficeSummer Camps and Conferences",
        "ASU Mayer Museum",
        "Alumni Association",
        "Small Business Development Center",
        "West Texas Collection",
        "Natural History Collections",
        "Kay Bailey Hutchison Center for Cyber Intelligence, Innovation, and Security Studies",
        "Laura W. Bush Institute for Women’s Health",
        "Arts at ASU",
        "Planetarium",
        "Stephens Chapel",
        "Ranch and Meat Market",
        "ASU Ticket Office",
        "Summer Camps and Conferences",
        "Give to ASUMake a GiftSignature EventsJoin",
        "Make a Gift",
        "Signature Events",
        "Join",
        "Athletics",
        "RamPort",
        "Library",
        "Bookstore",
        "Events",
        "Public Health Updates",
        "Administration",
        "Research",
        "Mental Health Services",
        "Title IX/Incident Report",
        "En Español",
        "Current Students",
        "Faculty & Staff",
        "Admitted Students",
        "Military",
        "Parents & Families",
        "Alumni",
        "Visitors",
        "School Counselors",
        "Online Students",
        "Academic Advising",
        "Core Curriculum Requirements",
        "Academic Support Center",
        "Supplemental Instruction",
        "Math Lab",
        "Writing Center",
        "Signature CoursesCourse DescriptionsFaculty Planning Information",
        "Course Descriptions",
        "Faculty Planning Information",
        "ASU Eva Camúñez Up & Coming Scholars",
        "Early Alert Program",
        "Students with a Goal (SWAG)",
        "Dean’s List",
        "Contact Us",
        "Freshman: 0–29 hours",
        "Sophomore: 30–59 hours",
        "Junior: 60–89 hours",
        "Senior: 90 or more hours",
        "2601 W. Avenue NSan Angelo, TX 76909",
        "1-800-946-8627",
        "Campus Map",
        "Contact ASU",
        "University Directory",
        "RamPort",
        "Jobs at ASU",
        "Facebook",
        "X",
        "Instagram",
        "YouTube",
        "©2024 Angelo State University",
        "All Rights Reserved",
        "Editor Login",
        "TTU System",
        "Texas Tech University",
        "TTU Health Sciences Center",
        "TTUHSC El Paso",
        "Midwestern State University",
        "ASU Privacy Policy",
        "Weather and Emergency Notifications",
        "Mental Health Services",
        "Title IX/Incident Report",
        "State of Texas",
        "Statewide Search",
        "Texas Homeland Security",
        "Texas Veterans Portal",
        "State Auditor’s Office",
        "Fraud Prevention",
        "Site Policies"
    ],
    "table_headers": [
        "Academic Standing",
        "GPA Requirement"
    ],
    "table_data": [
        "Dean’s List (fall and spring only with at least 12 college-level hours completed)",
        "3.25–4.00",
        "Good Standing",
        "2.0 and above",
        "Academic Probation",
        "Less than 2.0",
        "Academic Suspension",
        "00–29 hours, less than 1.35;30–59 hours, less than 1.60;60–89 hours, less than 1.80;90 or more hours, less than 1.90"
    ],
    "captions": [
        "Academic Progress Details"
    ],
    "links": [
        "#main-content",
        "/",
        "/academics/",
        "/academics/programs/",
        "/departments/",
        "/colleges/",
        "/courses/",
        "/current-students/registrar/academic_calendar.php",
        "/about-asu/",
        "/about-asu/history.php",
        "/about-asu/core-values/",
        "/about-asu/news/",
        "/about-asu/traditions/",
        "/about-asu/san-angelo.php",
        "/about-asu/president/",
        "/about-asu/mission-statement.php",
        "/admissions-and-aid/",
        "/admissions-and-aid/apply/",
        "/admissions-and-aid/admitted/",
        "/admissions-and-aid/info/",
        "/admissions-and-aid/visit/",
        "/admissions-and-aid/paying-for-college/",
        "/life-on-campus/",
        "/life-on-campus/live/",
        "/life-on-campus/play/",
        "/life-on-campus/lead/",
        "/life-on-campus/work/",
        "/life-on-campus/explore/",
        "/community/",
        "/community/mayer-museum/",
        "/alumni/",
        "/community/small-business-development-center/",
        "/community/west-texas-collection/",
        "/departments/biology/angelo-state-natural-history-collection/",
        "/community/kay-bailey-hutchison-center/",
        "/colleges/archer-college-of-health-and-human-services/laura-w-bush-institute-for-womens-health/",
        "/departments/visual-performing-arts/theatre/subscriptions.php",
        "/departments/physics-geosciences/planetarium/",
        "/community/stephens-chapel.php",
        "/community/asu-ranch/",
        "/community/ticket-office/",
        "/community/summer-camps-and-conferences/",
        "/give/",
        "/give/make_gift/",
        "/give/signature-events/",
        "/give/join/",
        "https://www.angelosports.com/",
        "https://ramport.angelo.edu/",
        "/library/",
        "http://bookstore.angelo.edu/",
        "/events/",
        "/public-health/",
        "/administrative-support/",
        "/research/",
        "/current-students/counseling-services/",
        "/current-students/title-ix/",
        "/en-espanol/",
        "/current-students/",
        "/faculty-and-staff/",
        "/admissions-and-aid/admitted/",
        "/active-duty-veterans/",
        "/parents-and-families/",
        "/alumni/",
        "/visitors/",
        "/school-counselors/",
        "/online/",
        "/current-students/freshman-college/",
        "/academics/advising/",
        "/current-students/freshman-college/core-requirements.php",
        "/current-students/freshman-college/academic-tutoring.php",
        "/current-students/freshman-college/supplemental-instruction/",
        "/current-students/freshman-college/math-lab.php",
        "/current-students/writing-center/",
        "/current-students/freshman-college/signature-courses/",
        "/current-students/freshman-college/signature-courses/course-descriptions.php",
        "/current-students/freshman-college/signature-courses/faculty-planning-information.php",
        "/current-students/freshman-college/up-coming-scholars.php",
        "/current-students/freshman-college/early-alert-program.php",
        "/current-students/freshman-college/swag.php",
        "/commencement/graduates/",
        "/current-students/freshman-college/contact-us.php",
        "/",
        "/current-students/",
        "/current-students/freshman-college/",
        "https://registration.prod.angelo.edu/StudentRegistrationSsb/ssb/term/termSelection?mode=search",
        "https://ramport.angelo.edu/",
        "/current-students/freshman-college/core-requirements.php",
        "mailto:freshman_college@angelo.edu",
        "/academics/catalog/",
        "/life-on-campus/work/career-and-professional-success/",
        "/current-students/registrar/academic_calendar.php",
        "/map/?Hardeman_Student_Services_Center",
        "/academics/gpa-calculator/",
        "tel:18009468627",
        "/map/",
        "/contact/",
        "/directory/",
        "https://ramport.angelo.edu/",
        "/work-at-asu/",
        "https://www.facebook.com/angelostateuniversity",
        "https://twitter.com/AngeloState",
        "https://www.instagram.com/angelostate/",
        "https://www.youtube.com/user/AngeloStateU",
        "/livewhale/?login&referer=1",
        "http://www.texastech.edu/",
        "https://www.ttu.edu/",
        "https://www.ttuhsc.edu/",
        "https://elpaso.ttuhsc.edu/",
        "https://msutexas.edu/",
        "https://apps.highered.texas.gov/resumes/",
        "/privacy_policy.php",
        "/emergency-notifications/",
        "/current-students/counseling-services/",
        "/current-students/title-ix/",
        "https://www.texas.gov/",
        "https://www.tsl.texas.gov/trail/index.html",
        "https://gov.texas.gov/organization/hsgd",
        "https://veterans.portal.texas.gov/",
        "https://sao.fraud.texas.gov/",
        "/administrative-support/audit-services/fraud_prevention.php",
        "/site-policies/"
    ],
    "tables": [
        [
            [
                "Academic Standing",
                "GPA Requirement"
            ],
            [
                "Dean’s List (fall and spring only with at least 12 college-level hours completed)",
                "3.25–4.00"
            ],
            [
                "Good Standing",
                "2.0 and above"
            ],
            [
                "Academic Probation",
                "Less than 2.0"
            ],
            [
                "Academic Suspension",
                "00–29 hours, less than 1.35;30–59 hours, less than 1.60;60–89 hours, less than 1.80;90 or more hours, less than 1.90"
            ]
        ]
    ]
}