{
    "file_name": "sites-humanities-month-programing.html",
    "title": "Humanities Month Programming  · Angelo State University",
    "description": "Explore Angelo State’s Humanities Month programming featuring war stories, veteran experiences, and cultural insights.",
    "meta_tags": {
        "viewport": "width=device-width, initial-scale=1",
        "generator": "LiveWhale",
        "og:title": "Humanities Month Programming",
        "og:type": "website",
        "og:url": "https://www.angelo.edu/colleges/college-of-arts-and-humanities/war-stories/humanities-month-programing/",
        "pagename": "Humanities Month Programming",
        "og:description": "Explore Angelo State’s Humanities Month programming featuring war stories, veteran experiences, and cultural insights.",
        "description": "Explore Angelo State’s Humanities Month programming featuring war stories, veteran experiences, and cultural insights.",
        "og:image": "https://www.angelo.edu/live/image/gid/154/width/1260/height/630/crop/1/20425_neh_logo_horizlarge_1.rev.1427290664.jpg",
        "og:image:secure_url": "https://www.angelo.edu/live/image/gid/154/width/1260/height/630/crop/1/20425_neh_logo_horizlarge_1.rev.1427290664.jpg",
        "og:image:width": "516",
        "og:image:height": "258",
        "twitter:card": "summary_large_image",
        "twitter:title": "Humanities Month Programming",
        "twitter:description": "Explore Angelo State’s Humanities Month programming featuring war stories, veteran experiences, and cultural insights.",
        "twitter:image": "https://www.angelo.edu/live/image/gid/154/width/1260/height/630/crop/1/20425_neh_logo_horizlarge_1.rev.1427290664.jpg",
        "lw-template-updated": "02/17/2022 04:48pm CST"
    },
    "headings": [
        "Quick Links",
        "Information For",
        "Humanities Month Programming",
        "Humanities Month Events and Videos"
    ],
    "paragraphs": [
        "The Humanities Month programming was designed to showcase how one might use the War Stories collection in an academic capacity. As an interdisciplinary program that includes scholars from fields across the humanities, including English, Security Studies, Political Science, and Visual Arts, each scholar used the collection differently.",
        "",
        "",
        "The Department of History is proud to sponsor the first annual Humanities Month program at Angelo State University. Each year, faculty members from all departments in the College of Arts & Humanities will select a theme and each department will present on that theme during a designated month. This year, the theme isWar Stories, based on the collection of material collected by Department of History faculty and students over the course of the past four years. The program this year (2018) is partially sponsored by the National Endowment for the Humanities.",
        "For additional information, please contact the Department of History at 325-942-2324 or email atwarstories@angelo.edu.",
        "All events, unless otherwise noted, will begin at 7:00 P.M. and conclude by 8:30 P.M.",
        "Any views, findings, conclusions, or recommendations expressed in this program do not necessarily reflect those of the National Endowment for the Humanities.",
        "“‘Make Way for Democracy!’: African American Veterans’ Fight for Equality During and After the Great War” by Prof. David Krugler, University of Wisconsin—Platteville (October 11, 2018)",
        "In this first event of the Great War Centennial Commemoration Lecture Series for the 2018-19 Academic Year and the inaugural public Humanities Month event, Prof. David Krugler, University of Wisconsin—Platteville, discussed the challenges that African Americans faced during the Great War Era. He explains how they fought for equality and justice by physically defending the communities, countering negative press through their own newspapers, and engaging in the criminal justice system.",
        "Possible Discussion Questions:",
        "VIDEO: “Your Stone Came Today”",
        "In this lecture from the second Humanities Month event, Prof. Bill Taylor, Associate Professor of Security Studies at ASU, outlined the changing understandings of service that Americans have had over the past century. Taylor noted four veterans interviewed by theWar Storiesproject; Anthony Tafolla, Ken Daniel, Michael Gonzales Jr., and Carl McCoy.",
        "Possible Discussion Questions:",
        "“We’re All Green, We’re All Blue”: War Stories, West Texans, and Latinos by Prof. Matthew Gritter, Angelo State University (October 16, 2018)",
        "In this lecture, Prof. Gritter, an Associate Professor of Political Science at ASU, discussed how Latinos interacted with the military and experienced service. He noted how the military acted as an opportunity for many and questioned how identity was augmented by service.",
        "War Stories, A Dramatic Interpretation by the Angelo State University Theater Program (October 16, 2018)",
        "The second Humanities Month event finished with a performance by students from Angelo State University’s theater program. The students wrote the piece by drawing on materials from theWar Storiescollection and connected them with an original story.",
        "Possible Discussion Questions:",
        "“Oh Boy, That’s the Girl!”: Women and the Great War by Prof. Kara Dixon Vuic, Texas Christian University (October 23, 2018)",
        "As part of the Great War Centennial Commemoration Series and the third event of the Humanities Month Program, Professor Kara Vuic, from Texas Christian University, spoke on the experiences of women during the Great War. Her lecture focused on how women were seen by the military, what women volunteering with organizations such as the Red Cross did during the Great War, and how the programs and decisions made in the Great War set a precedent for how women would interact with the military in future conflicts.",
        "Possible Discussion Questions",
        "Music and the Memory of War by Prof. Timothy Bonenfant, Angelo State University (October 30, 2018)",
        "As part of the last Humanities Month Event, Prof. Timothy Bonenfant from the ASU Department of Music notes the value soldiers put on music and how different songs came to be important to those in the military. Prof. Bonenfant identifies the song, “We Gotta Get Out of This Place,” as one that was very popular with those in Vietnam and explains why it gained popularity.",
        "Possible Discussion Questions:",
        "Healing Wounds, Lingering Scars: The Rhetoric of Memory and Commemoration of Vietnam Among West Texas Veterans by Prof. JongHwa Lee, Angelo State University (October 30, 2018)",
        "In this talk, Prof. JongHwa Lee of the ASU Department of Communications and Mass Media analyzes the ways in which society remembers war. For this lecture, he notes American remembrance of the Vietnam War via quotes from various interviews from theWar Storiesproject and photos from the Vietnam Memorial in Washington D.C.",
        "Possible Discussion Questions:",
        "‘Your Stone Came Today’: Vietnam Poems of Glenn Allison by Prof. Laurence Musgrove, Angelo State University (October 30, 2018)",
        "In the final lecture of the Humanities Month series, Prof. Laurence Musgrove, head of the Department of English and Modern Languages at ASU, analyzes the poems of Vietnam veteran Glenn Allison. He explains how Allison uses the five key elements of poetry and how one can use poetry as an analytical tool to understand remembrance.",
        "Possible Discussion Questions"
    ],
    "list_items": [
        "Apply",
        "Get Info",
        "Give",
        "AcademicsAcademic ProgramsDepartmentsCollegesCoursesAcademic Calendar",
        "Academic Programs",
        "Departments",
        "Colleges",
        "Courses",
        "Academic Calendar",
        "About ASUHistoryCore ValuesNewsTraditionsAbout San AngeloWelcome from the PresidentMission Statement",
        "History",
        "Core Values",
        "News",
        "Traditions",
        "About San Angelo",
        "Welcome from the President",
        "Mission Statement",
        "Admissions & AidApply to ASUAdmitted StudentsRequest More InformationVisit Angelo State UniversityPaying for College",
        "Apply to ASU",
        "Admitted Students",
        "Request More Information",
        "Visit Angelo State University",
        "Paying for College",
        "Life on CampusLivePlayLeadWorkExplore",
        "Live",
        "Play",
        "Lead",
        "Work",
        "Explore",
        "CommunityASU Mayer MuseumAlumni AssociationSmall Business Development CenterWest Texas CollectionNatural History CollectionsKay Bailey Hutchison Center for Cyber Intelligence, Innovation, and Security StudiesLaura W. Bush Institute for Women’s HealthArts at ASUPlanetariumStephens ChapelRanch and Meat MarketASU Ticket OfficeSummer Camps and Conferences",
        "ASU Mayer Museum",
        "Alumni Association",
        "Small Business Development Center",
        "West Texas Collection",
        "Natural History Collections",
        "Kay Bailey Hutchison Center for Cyber Intelligence, Innovation, and Security Studies",
        "Laura W. Bush Institute for Women’s Health",
        "Arts at ASU",
        "Planetarium",
        "Stephens Chapel",
        "Ranch and Meat Market",
        "ASU Ticket Office",
        "Summer Camps and Conferences",
        "Give to ASUMake a GiftSignature EventsJoin",
        "Make a Gift",
        "Signature Events",
        "Join",
        "Athletics",
        "RamPort",
        "Library",
        "Bookstore",
        "Events",
        "Public Health Updates",
        "Administration",
        "Research",
        "Mental Health Services",
        "Title IX/Incident Report",
        "En Español",
        "Current Students",
        "Faculty & Staff",
        "Admitted Students",
        "Military",
        "Parents & Families",
        "Alumni",
        "Visitors",
        "School Counselors",
        "Online Students",
        "Find Stories",
        "About the Project",
        "Timelines and Maps",
        "News and Events",
        "Humanities Month Programming",
        "Project Team",
        "War Stories Frequently Asked Questions",
        "Submit Your Story",
        "Thursday, October 11, 2018: “’Make Way for Democracy!’: African American Veterans’ Fight for Equality During and After the Great War”: Prof.David Krugler, University of Wisconsin—Platteville.Note: Location: Eldon Black Recital Hall, Carr Education-Fine Arts Building, 2602 Dena DriveNote: This event is also part of the Great War Centennial Commemoration Lecture Series",
        "Note: Location: Eldon Black Recital Hall, Carr Education-Fine Arts Building, 2602 Dena Drive",
        "Note: This event is also part of the Great War Centennial Commemoration Lecture Series",
        "Tuesday, October 16, 2018: “Service”:Profs.William Taylor(Dept. of Security Studies & Criminal Justice) andMatthew Gritter(Dept. of Political Science & Philosophy) will use War Stories collection material to discuss the broad topic of service. In addition, students from the Theatre Program, supervised by Profs.Ashley MeyerandDaniel Andersonwill put on several short performances based on material from the War Stories collection.Prof.Taylor’s talk is titled “War Stories, Military Service, and American Society.” Prof.Gritter’s talk is titled “‘We Are All Green, We’re All Blue’: War Stories, West Texas, and Latinos.” The title for the Theatre Program’s event, directed by Profs.MeyerandAnderson, is “War Stories: A Dramatic Interpretation.”Note: Location: Eldon Black Recital Hall, Carr Education-Fine Arts Building, 2602 Dena Drive",
        "Prof.Taylor’s talk is titled “War Stories, Military Service, and American Society.” Prof.Gritter’s talk is titled “‘We Are All Green, We’re All Blue’: War Stories, West Texas, and Latinos.” The title for the Theatre Program’s event, directed by Profs.MeyerandAnderson, is “War Stories: A Dramatic Interpretation.”",
        "Note: Location: Eldon Black Recital Hall, Carr Education-Fine Arts Building, 2602 Dena Drive",
        "Tuesday, October 23, 2018: “’Oh Boy, That’s the Girl!’: Women and the Great War”: Prof.Kara D. Vuic, Texas Christian University.Note: Location: C. J. Davidson Center, Houston Harte University Center, 1910 Rosemont DriveNote: This event is also part of the Great War Centennial Commemoration Lecture Series",
        "Note: Location: C. J. Davidson Center, Houston Harte University Center, 1910 Rosemont Drive",
        "Note: This event is also part of the Great War Centennial Commemoration Lecture Series",
        "Tuesday, October 30, 2018: “Memory and Remembrance”: Profs.Laurence Musgrove(Dept. of English & Modern Languages),Timothy Bonenfant(Dept. of Visual & Performing Arts), andJongHwa Lee(Dept. of Communications & Mass Media) will useWar Storiesmaterial to discuss issues pertaining to memory and remembrance.Prof.Bonenfant’s talk is titled “Music and the Memory of War.” Prof.Lee’s talk is titled “Healing Wounds, Lingering Scars: The Rhetoric of Memory and Commemoration of Vietnam Among West Texas Veterans.” Prof.Musgrove’s talk is titled “‘Your Stone Came Today’: Vietnam Poems of Glenn Allison.”Note: Location: Eldon Black Recital Hall, Carr Education-Fine Arts Building, 2602 Dena Drive",
        "Prof.Bonenfant’s talk is titled “Music and the Memory of War.” Prof.Lee’s talk is titled “Healing Wounds, Lingering Scars: The Rhetoric of Memory and Commemoration of Vietnam Among West Texas Veterans.” Prof.Musgrove’s talk is titled “‘Your Stone Came Today’: Vietnam Poems of Glenn Allison.”",
        "Note: Location: Eldon Black Recital Hall, Carr Education-Fine Arts Building, 2602 Dena Drive",
        "How did African Americans use armed self-defense, the black press, and the courts to resist mob violence?",
        "How were veterans involved in resisting the riot violence of 1919?",
        "How did black veterans’ military experiences influence their actions and attitudes?",
        "How did misinformation influence public perception of the riots?",
        "What sort of racialized assumptions increased tensions during this period?",
        "Why were black efforts to fight back against the riots important even if change was not immediate?",
        "What are some of the similarities between various war stories?",
        "What are some of the differences between various war stories?",
        "What value can war stories impart to our understanding of military service?",
        "What ways can researchers use war stories to study military service?",
        "What insights can war stories reveal about American society?",
        "How does this performance influence your views about those who serve in the armed forces or war, in general?",
        "Some of the material presented today is pulled directly from primary and secondary sources used by historians and some of the material was created by the performers specifically for this presentation. How does that influence your understanding and opinions about service?",
        "What do you think the ethical boundaries are when using historical documents for creating art?",
        "Why did the US military send women to WWI in recreation programs?",
        "What qualities did the YMCA and Salvation Army look for in women who would work with soldiers?",
        "What emotional impact did the war have on women like Emma Young Dickson?",
        "What lasting effect did women’s wartime service have for women in America?",
        "How does the music the soldiers in Vietnam differ from that music which was listened to by the general citizenry of the United States? Why do suppose those differences exist?",
        "What kinds of reasons would make a specific tune memorable for a Vietnam veteran?",
        "What tunes do you think might serve the same function for veterans of more recent wars (Iraq, Afghanistan, etc.) that these tunes did for Vietnam veterans?",
        "For ‘war stories,’ what (kind or type) is worth sharing (recording, or commemorating)? Who is most qualified/appropriate to tell the stories? What virtues are valued and honored by the stories?",
        "If you were invited to design a new Vietnam Memorial, what would you propose – particularly, capturing the ‘core’ of the history while reflecting the diversity of experiences?",
        "For a society like ours, often suspicious and divided (worse, at times, without Faith, Dream, Confidence), how do we commemorate our past – whom and what?",
        "What role does poetry play in preserving the memories of war veterans?",
        "How might poetry writing be especially suited for healing the wounded?",
        "What do we learn about the veteran experience from the poems of Glenn Allison?",
        "2601 W. Avenue NSan Angelo, TX 76909",
        "1-800-946-8627",
        "Campus Map",
        "Contact ASU",
        "University Directory",
        "RamPort",
        "Jobs at ASU",
        "Facebook",
        "X",
        "Instagram",
        "YouTube",
        "©2024 Angelo State University",
        "All Rights Reserved",
        "Editor Login",
        "TTU System",
        "Texas Tech University",
        "TTU Health Sciences Center",
        "TTUHSC El Paso",
        "Midwestern State University",
        "ASU Privacy Policy",
        "Weather and Emergency Notifications",
        "Mental Health Services",
        "Title IX/Incident Report",
        "State of Texas",
        "Statewide Search",
        "Texas Homeland Security",
        "Texas Veterans Portal",
        "State Auditor’s Office",
        "Fraud Prevention",
        "Site Policies"
    ],
    "table_headers": [],
    "table_data": [],
    "captions": [],
    "links": [
        "#main-content",
        "/",
        "/admissions-and-aid/?utm_source=cta",
        "/admissions-and-aid/info/?utm_source=cta",
        "/leading-the-charge/?utm_source=cta",
        "/academics/",
        "/academics/programs/",
        "/departments/",
        "/colleges/",
        "/courses/",
        "/current-students/registrar/academic_calendar.php",
        "/about-asu/",
        "/about-asu/history.php",
        "/about-asu/core-values/",
        "/about-asu/news/",
        "/about-asu/traditions/",
        "/about-asu/san-angelo.php",
        "/about-asu/president/",
        "/about-asu/mission-statement.php",
        "/admissions-and-aid/",
        "/admissions-and-aid/apply/",
        "/admissions-and-aid/admitted/",
        "/admissions-and-aid/info/",
        "/admissions-and-aid/visit/",
        "/admissions-and-aid/paying-for-college/",
        "/life-on-campus/",
        "/life-on-campus/live/",
        "/life-on-campus/play/",
        "/life-on-campus/lead/",
        "/life-on-campus/work/",
        "/life-on-campus/explore/",
        "/community/",
        "/community/mayer-museum/",
        "/alumni/",
        "/community/small-business-development-center/",
        "/community/west-texas-collection/",
        "/departments/biology/angelo-state-natural-history-collection/",
        "/community/kay-bailey-hutchison-center/",
        "/colleges/archer-college-of-health-and-human-services/laura-w-bush-institute-for-womens-health/",
        "/departments/visual-performing-arts/theatre/subscriptions.php",
        "/departments/physics-geosciences/planetarium/",
        "/community/stephens-chapel.php",
        "/community/asu-ranch/",
        "/community/ticket-office/",
        "/community/summer-camps-and-conferences/",
        "/give/",
        "/give/make_gift/",
        "/give/signature-events/",
        "/give/join/",
        "https://www.angelosports.com/",
        "https://ramport.angelo.edu/",
        "/library/",
        "http://bookstore.angelo.edu/",
        "/events/",
        "/public-health/",
        "/administrative-support/",
        "/research/",
        "/current-students/counseling-services/",
        "/current-students/title-ix/",
        "/en-espanol/",
        "/current-students/",
        "/faculty-and-staff/",
        "/admissions-and-aid/admitted/",
        "/active-duty-veterans/",
        "/parents-and-families/",
        "/alumni/",
        "/visitors/",
        "/school-counselors/",
        "/online/",
        "/colleges/college-of-arts-and-humanities/war-stories/",
        "/colleges/college-of-arts-and-humanities/war-stories/search.php",
        "/colleges/college-of-arts-and-humanities/war-stories/about-the-project.php",
        "/colleges/college-of-arts-and-humanities/war-stories/timelines/",
        "/colleges/college-of-arts-and-humanities/war-stories/news-events.php",
        "/colleges/college-of-arts-and-humanities/war-stories/humanities-month-programing/",
        "/colleges/college-of-arts-and-humanities/war-stories/project-team.php",
        "/colleges/college-of-arts-and-humanities/war-stories/frequently-asked-questions.php",
        "/colleges/college-of-arts-and-humanities/war-stories/submit-your-story.php",
        "/",
        "/colleges/",
        "/colleges/college-of-arts-and-humanities/",
        "/colleges/college-of-arts-and-humanities/war-stories/",
        "mailto:warstories@angelo.edu",
        "tel:18009468627",
        "/map/",
        "/contact/",
        "/directory/",
        "https://ramport.angelo.edu/",
        "/work-at-asu/",
        "https://www.facebook.com/angelostateuniversity",
        "https://twitter.com/AngeloState",
        "https://www.instagram.com/angelostate/",
        "https://www.youtube.com/user/AngeloStateU",
        "/livewhale/?login&referer=1",
        "http://www.texastech.edu/",
        "https://www.ttu.edu/",
        "https://www.ttuhsc.edu/",
        "https://elpaso.ttuhsc.edu/",
        "https://msutexas.edu/",
        "https://apps.highered.texas.gov/resumes/",
        "/privacy_policy.php",
        "/emergency-notifications/",
        "/current-students/counseling-services/",
        "/current-students/title-ix/",
        "https://www.texas.gov/",
        "https://www.tsl.texas.gov/trail/index.html",
        "https://gov.texas.gov/organization/hsgd",
        "https://veterans.portal.texas.gov/",
        "https://sao.fraud.texas.gov/",
        "/administrative-support/audit-services/fraud_prevention.php",
        "/site-policies/"
    ],
    "tables": []
}