{
    "file_name": "sites-exhibits.html",
    "title": "No Title",
    "description": "No Description",
    "meta_tags": {},
    "headings": [
        "Previous Exhibits",
        "Dual Exhibit: “Reflections and Refractions” & “Adapt Adopt”",
        "Atmospheric Vessels: Selected Works by McIntyre and Ordway",
        "Radio Pioneers of San Angelo",
        "Wild Encounters: Animals of East Africa",
        "Recollection",
        "Vestiges",
        "Wearing the Blue: Buffalo Soldiers in the Frontier Army",
        "Made in America: Manufactured Glass from the San Angelo Museum of Fine Arts",
        "Then & Now",
        "Waterfowl of America",
        "A Woman’s Touch: Women of West Texas",
        "2022 Henry Edwards Distinguished Lectureship in Art",
        "James Watkins Ceramics",
        "Transportation in the West",
        "Going to Texas: Five Centuries of Maps Exhibit"
    ],
    "paragraphs": [
        "September",
        "Explore the dual exhibit of “Reflections and Refractions” by Yuni Lee and “Adapt Adopt” by Nishiki Sugawara-Beda, the featured speakers for the 2024 Henry Edwards Distinguished Lectureship in Art. Discover their unique perspectives in contemporary art.",
        "April",
        "As part of the 25th San Angelo National Ceramic Competition, the ASU Department of Visual and Performing Arts is sponsoring the pop-up show “Atmospheric Vessels: Selected Works by McIntyre and Ordway.” Join us at the ASU Mayer Museum to see the works of these talented ceramics artists.",
        "March",
        "Ride the radio wave through more than one hundred years of San Angelo radio history. In partnership with the San Angelo Amateur Radio Club (SAARC), this exhibit explores all facets of the radio industry, including the first generation of radio enthusiasts in San Angelo, the economic impact radio had on our community and the evolution of radio equipment through the decades.",
        "January",
        "From the majestic savanna grasslands to the grandeur of the Rift Valley rivers and lakes, East Africa presents breathtaking landscapes populated by many of Earth’s most charismatic and recognizable animals.",
        "November, 2023",
        "Embark on a visual journey through Hayum Surl’s artistic evolution with clay. Each piece reflects his intimate connection with the medium, demonstrating its transition over time.",
        "September, 2023",
        "Robbie Barber is an award-winning artist. His sculptures, inspired by his travels in rural America, showcase the unique buildings of agricultural communities and share the stories of the people who lived and built them.",
        "April, 2023",
        "Created by Congress after the Civil War, these newly formed regiments of black regulars served on posts throughout the United States. Follow these “Buffalo Soldiers” from enlistment to retirement and learn about their unique experiences, challenges, and achievements.",
        "March, 2023",
        "Featuring over one-hundred pieces of American factory-made glass, this exhibit explores the history of glass manufacturing in the United States through the major manufacturers, movements and innovators.",
        "November, 2022",
        "The San Angelo Cultural Affairs Council and the Mayer Museum invite you to see the works of San Angelo and area artists of the past and present.",
        "November, 2022",
        "Angelo State University’s Mayer Museum and the Angelo State Natural History Collections invite you to explore the many dabblers, divers, sea ducks, geese and swans that call North America home.",
        "October, 2022",
        "West Texas women have played an integral role in the growth and development of the region. Drawing on archival holdings, the West Texas Collection will spotlight the often under-told stories of the women who shaped West Texas.",
        "August, 2022",
        "This year’s exhibit will feature contemporary paintings by guest artists Lee Hill and Alexis Serio.",
        "April, 2022",
        "James C. Watkins is a ceramic artist who has worked with clay for over 40 years. This exhibition will focus on his recent works, the breadth of his career, and the diversity of his skills and inspirations.",
        "January, 2022",
        "This exhibit will highlight the human experience of travel. This collaborative project will feature artifacts from Fort Concho, San Angelo’s Railway Museum, the West Texas Collection, and Texas Tech University’s Southwest Collection.",
        "January, 2022",
        "This traveling exhibit is a selection of historical maps from the Yana and Marty Davis Map Collection at the Museum of the Big Bend in Alpine, Texas, covering five centuries of Texas and North American history."
    ],
    "list_items": [],
    "table_headers": [],
    "table_data": [],
    "captions": [],
    "links": [],
    "tables": []
}