{
    "file_name": "sites-course-descriptions.html",
    "title": "Computer Science (CS) Graduate Courses  · Angelo State University",
    "description": "Explore Angelo State’s computer science master’s courses, designed to enhance skills in advanced programming, data structures, AI, and more for career gr...",
    "meta_tags": {
        "viewport": "width=device-width, initial-scale=1",
        "generator": "LiveWhale",
        "og:title": "Computer Science (CS) Graduate Courses",
        "og:type": "website",
        "og:url": "https://www.angelo.edu/departments/computer-science/course-descriptions/computer-science-graduate-courses.php",
        "pagename": "Computer Science (CS) Graduate Courses",
        "og:description": "Explore Angelo State’s computer science master’s courses, designed to enhance skills in advanced programming, data structures, AI, and more for career gr...",
        "description": "Explore Angelo State’s computer science master’s courses, designed to enhance skills in advanced programming, data structures, AI, and more for career gr...",
        "og:image": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "og:image:secure_url": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "og:image:width": "1260",
        "og:image:height": "630",
        "twitter:card": "summary_large_image",
        "twitter:title": "Computer Science (CS) Graduate Courses",
        "twitter:description": "Explore Angelo State’s computer science master’s courses, designed to enhance skills in advanced programming, data structures, AI, and more for career gr...",
        "twitter:image": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "lw-template-updated": "10/20/2021 02:05pm CDT"
    },
    "headings": [
        "Quick Links",
        "Information For",
        "Computer Science (CS) Graduate Courses"
    ],
    "paragraphs": [
        "SeeCourse & Instructor Informationfor current offerings and syllabus listings.",
        "6099 Thesis: Credit 1 to 9.Research conducted by the student individually under the guidance of an academic advisor. This thesis study gives students the chance to investigate a computer science research topic in the academic advisor’s research area or interest, and develop a new method and assess the solution, report and present the outcomes professionally. (May be repeated for a total of nine semester credit hours.)",
        "6300 Introduction to Programming for Data Science (3-0).Understand and apply introductory programming concepts such as sequencing, iteration, selection, working with files, working with different data structures towards solving data science problems such as data collection, data processing, data analysis, and data visualization.",
        "6302 Advanced Operating Systems (3-0).Review of operating systems concepts. Distributed operating systems, synchronization, communication, file systems, and memory sharing.",
        "6306 Software Engineering (3-0).Introduction to the methods and tools for the requirements analysis and design stages of software life cycles. Discussion of software requirements including elicitation, modeling notations, analysis, and documentation. Brief overview of process models and project management. Architectural styles in software systems, design methods, design patterns and reverse engineering. Open source software development. Software licenses. Ethical issues.",
        "6308 Ethical Issues in Computing (3-0).Ethical issues in software development. Ethical responsibility of ensuring software correctness, reliability, safety, and security. Professional development, certification, code of ethics, conduct and practice. Accountability, responsibility and liability of professional software development.",
        "6310 Database Systems (3-0).Foundations of database management systems. Database design techniques such as database modeling using ER diagrams and normalization. Query languages such as SQL. Physical data organization and indexing. Relational, object-oriented, and document-oriented databases.",
        "6311 Advanced Database Systems (3-0).A comprehensive introduction to modern database management systems. Spatial, temporal, and multimedia databases. Core concepts and fundamentals of high-performance transaction processing systems (OLTP) and large-scale analytical systems (OLAP). Web data management. NoSQL systems. Review of other contemporary database systems.",
        "6312 Advanced Web Technologies (3-0).Review of modern web technologies. Web application development frameworks. Client-side and server-side web development. Integration with databases. Usability, efficiency, performance of web applications.",
        "6314 Computer Networks (3-0).Modern computer networks with emphasis on protocols, architectures and implementation issues in the internet.",
        "6315 Computer and Network Security (3-0).A comprehensive review of security risks and threats to computer systems and networks. Review of components used in an enterprise security infrastructure. Advanced topics in the security of enterprise networks and systems.",
        "6316 Data Security (3-0).Fundamental concepts in data security, including cryptography, digital forensics, digital integrity and authentication, access control, secure communication protocols, cryptanalysis, data privacy. Information storage security.",
        "6317 Software Security (3-0).Fundamental principles of software security. Security requirements and their role in software requirement analysis, design, and implementation. Static and dynamic testing. Ethical issues in secure software development.",
        "6318 Artificial Intelligence (3-0).A comprehensive introduction to artificial intelligence. Fundamental concepts and techniques of intelligent systems. Agents and environment. Agent types. Problem solving by searching and search techniques. Knowledge-based agents. Reasoning. First-order logic. Decision making. Learning.",
        "6319 Machine Learning (3-0).A survey of machine learning techniques, including traditional statistical methods, resampling techniques, model selection and regularization, tree-based methods, principal components analysis, cluster analysis, artificial neural networks, and deep learning. Implementing machine learning models with open-source software. Learning from data, finding underlying patterns useful for data reduction, feature analysis, prediction, and classification.",
        "6320 Data Mining (3-0).Algorithmic and practical aspects of discovering patterns and relationships in large databases. Hands-on experience in data analysis, clustering and prediction. Data preprocessing and exploration, data warehousing, association rule mining, classification and regression, clustering, anomaly detection, human factors and social issues in data mining.",
        "6321 Deep Learning (3-0).Introduction to neural networks. Feedforward multilayer neural networks. Convolutional neural networks, autoencoders, recurrent neural networks and long short-term memory models. Practical strategies to improve the performance of deep models, such as regularization, data augmentation, pre-training, dropout, multi-task learning and advanced optimization methods. Applications of deep learning.",
        "6322 Image Processing (3-0).Introduction to digital image processing techniques for enhancement, compression, restoration, reconstruction, and analysis. 2-D signals and systems, image analysis, image segmentation; achromatic vision, color image processing, color imaging systems, image sharpening, interpolation, decimation, linear and nonlinear filtering, printing and display of images; image compression, image restoration, and tomography.",
        "6323 Multimedia Systems (3-0).Introduction to multimedia, signals and waves, analog and digital data, sampling and quantization. Digital audio, data compression. Image data representation, image file formats. Video data and compression standards. Streaming multimedia. Multimedia data management systems.",
        "6325 Robotics (3-0).State-of-the-art robot systems, including their sensors and an overview of sensor processing. Robot control architectures. World modelling and world models. Localizing and mapping, navigation and control, motion planning, multiple-robot coordination.",
        "6330 Data Science (3-0).The fundamental concepts and applications of data science. Advanced tools and techniques for the extraction and utilization of information from data; making data-driven inferences and decisions; and effective communication results. Learning data manipulation, data analysis with statistics and advance machine learning algorithms, data communication with information visualization, working with big data using scalable processing techniques.",
        "6335 Big Data (3-0).Big data concepts, its differences from the traditional data and traditional data processing techniques. Storing, indexing, accessing and processing techniques for big data. Map/Reduce algorithm and related technologies. Data analysis and application development in big data ecosystem.",
        "6337 Semantic Web (3-0).Next generation web. Web of data and knowledgebases. Efficient management and use of web data. Metadata standards, XML, RDF, OWL and metadata processing; ontologies, semantic web applications.",
        "6338 Knowledge Engineering (3-0).Knowledge representation. Developing knowledge-based systems, intelligent applications and agents. Graph databases for semantic networks. Encoding and accessing knowledge on the Web. Using knowledgebases for automated reasoning and question answering.",
        "6352 Analysis of Algorithms (3-0).Analysis of algorithms for sorting, searching, sets, matrices, etc.; designing efficient algorithms for data structures, recursion, divide-and-conquer, dynamic programming; nondeterminism, NP-completeness and approximation algorithms.",
        "6370 Computer Game Development (3-0).Design and implementation of computer games, developing real-time graphics, audio and interactive multimedia programming techniques with an emphasis on performance, memory management, source code management, and game engine optimization.",
        "6371 Internship.This course is designed to familiarize students with the application of knowledge gained in course work and with operations and problems in the field of computer science. Students must be pursuing a Master’s degree in Computer Science. Approval of Instructor is required. Grading will be either pass or fail.",
        "6372 Advanced Computer Game Development (3-0).Game design. Rapid prototyping. Data structures and algorithms for games. Game pipeline processes, design patterns. High performance computing, GPU/parallel programming, algorithm design, cross-platform development, memory management. Network for games.",
        "6391 Research.Individual research for superior students in computer science. This study allows students to investigate a computer science problem, develop a new method, assess the solution, report and present the outcomes professionally. May be repeated for a total of six semester hours credit.",
        "6399 Project.A semester-long project conducted by the student individually under the guidance of an academic supervisor. This project gives students the chance to investigate a computer science topic possibly in the academic advisor’s research area, and develop a solution or software, and assess a problem computationally, report and present the outcomes professionally. Grading will be either pass or fail."
    ],
    "list_items": [
        "AcademicsAcademic ProgramsDepartmentsCollegesCoursesAcademic Calendar",
        "Academic Programs",
        "Departments",
        "Colleges",
        "Courses",
        "Academic Calendar",
        "About ASUHistoryCore ValuesNewsTraditionsAbout San AngeloWelcome from the PresidentMission Statement",
        "History",
        "Core Values",
        "News",
        "Traditions",
        "About San Angelo",
        "Welcome from the President",
        "Mission Statement",
        "Admissions & AidApply to ASUAdmitted StudentsRequest More InformationVisit Angelo State UniversityPaying for College",
        "Apply to ASU",
        "Admitted Students",
        "Request More Information",
        "Visit Angelo State University",
        "Paying for College",
        "Life on CampusLivePlayLeadWorkExplore",
        "Live",
        "Play",
        "Lead",
        "Work",
        "Explore",
        "CommunityASU Mayer MuseumAlumni AssociationSmall Business Development CenterWest Texas CollectionNatural History CollectionsKay Bailey Hutchison Center for Cyber Intelligence, Innovation, and Security StudiesLaura W. Bush Institute for Women’s HealthArts at ASUPlanetariumStephens ChapelRanch and Meat MarketASU Ticket OfficeSummer Camps and Conferences",
        "ASU Mayer Museum",
        "Alumni Association",
        "Small Business Development Center",
        "West Texas Collection",
        "Natural History Collections",
        "Kay Bailey Hutchison Center for Cyber Intelligence, Innovation, and Security Studies",
        "Laura W. Bush Institute for Women’s Health",
        "Arts at ASU",
        "Planetarium",
        "Stephens Chapel",
        "Ranch and Meat Market",
        "ASU Ticket Office",
        "Summer Camps and Conferences",
        "Give to ASUMake a GiftSignature EventsJoin",
        "Make a Gift",
        "Signature Events",
        "Join",
        "Athletics",
        "RamPort",
        "Library",
        "Bookstore",
        "Events",
        "Public Health Updates",
        "Administration",
        "Research",
        "Mental Health Services",
        "Title IX/Incident Report",
        "En Español",
        "Current Students",
        "Faculty & Staff",
        "Admitted Students",
        "Military",
        "Parents & Families",
        "Alumni",
        "Visitors",
        "School Counselors",
        "Online Students",
        "Computer Science Course Descriptions",
        "Career Opportunities",
        "Entertainment Computing Lab",
        "Code Camp",
        "Cybersecurity Summer Camp",
        "Contact Us",
        "For Current Students",
        "What’s New in Computer Science",
        "Computer Science Tutoring",
        "Advising",
        "2601 W. Avenue NSan Angelo, TX 76909",
        "1-800-946-8627",
        "Campus Map",
        "Contact ASU",
        "University Directory",
        "RamPort",
        "Jobs at ASU",
        "Facebook",
        "X",
        "Instagram",
        "YouTube",
        "©2024 Angelo State University",
        "All Rights Reserved",
        "Editor Login",
        "TTU System",
        "Texas Tech University",
        "TTU Health Sciences Center",
        "TTUHSC El Paso",
        "Midwestern State University",
        "ASU Privacy Policy",
        "Weather and Emergency Notifications",
        "Mental Health Services",
        "Title IX/Incident Report",
        "State of Texas",
        "Statewide Search",
        "Texas Homeland Security",
        "Texas Veterans Portal",
        "State Auditor’s Office",
        "Fraud Prevention",
        "Site Policies"
    ],
    "table_headers": [],
    "table_data": [],
    "captions": [],
    "links": [
        "#main-content",
        "/",
        "/academics/",
        "/academics/programs/",
        "/departments/",
        "/colleges/",
        "/courses/",
        "/current-students/registrar/academic_calendar.php",
        "/about-asu/",
        "/about-asu/history.php",
        "/about-asu/core-values/",
        "/about-asu/news/",
        "/about-asu/traditions/",
        "/about-asu/san-angelo.php",
        "/about-asu/president/",
        "/about-asu/mission-statement.php",
        "/admissions-and-aid/",
        "/admissions-and-aid/apply/",
        "/admissions-and-aid/admitted/",
        "/admissions-and-aid/info/",
        "/admissions-and-aid/visit/",
        "/admissions-and-aid/paying-for-college/",
        "/life-on-campus/",
        "/life-on-campus/live/",
        "/life-on-campus/play/",
        "/life-on-campus/lead/",
        "/life-on-campus/work/",
        "/life-on-campus/explore/",
        "/community/",
        "/community/mayer-museum/",
        "/alumni/",
        "/community/small-business-development-center/",
        "/community/west-texas-collection/",
        "/departments/biology/angelo-state-natural-history-collection/",
        "/community/kay-bailey-hutchison-center/",
        "/colleges/archer-college-of-health-and-human-services/laura-w-bush-institute-for-womens-health/",
        "/departments/visual-performing-arts/theatre/subscriptions.php",
        "/departments/physics-geosciences/planetarium/",
        "/community/stephens-chapel.php",
        "/community/asu-ranch/",
        "/community/ticket-office/",
        "/community/summer-camps-and-conferences/",
        "/give/",
        "/give/make_gift/",
        "/give/signature-events/",
        "/give/join/",
        "https://www.angelosports.com/",
        "https://ramport.angelo.edu/",
        "/library/",
        "http://bookstore.angelo.edu/",
        "/events/",
        "/public-health/",
        "/administrative-support/",
        "/research/",
        "/current-students/counseling-services/",
        "/current-students/title-ix/",
        "/en-espanol/",
        "/current-students/",
        "/faculty-and-staff/",
        "/admissions-and-aid/admitted/",
        "/active-duty-veterans/",
        "/parents-and-families/",
        "/alumni/",
        "/visitors/",
        "/school-counselors/",
        "/online/",
        "/departments/computer-science/",
        "/departments/computer-science/course-descriptions/computer-science.php",
        "/departments/computer-science/career-opportunities.php",
        "/departments/computer-science/ecl.php",
        "/departments/computer-science/code-camp.php",
        "/departments/computer-science/cybersecurity-summer-camp/",
        "/departments/computer-science/contact.php",
        "/departments/computer-science/whats_new.php",
        "/departments/computer-science/tutoring/",
        "/departments/computer-science/advising.php",
        "/",
        "/departments/",
        "/departments/computer-science/",
        "/courses/",
        "tel:18009468627",
        "/map/",
        "/contact/",
        "/directory/",
        "https://ramport.angelo.edu/",
        "/work-at-asu/",
        "https://www.facebook.com/angelostateuniversity",
        "https://twitter.com/AngeloState",
        "https://www.instagram.com/angelostate/",
        "https://www.youtube.com/user/AngeloStateU",
        "/livewhale/?login&referer=1",
        "http://www.texastech.edu/",
        "https://www.ttu.edu/",
        "https://www.ttuhsc.edu/",
        "https://elpaso.ttuhsc.edu/",
        "https://msutexas.edu/",
        "https://apps.highered.texas.gov/resumes/",
        "/privacy_policy.php",
        "/emergency-notifications/",
        "/current-students/counseling-services/",
        "/current-students/title-ix/",
        "https://www.texas.gov/",
        "https://www.tsl.texas.gov/trail/index.html",
        "https://gov.texas.gov/organization/hsgd",
        "https://veterans.portal.texas.gov/",
        "https://sao.fraud.texas.gov/",
        "/administrative-support/audit-services/fraud_prevention.php",
        "/site-policies/"
    ],
    "tables": []
}