{
    "file_name": "sites-registered-student-organizations.html",
    "title": "Registered Student Organizations  · Angelo State University",
    "description": "Discover Angelo State’s registered student organizations and get involved in campus life by joining groups that match your interests and enhance your colle...",
    "meta_tags": {
        "viewport": "width=device-width, initial-scale=1",
        "generator": "LiveWhale",
        "og:title": "Registered Student Organizations",
        "og:type": "website",
        "og:url": "https://www.angelo.edu/life-on-campus/lead/registered-student-organizations/",
        "pagename": "Registered Student Organizations",
        "og:description": "Discover Angelo State’s registered student organizations and get involved in campus life by joining groups that match your interests and enhance your colle...",
        "description": "Discover Angelo State’s registered student organizations and get involved in campus life by joining groups that match your interests and enhance your colle...",
        "og:image": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "og:image:secure_url": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "og:image:width": "1260",
        "og:image:height": "630",
        "twitter:card": "summary_large_image",
        "twitter:title": "Registered Student Organizations",
        "twitter:description": "Discover Angelo State’s registered student organizations and get involved in campus life by joining groups that match your interests and enhance your colle...",
        "twitter:image": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "lw-template-updated": "02/16/2022 02:04pm CST"
    },
    "headings": [
        "Quick Links",
        "Information For",
        "Student Organizations",
        "Find a Student Organization",
        "Find student organizations on this page.",
        "Tags",
        "Active Minds",
        "Alpha Chi Iota Chapter",
        "Alpha Phi",
        "Alpha Sigma Phi",
        "American Chemical Society Local University Chapter",
        "Angelo State Culture Exchange",
        "Angelo State Mathematical Association of America",
        "Angelo State Shotgun Sports",
        "Angelo Student Physical Therapy Association",
        "Arnold Air Society - Air Force ROTC",
        "Association for Computing Machinery",
        "Association of Mexican-American Students",
        "Baile Folkorico: Danza de Oro",
        "Baptist Student Ministry",
        "Bass Anglers at ASU",
        "Beta Alpha Psi",
        "Beta Beta Beta",
        "Block and Bridle Club",
        "Burmese Student Association",
        "Cambodian Student Association",
        "Catholic Newman Center",
        "Chi Alpha Christian Fellowship",
        "Club Tennis",
        "College Hills College Ministry",
        "Council for Exceptional Children",
        "Counseling Psychology Graduate Student Organization",
        "Creative Writing Club",
        "Criminal Justice Student Association",
        "Delta Sigma Pi",
        "Delta Zeta",
        "English Peer Tutoring for International Students",
        "For His Glory",
        "Fostering Ram Success Organization",
        "Game Club",
        "Geological Exhibition Organization",
        "Graphic Design Club",
        "Green Action Club",
        "Handball Club",
        "Health Science Society",
        "History Society",
        "Honors Student Association",
        "i5",
        "Kappa Delta Pi",
        "Kappa Delta Rho",
        "Kappa Sigma",
        "Korean Student Association",
        "Lambda Chi Alpha",
        "Law Enforcement Club",
        "Meat and Food Science Association",
        "Men’s Volleyball Club",
        "Mosaic Campus Ministry",
        "National Association for the Advancement of Colored People (NAACP)",
        "Needlework Club",
        "Pagan Society",
        "Panhellenic Association",
        "PAWS-itive Rams",
        "Philosophy Club",
        "Pi Kappa Alpha Fraternity",
        "Pro-Life Rams",
        "Psi Chi",
        "Psychology Club",
        "Ram Golf",
        "Ram Powerlifting Club",
        "Ram Rugby Football Club",
        "RAMbassadors",
        "Rambelle Rugby",
        "Ramgineers",
        "Rampowerment",
        "Rams & Rockets",
        "Rams for Christ",
        "Rams Plus",
        "Rams Ultimate Frisbee",
        "Recruiting Ag Majors",
        "Russian Club",
        "San Angelo Business Ambassadors",
        "Sigma Kappa Sorority",
        "Sigma Tau Delta",
        "Society of Physics Students",
        "Society of Women Engineers (SWE)",
        "Spanish Club",
        "Special Olympics Unified Sports",
        "Star Wars Club (S.W.C.)",
        "Student Government Association",
        "Student Nurses’ Association",
        "Student Professional Development Club",
        "Student Social Work Association",
        "Student Sociological Association",
        "Student Veterans Organization",
        "Technical Communication Club",
        "The Net",
        "Turning Point USA",
        "Turning Point USA",
        "United States Institute for Theatre Technology",
        "University Center Program Council",
        "Vietnamese Student Association",
        "Women in Physics (WiP)",
        "Women’s Health Club",
        "Young Life at Angelo State University",
        "Questions? Contact Us!",
        "Quick Links"
    ],
    "paragraphs": [
        "Discover who you are meant to be.",
        "Joining a student organization is an excellent way to meet people, as well as gain experience with other skills not directly taught in the classroom. Our Registered Student Organizations, or RSOs, are incredibly active across campus.",
        "Whether you’re interested in an academic or spiritual group, want to get involved in a club sport, or just simply want to find people who have similar interests as you, there’s something for everyone at Angelo State.",
        "Explore our over 100 RSOs just waiting for you to get involved! If you don’t see one that peaks your interest, you do have the option ofstarting a new RSO.",
        "As you type, results will be filtered and your search term will be highlighted below.",
        "Purpose:",
        "To increase the awareness of the students, faculty, and staff at our school about the following:",
        "Purpose:",
        "The purpose of the Texas Alpha Iota Chapter of Alpha Chi shall be the stimulation and recognition of scholarship and those elements of character that make scholarship effective for good.",
        "Purpose:",
        "The objects are the promotion of growth in character, unity of feeling, sisterly affection, and social communion among our members. In all that we do, we try to obey God’s principles of justice and right. We have banded ourselves together to improve our minds and hearts, and we seek to aid each other through a constant watchcare always given in love. We believe ourselves to be sincere searchers for truth. We seek the highest ideal of womanhood, and we try to gain this ideal by cultivating not only the power and passion for seeking intellectual development but also the spirit of love and charity. And we who are thus united are under a solemn pledge to lend a helping hand to one another.",
        "Purpose:",
        "To Better the Man through the creation and perpetuation of brotherhood founded upon the values of character: Silence, Charity, Purity, Honor and Patriotism.",
        "Purpose:",
        "To provide an opportunity for science-oriented students to become better acquainted with all aspects concerning the field of chemistry and biochemistry as it relates to the Department of Chemistry and Biochemistry at ASU. These aspects shall include recent advances in research, establishing relationships with science faculty and students at ASU, and developing a professional pride in chemistry and biochemistry.",
        "Purpose:",
        "The purpose of The Culture Exchange at Angelo State University shall be to:",
        "Purpose:",
        "To promote the enjoyment of practicing mathematics and in thinking mathematically; to foster curiosity, thinking, understanding, and facilitation of mathematical concepts, ideas, and techniques; to promote camaraderie in the mathematical community; to assist students in achieving their career goals, and to provide a forum in which to accomplish the above purposes.",
        "Purpose:",
        "To build a community-based organization within ASU for students with a common interest in clay target shooting. Activities may include but are not limited to: shoot trap, skeet, and clays, charity shoots, competitive shoots, promoting gun safety, instilling marksmanship, volunteer work and fundraising.",
        "Purpose:",
        "To discuss and study the methods of physical therapy; provide and stimulate leadership among graduate students, faculty, and staff engaged or interested in physical therapy; maintain and improve the professional standards of physical therapy; serve as campus clearinghouse for information pertaining to students, faculty, or staff interested in physical therapy; stimulate creative and experimental techniques in physical therapy; promote research in the field of physical therapy and present it to the organization and the community; and enhance the role of physical therapy for the campus community.",
        "Purpose:",
        "To aid in the development of Air Force and Space Force officers; to create a closer and more efficient relationship within the Air Force and Space Force officer training program; to support the role and tradition of the United States Air Force and Space Force; to advance air and space age citizenship, and promote the purpose and goals of ASU.",
        "Purpose:",
        "The purpose of The ACM Student Organization shall be to:",
        "Purpose:",
        "To engage in projects which the membership considers to be in the best interests of the students attending Angelo State University and in the overall community of San Angelo, Texas including, but not limited to: assist students to adjust to the academic and social aspects of college life; emphasize the study and appreciation of Mexican-American contributions to American society; encourage group unity among students; and encourage participation in AMAS from among all students attending ASU.",
        "Purpose:",
        "Purpose:",
        "To relate the individual student properly to his church and denomination during college and provide church/denominational leaders with a direct access to students and vice versa; promote spiritual and moral growth of the individual student through a campus program that complements the church; to present a positive Christian witness to the campus and community by (a) introducing spiritual and moral matters into every area of campus life and (b) stimulating evangelism through personal soul-winning and organized efforts; reach the total student constituency and enlist all who want to be part of its organization and activities; balance Christian personalities and remove all roadblocks to a deeper and spiritual and intellectual affirmation of faith; discover and train Christian leadership for the church, denomination, community, nation, and world; and promote stewardship and missions by (a) assisting with missionary and stewardship education, (b) foster the enlistment, training, and conserving of student volunteers for mission services, and (c) promoting total life stewardship and developing “World Citizens.”",
        "Purpose:",
        "To provide a social environment for students interested in tournament bass fishing; hold tournaments for the organization members; conduct meetings to discuss club news; and participate in intercollegiate bass fishing tournaments.",
        "Purpose:",
        "Beta Alpha Psi is an honorary and professional organization for accountancy, finance, and Business Analytics or Digital Technology students. Its stated purpose includes recognition of outstanding academic achievements in the field of accounting, finance, and Business Analytics or Digital Technology; promotion of the study and practice of accounting, finance, and Business Analytics or Digital Technology; provision of opportunities for self-development and association among members and financial information professionals; and encouragement of a sense of ethical, social, and public responsibility. The organization seeks to develop its members’ professionalism through career-oriented, social, and community activities.",
        "Purpose:",
        "To function as an honor and professional society for students of the biological sciences. Its activities shall be designed to stimulate interest, scholarly attainment, and investigation in the biological sciences and to promote the dissemination of information and new interpretations among students of the life sciences.",
        "Purpose:",
        "To promote a higher scholastic standing among the students of animal agriculture; to bring about a closer relationship among the men and women pursuing some phase of animal agriculture as a profession, and to promote all phases of animal agriculture by the students of ASU.",
        "Purpose:",
        "Provide well-being support for Burmese students attending Angelo State University. As well as share Burmese culture with the Angelo State University community.",
        "Purpose:",
        "Purpose:",
        "Dedicated to the spiritual enrichment of our campus and in particular to the spiritual, intellectual, and social needs of Catholic students, choosing as our patron John Henry Cardinal Newman, whose goal was the development of students, Catholics in religious belief and dedication to the quest for truth.",
        "Purpose:",
        "To fulfill the Great Commission by (1) sharing the Good News of salvation through Christ with the Angelo State community, (2) discipling Christians in all aspects of the Christian faith so they are equipped to lead lives that glorify and honor God, (3) providing opportunities for fellowship, discussion, prayer, and Biblical training regarding the needs of students and the issues they face, and (4) providing students a link to the local church.",
        "Purpose:",
        "Purpose:",
        "Purpose:",
        "The purpose of this chapter shall be to advance the education of individuals with exceptionalities and to promote related educational, scientific, and charitable purposes. Specifically, the chapter intends to assist and provide support to The Council for Exceptional Children (CEC) in all its efforts on behalf of persons with exceptionalities. and to participate in all appropriate governance activities of CEC subject to the general supervision and control of CEC.",
        "Purpose:",
        "Purpose:",
        "Purpose:",
        "To develop our students’ ties between the Faculty and Community Advisors by providing vast opportunities for career services, networking, special events, and opportunities to connect with and inspire future and current students. And, to adhere to each individual future goal, so that our students feel welcomed and valued as a member of this association. Our mission as a whole is to provide the students here at Angelo State University with the means to a successful future by leading them down the right path.",
        "Purpose:",
        "To foster the study of business in universities; to encourage scholarship, social activity, and the association of students for their mutual advancement by research and practice; to promote closer affiliation between the commercial world and students of commerce, and to further a higher standard of commercial ethics culture and the civic and commercial welfare of the community.",
        "Purpose:",
        "The object of this sorority shall be to unite its members in the bonds of sincere and lasting friendship, to stimulate one another in the pursuit of knowledge, to promote the moral and social culture of its members, and to develop plans for guidance and unity in action; objects worthy of the highest aim and purpose of associated effort.",
        "Purpose:",
        "To discuss and study the most effective methods in guiding members to enhance English skills with understandings and approaches that executive officers have; to create an environment for members to participate and enjoy learning English; to give executive officers an experience to teach non-native speakers; to promote members to speak freely during the sessions; to improve nervousness in speaking English and develop confidence by conversing and presenting; to stimulate cultural exchange between tutors and members of the group.",
        "Purpose:",
        "For His Glory is a women’s ministry dedicated to strengthening your relationship with God. We desire to see friendships form, pasts restored, faith emboldened, and hearts set free in Jesus. We serve together, grow together, and live life alongside each other. We are a community built on love, authenticity, humility, and grace; always encouraging one another to seek the heart of God. We exist for His glory.",
        "Purpose:",
        "Purpose:",
        "To Establish friendships with peers that share a common interest.",
        "Purpose:",
        "To discuss the study of geology and how it affects us; conduct research projects related to different aspects of geology, including field trips; provide and stimulate leadership among all persons engaged in geology; serve as a campus clearinghouse for information pertinent to students, faculty, and staff interested in geology and the geology minor offered at ASU.",
        "Purpose:",
        "Purpose:",
        "The purpose of this GAC shall be to:",
        "Purpose:",
        "To establish and promote handball at Angelo State University; promote and stimulate the fitness component of handball; increase student sports involvement and intercollegiate competition; serve as a campus clearinghouse for information pertinent to students, faculty, and staff interested in handball; stimulate creative and experimental techniques for handball; promote research in the field of handball; and enhance the role of handball for the campus community.",
        "Purpose:",
        "To encourage members to keep their grades up, be involved in the community through various places, and participate. Provide and stimulate leadership among all persons engaged in Health Science.",
        "Purpose:",
        "The purpose of the History Society is to provide an environment for historical discussion designed to gather people with a variety of perspectives on the world. The History Society shall engage people in historical ways of thinking through collaborative exchanges of thoughts and ideas.",
        "Purpose:",
        "To provide honors students with a platform for meeting and discussing ideas with those who share the same academic interests; create a closer relationship among all students of the Honors Program pursuing academic excellence, and promote the organization through the development of a program of activities involving the university and local community.",
        "Purpose:",
        "Purpose:",
        "To promote a closer bond among students of education; to encourage them to enter into more intimate fellowship with those dedicated to the cause of teaching as a profession for which specialized preparation is deemed imperative; to foster high standards of preparation for teaching, and to invite into bonds of fellowship those who have attained excellence of scholarship and distinction of achievement as students and servants of education.",
        "Purpose:",
        "To promote good fellowship among its members and the advancement of truth, justice, and virtue. This chapter shall abide by the rules and Constitution of the National Fraternity of Kappa Delta Rho, Inc. it shall provide a source of identity, and if properly led, a source of dignity for every member. The Fraternity will be a significant force in preparing its members for the challenges of the complex life they will face. The Fraternity clearly recognizes the need for scholastic achievement, intellectual honesty, community service, and personal and group fiscal responsibility. The Eta Gamma Chapter accepts the opportunity of contributing to the general education of its members.",
        "Purpose:",
        "The purpose of Kappa Sigma is to achieve the total development of a better man: academically, culturally, civically, and as a successful leader and role model to others. Kappa Sigma provides strong scholarship support, self-improvement opportunities, and an active social life for brothers.",
        "Purpose:",
        "The purpose of this organization shall be to encourage all Korean Students who are attending Angelo State University. Our organization will help all Korean Students adjust and focus on their academic life at Angelo State University. The second purpose is to expand Korean students’ rights and benefits. As the number of Korean students has increased, it is necessary to establish a Korean Student Association. Additionally, the KSA will make general contributions to informing Korean culture.",
        "Purpose:",
        "To build up the membership, ideals, spirits, organization, and the physical equipment of this chapter so that affiliation therewith shall ever be regarded as an honor and privilege of which only the finest men are worthy; foster a spirit of genuine brotherhood among its members; make welcome within its home all members and associate members in good standing of other Zetas who visit; do all within its power to increase the friendly bond between the chapters; develop as much as possible a universal consciousness of fraternalism; emphasize the fact that its badge and ritual are sacred, that membership is for life, and that its brotherhood is universal within this membership; and make good men great and great men excellent.",
        "Purpose:",
        "To better prepare members for employment with Federal, State, and local agencies. In the law enforcement club, members will be educated and involved in police operations, gain their interest in law enforcement careers, plan and coordinate educational and networking opportunities with external groups, and raise awareness of law enforcement’s role in society. Members will receive “basic” training from multiple agencies in all phases of law enforcement, including criminal law, traffic law, criminal investigation, crime prevention, crime scene investigation, traffic control, accident investigation, dispatch, records, and other related fields.",
        "Purpose:",
        "To promote a higher scholastic standing of students pursuing a degree in animal science with a focus on meat science and/or food science. Research performed at the Food Safety and Product Development Laboratory allows for hands-on opportunities and exposure to numerous processes, such as harvesting, fabrication, and the manufacture of case-ready products. It also provides a research laboratory for microbiological testing of these foodstuffs. Distribution of manufactured goods to the public through catering or the “in house” store grants students introduction and prospective opportunities with contacts in the agricultural field, as well as, publicizes Angelo State University.",
        "Purpose:",
        "The purpose of this Club shall be to give students the opportunity to participate in a competitive sport while creating a brotherhood and lasting friendships through men’s volleyball by providing an environment that promotes personal and professional growth in young men.",
        "Purpose:",
        "Purpose:",
        "The college chapter shall be affiliated with the Association and shall subscribe to the general policies and programs of the Association. The purpose and aims of the ASUNC College Chapter of the National Association for the Advancement of Colored People shall be to improve the political, educational, social, and economic status of minority groups; to eliminate racial prejudice; to keep the public aware of the adverse effects of racial discrimination; and to take all lawful action to secure its elimination, consistent with the efforts of the national organization and in conformity with the Articles of Incorporation of the Association, its Constitution and by-laws and as directed by the National Board of Directors. Objectives shall be to inform students of the problems affecting Blacks and other minority groups; to advance the economic, educational, social and political status of Black people and other minority groups and their harmonious cooperation with other people. To stimulate an appreciation of the Black man’s contribution to civilization. To develop intelligent, militant, effective leadership.",
        "Purpose:",
        "The NWC shall be to:",
        "Purpose:",
        "Purpose:",
        "To develop and maintain fraternity life and interfraternity relations at a high level of accomplishment; to consider the goals and ideals of member groups as continually applicable to campus and personal life; to cooperate with member fraternities and the university administration in concern for and maintenance of fine social and moral standards; and to promote superior scholarship as basic to intellectual achievement.",
        "Purpose:",
        "Purpose:",
        "To provide members with a setting in which they can discuss philosophical topics and increase their knowledge in a reasonable and enjoyable way.",
        "Purpose:",
        "Pi Kappa Alpha is dedicated to developing men of integrity, intellect and high moral character and to fostering a truly lifelong fraternal experience; to recruit the best men; we will take these men and mold them into men of integrity, into Pikes. We will at all times uphold the values of Pi Kappa Alpha. Not only will we always be the most predominant and all-around best fraternity on our campus, but we will establish and maintain a reputation of excellence throughout all chapters of Pi K A. We are scholars, leaders, athletes and gentlemen.",
        "Purpose:",
        "To discuss and study when life begins and ends and why life is important; provide and stimulate leadership among all persons engaged in the Pro-Life movement; serve as a campus clearinghouse for information pertinent to students, faculty, and staff interested saving innocent lives; promote research in the field of abortion, in vitro fertilization, embryonic stem cell research, and euthanasia; and save innocent lives by transforming hearts.",
        "Purpose:",
        "To encourage, stimulate and maintain excellence in scholarship, and advance the science of psychology; to provide academic recognition to its inductees; to nourish and stimulate professional growth through programs designed to augment and enhance the regular curriculum; and to provide practical experience and fellowship through affiliation with the chapter.",
        "Purpose:",
        "To discuss and study different branches of psychology; provide and stimulate leadership among all persons studying psychology; learn and promote professional standards of the field of psychology; provide information pertinent to students, faculty, and staff interested in psychology on campus; promote research in the field of psychology, and enhance the role of psychology for the campus and greater community.",
        "Purpose:",
        "Purpose:",
        "To complete strength training and compete in powerlifting meets; provide and stimulate leadership among all persons engaged in powerlifting, and maintain and improve professional standards of powerlifting.",
        "Purpose:",
        "To introduce and promote the sport of rugby, as recognized by the U.S. Rugby Football Union, to the campus of ASU; to teach and enhance rugby rules and skills to the students involved; to improve the member’s overall physical being; to instill the exhibition of good sportsmanship; to represent ASU in a competitive manner in rugby sporting events, and to offer each member the chance to improve leadership skills by democratically being chosen to serve in leadership positions.",
        "Purpose:",
        "RAMbassadors is a volunteer leadership program housed in the Office of Admissions. Our goal is to create leaders for Angelo State University (ASU), give back to the ASU community, and inspire the student body to be their best selves. Through the RAMbassadors program, students learn professional skills to benefit them in their future careers. Our students learn time management, communication, customer service, marketing, interpersonal, and leadership skills. The RAMbassador program is unique in that we also contribute to the recruitment efforts of Angelo State University. RAMbassadors oftentimes are the first interaction a prospective student has with ASU.  The impression a RAMbassador makes on a student can make a lasting effect on that student’s decisions. RAMbassadors work all large-scale recruitment events and serve as the student voice to future RAMS. Our future ram recruits benefit from hearing first-hand student experience, while our RAMbassadors grow in their leadership and professional skills.",
        "Purpose:",
        "To unite women of many diversities to play rugby. To offer and promote leadership and camaraderie to women interested in rugby and to uphold the laws of the International Rugby Board. To engage female students of Angelo State University in campus organizations. To inspire persistence, dedication, and responsibility in not only Rambelle Rugby, but in academics while attending Angelo State University. To encourage tradition and enhance the support of rugby in the San Angelo Community.",
        "Purpose:",
        "To discuss study and research methods of applied engineering and engineering theory.",
        "Purpose:",
        "Purpose:",
        "Purpose:",
        "To be, or exist, for Christ—that is to encourage each student to love God with all their heart, soul, mind, and strength and to love their neighbors as they should love themselves; foster a community made up of authentic Christian relationships that encourage one another to submit their lives to Jesus Christ as Lord; serve the students of Angelo State University, aiming to help them grow in all areas of life during their college experience, especially spiritually; and positively contribute to student life and maintain an excellent relationship with the university and its students, faculty, and employees.",
        "Purpose:",
        "The purpose of this organization shall be to create an atmosphere where LGBTQ+ and ally students feel comfortable to be themselves and share their feelings and experiences. To have fun, socialize and create a community where everyone feels welcome and included. To generate respectful discussion around LGBTQ+ issues at ASU and worldwide.",
        "Purpose:",
        "To educate students on the rules of Ultimate Frisbee; provide a recreational opportunity on the ASU campus for both experienced and new players; promote techniques, movements, and sportsmanship within the game; and to develop and prepare members for competitions against other institutions.",
        "Purpose:",
        "To promote the Department of Agriculture at Angelo State University; travel to Texas high schools, conferences, and professional meetings recruiting new students to Angelo State University; and increasing awareness of the university among the general public.",
        "Purpose:",
        "To discuss and study the most effective methods of studying the Russian language; to provide and stimulate leadership; to maintain and improve proficiency levels; to serve as a campus center for the discussion of Russian history, culture, politics, and economics; to enhance the role of the study of the Russian language for the campus community; and to provide an opportunity to meet and interact with visiting persons and organizations from Russia.",
        "Purpose:",
        "Purpose:",
        "To unite its members in a bond of sincere friendship for the development of character and the promotion of social and intellectual culture; to support and further the program and objectives of ASU; to strive for high standards of achievement - scholastically, socially, culturally, and spiritually; and to make a constructive contribution to the communities by encouraging the exercise of the rights and obligations of good citizens and the support of worthwhile civic, social and philanthropic projects.",
        "Purpose:",
        "To encourage creative and critical writing; promote community interest; provide cultural stimulation; and give recognition for high achievement in undergraduate, graduate, and professional studies in English language and literature.",
        "Purpose:",
        "To promote the advancement and diffusion of knowledge of physics and the encouragement of interest in physics throughout the academic and local communities; provide pathways for students to interact with the professional community, and participate in professional development.",
        "Purpose:",
        "The purpose of this WIE shall be to:",
        "Purpose:",
        "To learn the Spanish language; conduct regular sessions of conversational Spanish; promote appreciation and understanding of Hispanic culture; and provide students and faculty an opportunity to benefit from local Hispanic culture and language.",
        "Purpose:",
        "Purpose:",
        "Purpose:",
        "To increase the educational values of student life; to strengthen the unity of purpose among the students, administration of ASU; to broaden the representative character of student government; to realize more fully in our student affairs the concepts and practices of efficient and dynamic democracy.",
        "Purpose:",
        "To introduce the responsibility for contributing to nursing education in order to provide for the highest quality health care. Provide programs representative of fundamental and current professional interest and concerns. Aid in the development of the whole person, and his/her professional role, and his/her responsibility for the health care of people in all walks of life.",
        "Purpose:",
        "To provide and stimulate leadership among all students engaged in professional development, especially those interested in the sport, recreation, fitness, and coaching, and related areas; develop professional/personal knowledge and skills needed for entry into the professional world through participation at local, state, and national conferences, activities, clinics, and workshops; enhance the role of professional development for the campus student community; maintain and improve professional standards of professionalism; and develop and learn to utilize networks and professional relationships.",
        "Purpose:",
        "To facilitate camaraderie among students who desire to support the mission and values of the social work profession. Additionally, the association is the primary conduit for social work students to have input on the continued development and refinement of the Social Work Program at Angelo State University.",
        "Purpose:",
        "To create opportunities for students to connect with other Sociology students, engage in service in the ASU and San Angelo communities, and provide volunteer opportunities that will contribute to the Sociology coursework and experience. Sociology may be defined as a perspective and an academic social/behavioral science that examines humans as social beings; who are a product of social interaction, socialization, and social patterns. Sociology concerns itself with the nature of the human being, and the meaning and basis of social order. Sociology focuses on social organization, social institutions, social interaction, and social problems.",
        "Purpose:",
        "To assist student veterans as they make the transition from service member to civilian to student by distributing information, including all forms, documents, lists of organizations and contact information useful for veterans and their families; promote healthy interactions with fellow veterans and students both on and off campus, by way of social gatherings and community activities; provide special services designed to assist disabled veterans; hold various veteran outreach activities to provide direct services to veteran’s families, including those deployed and the families who await their return; and educate the college community about the special experiences, circumstances, strengths, and needs of the military veteran and their families.",
        "Purpose:",
        "To provide educational opportunities for majors and minors in technical and business writing at Angelo State University; allow majors and minors in technical and business writing at Angelo State University opportunities to network with other students in similar majors at other universities and in business and industry; will provide programs and activities and participate in service projects that will benefit members of the club, the university, and the community.",
        "Purpose:",
        "To serve the study body in as many areas as possible; provide avenues for students to share beliefs and ideas with one another; provide an environment where students can build relationships with other students on campus; and give students an opportunity to experience a relationship with Jesus Christ.",
        "Purpose:",
        "To Encourage political involvement and provide educational materials, including, but not limited to: copies of the United States Constitution and the Amendments to the United States Constitution.",
        "Purpose:",
        "This chapter shall implement the purposes of USITT as stated in Chapter 2, Section 1 of the bylaws of USITT and shall encourage the performing arts as a right rather than a privilege for all the people of Texas and especially the San Angelo Area: therefore, we will encourage and stimulate the finding of performing artists, and the creation of production facilities and audiences in the state of Texas and particularly in our immediate area and throughout the Angelo State University community.",
        "Purpose:",
        "To plan, present, and evaluate cultural, educational, social, and recreational programs for the students of ASU, and the ASU and San Angelo communities; promote the best interests of the university; provide an opportunity for students to develop leadership skills and apply the principles learned in their academic studies; and formulate and recommend to the University Center Board policies relating to UCPC programming.",
        "Purpose:",
        "The purpose of the Vietnamese Student Association (VSA) shall be to bring awareness to the Vietnamese culture, history, and heritage to the campus, as well as to deepen our own understanding of it. Through our work, we hope to build cross-cultural bridges to all students, no matter race, color, nationality, or ethnicity, including our present and upcoming Vietnamese students. We understand that being far aware from our most loved ones can be stressful, however, our goal is to be able to create a supportive community for members to network, share common interests and tips for a “journey away from home.”",
        "Purpose:",
        "We, the members of WiP, are united in our desire to:",
        "Purpose:",
        "Purpose:",
        "To introduce adolescents to Jesus Christ and help them grow in their faith through the following methods: praying for young people; going where kids are; building personal relationships with them; winning the right to be heard; providing experiences that are fun, adventurous and life-changing; sharing our lives and the Good News of Jesus Christ with adolescents; inviting them to personally respond to this Good News; loving them regardless of their response; nurturing kids so they might grow in their love for Christ and the knowledge of God’s Word and become people who can share their faith with others; helping young people develop the skills, assets and attitudes to reach their full God-given potential; encouraging kids to live connected to the Body of Christ by being an active member of a local congregation; and working with a team of like-minded individuals, such as volunteer leaders, committee members, donors and staff.",
        "Student Life325-942-2062organizations@angelo.eduHouston Harte University Center, Room 001",
        "Hazing Statement",
        "RSO Advisors",
        "Funding for RSO’s",
        "Renewing a Student Organization"
    ],
    "list_items": [
        "AcademicsAcademic ProgramsDepartmentsCollegesCoursesAcademic Calendar",
        "Academic Programs",
        "Departments",
        "Colleges",
        "Courses",
        "Academic Calendar",
        "About ASUHistoryCore ValuesNewsTraditionsAbout San AngeloWelcome from the PresidentMission Statement",
        "History",
        "Core Values",
        "News",
        "Traditions",
        "About San Angelo",
        "Welcome from the President",
        "Mission Statement",
        "Admissions & AidApply to ASUAdmitted StudentsRequest More InformationVisit Angelo State UniversityPaying for College",
        "Apply to ASU",
        "Admitted Students",
        "Request More Information",
        "Visit Angelo State University",
        "Paying for College",
        "Life on CampusLivePlayLeadWorkExplore",
        "Live",
        "Play",
        "Lead",
        "Work",
        "Explore",
        "CommunityASU Mayer MuseumAlumni AssociationSmall Business Development CenterWest Texas CollectionNatural History CollectionsKay Bailey Hutchison Center for Cyber Intelligence, Innovation, and Security StudiesLaura W. Bush Institute for Women’s HealthArts at ASUPlanetariumStephens ChapelRanch and Meat MarketASU Ticket OfficeSummer Camps and Conferences",
        "ASU Mayer Museum",
        "Alumni Association",
        "Small Business Development Center",
        "West Texas Collection",
        "Natural History Collections",
        "Kay Bailey Hutchison Center for Cyber Intelligence, Innovation, and Security Studies",
        "Laura W. Bush Institute for Women’s Health",
        "Arts at ASU",
        "Planetarium",
        "Stephens Chapel",
        "Ranch and Meat Market",
        "ASU Ticket Office",
        "Summer Camps and Conferences",
        "Give to ASUMake a GiftSignature EventsJoin",
        "Make a Gift",
        "Signature Events",
        "Join",
        "Athletics",
        "RamPort",
        "Library",
        "Bookstore",
        "Events",
        "Public Health Updates",
        "Administration",
        "Research",
        "Mental Health Services",
        "Title IX/Incident Report",
        "En Español",
        "Current Students",
        "Faculty & Staff",
        "Admitted Students",
        "Military",
        "Parents & Families",
        "Alumni",
        "Visitors",
        "School Counselors",
        "Online Students",
        "Registered Student OrganizationsStarting a New Student OrganizationRenewing a Student OrganizationRSO AdvisorsFunding for RSOsFinancial ResourcesRisk Management Training",
        "Starting a New Student Organization",
        "Renewing a Student Organization",
        "RSO Advisors",
        "Funding for RSOs",
        "Financial Resources",
        "Risk Management Training",
        "Greek LifeFraternitiesRecruitment RulesSororitiesAlpha ClassHazing StatementGreek Life FundingOrder of Omega",
        "FraternitiesRecruitment Rules",
        "Recruitment Rules",
        "Sororities",
        "Alpha Class",
        "Hazing Statement",
        "Greek Life Funding",
        "Order of Omega",
        "ASU Cheer and MascotsCheer Tryout InformationCheer Prep ClinicsFormsMascot Interest ApplicationCheerleading Request FormRoscoe and Bella Mascot Request FormCheer Judge RequestMeet the Cheer Team",
        "Cheer Tryout Information",
        "Cheer Prep Clinics",
        "FormsMascot Interest ApplicationCheerleading Request FormRoscoe and Bella Mascot Request FormCheer Judge Request",
        "Mascot Interest Application",
        "Cheerleading Request Form",
        "Roscoe and Bella Mascot Request Form",
        "Cheer Judge Request",
        "Meet the Cheer Team",
        "Angelettes Dance Team",
        "ASU Rodeo",
        "Angelo State Shotgun SportsClays on the Concho",
        "Clays on the Concho",
        "Student Government AssociationSGA InitiativesStudent Discount ProgramRam Family Student CampaignSGA Executive Officers and SenatorsSGA Elections",
        "SGA InitiativesStudent Discount ProgramRam Family Student Campaign",
        "Student Discount Program",
        "Ram Family Student Campaign",
        "SGA Executive Officers and Senators",
        "SGA Elections",
        "RAMbassadors",
        "Ram Transition Leaders",
        "University Center Program Council (UCPC)",
        "Community ServiceCommunity Service Hours SubmissionVolunteer OpportunitiesVolunteer Mailing ListVolunteer Request Form",
        "Community Service Hours Submission",
        "Volunteer Opportunities",
        "Volunteer Mailing List",
        "Volunteer Request Form",
        "Rammys",
        "Who’s Who",
        "President:Emery McDowell,emcdowell@angelo.edu",
        "Advisor:Drew Curtis",
        "Organization Email:activeminds@angelo.edu",
        "Meeting Date & Time:TBD",
        "Location:TBD",
        "Issues surrounding mental health",
        "Symptoms related to mental health disorders",
        "Mental health resources available both on campus and in the surrounding community",
        "Reducing stigma surrounding mental health disorders so that students will feel more comfortable openly discussing mental-health related issues and seeking help when it is needed",
        "Supporting peers to find the skills and resources they need to increase healthy coping techniques that promote personal wellness",
        "Providing a forum and building an open environment for all students to speak up about mental health",
        "President:Kaci Wainscott,Kwainscott@angelo.edu",
        "Advisor:Karl Havlak",
        "Meeting Date & Time:TBD",
        "Location:TBD",
        "President:Kylee Sollis,ksollis@angelo.edu",
        "Advisor:Stephanie May",
        "Meeting Date & Time:Monday at 6:30 p.m.",
        "Location:CARR 101",
        "President:JaRon Levingston,jlevingston@angelo.edu",
        "Advisor:Landri Ognowski",
        "Meeting Date & Time:Sundays at 7 p.m.",
        "Location:Vincent Room, TBD",
        "President:Christina McDowell,cmcdowell3@angelo.edu",
        "Advisor:Saravan Ramasamy",
        "Meeting Date & Time:Tuesdays at 5:30 p.m.",
        "Location:Cavness Building, Room 200",
        "President:Adrianna Palacios,apalacios5@angelo.edu",
        "Advisor:Dr. Won-Jae Lee",
        "Meeting Date & Time:TBD",
        "Location:TBD",
        "Partner with various organizations and departments to pair Angelo State and international students for a volunteer service organization.",
        "Create community service opportunities for various campus organizations.",
        "Create dialogue on culture and direct the integration of international students.",
        "Develop and deploy mechanisms and campaigns to improve and polish university culture and culture in San Angelo.",
        "Exchange culture, ideas, and vision",
        "President:Alexis Washington,awashington10@angelo.edu",
        "Advisor:Simon Pfeil",
        "Meeting Date & Time:Every other Friday at noon",
        "Location:MCS, Second Floor",
        "President:Monte Rankin,mrankin4@angelo.edu",
        "Advisor:Kurtis Neal",
        "Organization Email:clays@angelo.edu",
        "Website:https://www.angelo.edu/life-on-campus/lead/shotgun-sports/",
        "Meeting Date & Time:Sundays at 1 p.m.",
        "Location:San Angelo Claybird Association",
        "President:Jaelyn Knight,jknight11@angelo.edu",
        "Advisor:Dr. Heidi Moyer",
        "Meeting Date & Time:TBD",
        "Location:TBD",
        "President:Nadia Bayatpoor,nbayatpoor@angelo.edu",
        "Advisor:Jeffery Erwin",
        "Meeting Date & Time:TBD",
        "Location:Rassman 224",
        "President:Elizabeth Robles,erobles4@angelo.edu",
        "Advisor:Erdogan Dogdu",
        "Meeting Date & Time:TBD",
        "Location:TBD",
        "Create a playground where students can have fun while learning and discovering more about programming, computing and technology through collaborations, projects, and competitions.",
        "Foster a community where programmers and programming enthusiasts can interact, exchange ideas, and inspire one another.",
        "Promote a culture of learning by doing.",
        "Create an opportunity for students to connect and expand their network among the computer science community at Angelo State University.",
        "President:Carla Robles,crobles10@angelo.edu",
        "Advisor:Flor Leos Madero",
        "Organization Email:amas@angelo.edu",
        "Website:https://linktr.ee/angelostateamas",
        "Meeting Date & Time:Bi-weekly on Wednesday at 7 p.m.",
        "Location:TBD",
        "President:Priscilla Garcia,pgarcia32@angelo.edu",
        "Advisor:Flor E. Leos",
        "Meeting Date & Time:TBD",
        "Location:TBD",
        "Highlight and promote the different regions of Hispanic culture through the art of folkloric dance.",
        "Provide entertainment for the students at Angelo State University.",
        "Advocate a culturally safe environment for the student body.",
        "Promote tradition in the field of Baile Folklorico.",
        "Increase awareness of Mexican ancestry and inspire others to take pride in their own backgrounds.",
        "President:Cheyenne Reyes,creyes34@angelo.edu",
        "Advisor:Yo-Rong Chen",
        "Meeting Date & Time:Wednesdays from noon - 2 p.m.",
        "Location:BSM Building",
        "President:Kaleb Nance,knance1@angelo.edu",
        "Advisor:Paul Osmanski",
        "Meeting Date & Time:Wednesday’s at 8 p.m.",
        "Location:Vincent Room 250",
        "President:Pierce Stephens,pstephens1@angelo.edu",
        "Advisor:Landri Ognowski",
        "Meeting Date & Time:Thursdays, 6-7:30 p.m.",
        "Location:Rassman Building, Room TBD",
        "President:Alejandro Rodarte,arodarte5@angelo.edu",
        "Advisor:Carla Ebeling",
        "Organization Email:tribeta@angelo.edu",
        "Meeting Date & Time:Alternate Wednesdays at 6 p.m.",
        "Location:CAV 100",
        "Discipline:Biology",
        "President:Isela Rodriguez,Irodriguez33@angelo.edu",
        "Advisor:Chase Runyan",
        "Meeting Date & Time:Tuesday evenings at 7 p.m. (Subject to change)",
        "Location:TBD",
        "President:Hein Sett,hsett@angelo.edu",
        "Advisor:Omar Horner",
        "Meeting Date & Time:TBD",
        "Location:TBD",
        "President:Nora Ung,nung@angelo.edu",
        "Advisor:Omar Horner",
        "Meeting Date & Time:TBD",
        "Location:TBD",
        "Provide well-being support for Cambodian students attending Angelo State University.",
        "Share Cambodian culture with the Angelo State University community.",
        "President:Joseph Ryals,jryals@angelo.edu",
        "Advisor:Anthony Battistini",
        "Meeting Date & Time:Sundays at 2:30 p.m.",
        "Location:ASU Catholic Newman Center, 2451 Dena Dr.",
        "President:Bradley Watson,bwatson13@angelo.edu",
        "Advisor:Grant Wilde",
        "Meeting Date & Time:Tuesdays at 7 p.m.",
        "Location:1442 Edmund Blvd",
        "President:Kaleb Nance,knance1@angelo.edu",
        "Advisor:Jamal Husein",
        "Meeting Date & Time:Tuesdays & Thursdays at 9 p.m.",
        "Location:Tennis Courts",
        "Give students the opportunity to play tennis and get better.",
        "Experience what it is like to be on a team.",
        "Give students the opportunity to potentially play against the ASU Women’s tennis team during practice times.",
        "Gives the students the opportunity to go play against other schools at tournaments.",
        "President:James Cody Smith,jsmith33@angelo.edu",
        "Advisor:Dr. Andrew Siefker",
        "Meeting Date & Time:Wednesday 6 p.m., Sunday 9:30 a.m., Sunday 5 p.m.",
        "Location:2102 Johnson Ave.",
        "To encourage students and faculty to have a robust faith in Jesus Christ.",
        "To love and serve the student population, staff, faculty, administration, and facilities of ASU in the spirit of biblical stewardship.",
        "To foster understanding and application of God’s Word within a true community.",
        "To assist students in making wise life choices on the foundation of God’s Word.",
        "To provide a forum in which to accomplish the above purposes.",
        "President:Kaitlyn Macias,kmacias7@angelo.edu",
        "Advisor:Dr. Carlos A. Flores, Jr.",
        "Meeting Date & Time:2nd Monday of the month",
        "Location:CARR, Room 191 or 192",
        "President:Lauren Brooks,lbrooks9@angelo.edu",
        "Advisor:Nicole Lozano",
        "Foster a sense of community among students in the graduate counseling psychology program,",
        "Provide information pertinent to current and prospective students interested in the counseling psychology field,",
        "Discuss relevant issues and information within the counseling profession,",
        "Promote research in the field of counseling psychology, and",
        "Enhance the role of counseling psychology within the campus community.",
        "President:Nevaeh Hernandez,nhernandez62@angelo.edu",
        "Advisor:Dr. Daniel Kennedy",
        "Meeting Date & Time:Mondays at 6 p.m.",
        "Location:Academic 015",
        "Provide students with an opportunity to improve their creative writing skills.",
        "Promote and inform the students of Angelo State University about opportunities for publishing and career advisement and advancement",
        "Organize a safe and positive environment for students to share and discuss their works and ideas without fear of judgment.",
        "Enhance community involvement between students of Angelo State University through their various artistic avenues and within the community of San Angelo.",
        "Design opportunities to meet and network with peers and professionals of similar interests.",
        "Establish an outlet for writers to learn, experiment and express themselves through their writing.",
        "President:Kiyee Griffin,kgriffin17@angelo.edu",
        "Advisor:Dr. Jun Wu",
        "Organization Email:asucjsa@angelo.edu",
        "Meeting Date & Time:Every other Tuesday at 6:30 p.m.",
        "Location:Vincent Building, Room 238",
        "President:Clay Cabes,ccabes@angelo.edu",
        "Advisor:Gayle Randall",
        "Organization Email:dspetatheta@angelo.edu",
        "Meeting Date & Time:Thursdays at 8 p.m.",
        "Location:Rassman 105",
        "President:Alexis Aguilar",
        "Advisor:Dezaray Johnson",
        "Meeting Date & Time:Tuesdays at 7 p.m.",
        "Location:Nasworthy Suite",
        "President:Karol Perez,kperez51@angelo.edu",
        "Advisor:Beau Horner",
        "Organization Email:eptis@angelo.edu",
        "Meeting Date & Time:Tuesdays at 5 p.m.",
        "Location:Library Basement 001",
        "President:London Vega,lvega7@angelo.edu",
        "Advisor:Christabel Romine",
        "Meeting Date & Time:Tuesdays at 6:30 p.m.",
        "Location:University Center Rooms 201 and 211",
        "President:Miriam Guevara,mguevara9@angelo.edu",
        "Advisor:Candace Aguirre",
        "Meeting Date & Time:Third Thursdays of Every Month, at 6 p.m.",
        "Location:Location: UC 21",
        "Conjoin former-foster youth, unaccompanied, and other Angelo State students(allies);",
        "Provide and stimulate leadership among all persons;",
        "Maintain and improve knowledge of foster care or unaccompanied related topics;",
        "Serve as a campus organization for information pertinent to students, faculty, and staff; interested in the Fostering Ram Success Program;",
        "Create a space for like-minded individuals to be social;",
        "Promote volunteering in the community promoting aid towards foster care-minded services and youth with housing insecurities.",
        "President:Donavon Armendariz,darmendariz2@angelo.edu",
        "Advisor:Rob LeGrand",
        "Organization Email:asugameclub@angelo.edu",
        "Meeting Date & Time:Biweekly Saturday 3:00-5:00 pm",
        "Location:Texan community room",
        "Unite those with a common interest in gaming and competing.",
        "Enhance physical dexterity, reaction time, and social networking skills.",
        "Learn about the various aspects of gaming.",
        "Commune and de-stress from the hardships of college.",
        "President:Rylee Slate,rslate1@angelo.edu",
        "Advisor:Dr. Elizabeth Koeman-Shields",
        "Meeting Date & Time:Every other Wednesday at 5 PM",
        "Location:Vincent Nursing Physical Science Building Room 139, 146, or 158",
        "President:Margarita Torres Fabela,mtorresfabela@angelo.edu",
        "Advisor:Katherina Bunker",
        "Meeting Date & Time:Every Friday at 1 p.m. and every first Tuesday at 4 p.m.",
        "Location:Fridays in Carr 239, Tuesdays in Carr 202",
        "Create a community of Digital Artists who share an interest in Graphic Design",
        "Provide and stimulate leadership among all persons engaged in the Graphic Design Club",
        "Maintain and allow professional opportunities within the Graphic Design industry",
        "Serve as volunteer Graphic Designers for logos and poster design to students, faculty, and staff interested in Graphic Design Club work",
        "Stimulate creative and experimental techniques for Graphic Design",
        "Promote opportunities in the field of Graphic Design",
        "Enhance the role of Graphic Design for the campus community.",
        "President:Emily Carrisalez,ecarrisalez@angelo.edu",
        "Advisor:Paige Trubenstein",
        "Meeting Date & Time:Tuesdays at 5:15 p.m.",
        "Location:TBD",
        "Participate and promote community service through acts of environmentalism,",
        "Provide resources and knowledge for anybody wanting to participate in a more environmentally conscious lifestyle,",
        "Improve environmental awareness for students here at Angelo State University,",
        "Educate students on how to be proactive in regards to environmentalism, and",
        "Promote environmentalism and all acts, programs, and activities relating to environmentalism, and",
        "President:Israel Lopez Jr.,ilopez25@angelo.edu",
        "Advisor:Veronica Snow",
        "Meeting Date & Time:M/W/F 6-8 p.m.",
        "Location:CHP Raquetball/Handball Courts",
        "President:Brooke Wieland,bwieland@angelo.edu",
        "Advisor:Valarie Whitney",
        "Meeting Date & Time:TBD",
        "Location:MCS 100",
        "Assist students toward graduate school",
        "Promote research in the field of health science with diverse activities",
        "Improve opportunities for future jobs in Health Science.",
        "President:K. Elizabeth Frentz,kfrentz1@angelo.edu",
        "Advisor:Dr. Laura Hooton",
        "Meeting Date & Time:TBD",
        "Location:TBD",
        "President:Clay Loper,Cloperii@angelo.edu",
        "Advisor:Shirley Eoff",
        "Meeting Date & Time:Mondays at 7:30 p.m.",
        "Location:MCS 100",
        "President:Gabrielle Dyar,gdyar@angelo.edu",
        "Advisor:Evan Walters",
        "Meeting Date & Time:TBD",
        "Location:Rassman Building, Room 224",
        "Educate, inspire, and produce leaders that are prepared to define the character of warfighting in space.",
        "Develop undergraduate defense education of the space domain.",
        "Provide members opportunities to build skills and understanding within the space domain that will lead to commissioning more capable and aware military officers.",
        "President:Audrey Spearman,aspearman1@angelo.edu",
        "Advisor:Leah Carruth",
        "Organization Email:kdp@angelo.edu",
        "Meeting Date & Time:TBD",
        "Location:CARR 192",
        "President:Gavin Thompson,gthompson9@gmail.com",
        "Advisor:Adam Parker",
        "Meeting Date & Time:Mondays at 7 p.m. (If attending as a guest/non-member please schedule with the president)",
        "Location:University Center, Room 201",
        "President:Christopher Pena,cpena24@angelo.edu",
        "Advisor:Trey Holik",
        "Meeting Date & Time:Mondays at 7 p.m.",
        "Location:Rassman 100",
        "President:Juho Kim,jkim57@angelo.edu",
        "Advisor:Won-Jae Lee",
        "Meeting Date & Time:Every other Tuesday",
        "Location:Vincent Building, Room 252",
        "President:Miguel Suarez,msuarez7@angelo.edu",
        "Advisor:Nicholas Negovetich",
        "Meeting Date & Time:TBD Days, 6-8:30 p.m.",
        "Location:Rassman Room 105",
        "President:Leah Speed,lspeed@angelo.edu",
        "Meeting Date & Time:Every other Tuesday at 5:30 p.m.",
        "Location:TBD",
        "President:Jakob Sultemeier,jsultemeier1@angelo.edu",
        "Advisor:John Kellermeier",
        "Meeting Date & Time:Oct. 19, 2023 at 6:30 p.m.",
        "Location:VIN 250",
        "President:Brooks Dabney,bdabney@angelo.edu",
        "Advisor:Jessica Gooch",
        "Meeting Date & Time:TBD",
        "President:Arely Espinoza,Aespinoza20@angelo.edu",
        "Advisor:Kenna Archer",
        "Meeting Date & Time:Wednesday at 7 p.m.",
        "Location:2781 W Ave N, San Angelo, TX 76904",
        "Foster a space of wonder and exploration of one’s faith and relationship with Jesus the Christ.",
        "Ask the questions that are often pushed aside in our various Christian traditions with the goal of deepening one’s faith.",
        "Be inclusive of all who are wanting and willing to explore what it means to be a Christian and to live into the call to love God, love neighbor, and to love self.",
        "Participate in various events put on by Angelo State and the City of San Angelo with the goal of sharing God’s love with all that we may encounter.",
        "Create an active faith practice that acknowledges the wholeness of God’s creation both human and ecological.",
        "Be a welcoming community of all people from all various backgrounds, traditions, and life experiences.",
        "President:Jeremiah Devereaux,jdevereaux1@angelo.edu",
        "Advisor:Matthew Gritter",
        "Meeting Date & Time:Last Monday of every month at 7 p.m.",
        "Location:TBD (email for location)",
        "President:Anna Fitzgerald,afitzgerald2@angelo.edu",
        "Advisor:Charlene Bustos",
        "Meeting Date & Time:Thursdays, Biweekly, 6:30-7:30 p.m.",
        "Location:Carr EFA, Room 128",
        "Promote and encourage skills in needlework",
        "Foster community between students",
        "Engage students in productive, creative outlets",
        "Stimulate creative and unique techniques for needle arts",
        "Provide and stimulate leadership among all persons engaged in needlework",
        "President:Laura Madison,lmadison@angelo.edu",
        "Advisor:Nicole St. Germaine",
        "Meeting Date & Time:Fridays, Biweekly, 7-8 p.m.",
        "Location:Academic 125",
        "Discuss the various forms of pagan practices,",
        "Provide a safe location for pagan students to congregate and celebrate their faith,",
        "Serve students, faculty, and staff in an informational manner regarding pagan practices, culture, and",
        "Stimulate intellectual discussion regarding differences among the various pagan faiths.",
        "President:Chasity Lopez,clopez79@angelo.edu",
        "Advisor:Brianna Flores",
        "Meeting Date & Time:Every other Monday at 5:15 p.m.",
        "Location:CSI",
        "President:Lilia Reyes,lreyes56@angelo.edu",
        "Advisor:Ashley Araiza",
        "Meeting Date & Time:TBD",
        "Location:UC 211",
        "Provide service to animals in need by interacting with Concho Valley PAWS, ananimal shelter based in San Angelo, TX, and other applicable animal services,",
        "Provide and stimulate leadership among all persons engaged in PAWS-itive Rams,",
        "Create connections with the community through volunteering,",
        "Contribute to the alleviation of strain on existing volunteers.",
        "President:Tyler Williams,twilliams112@angelo.edu",
        "Advisor:Dr. Susana Badiola",
        "Meeting Date & Time:TBD",
        "Location:TBD",
        "President:Kurtis Landry,klandry2@angelo.edu",
        "Advisor:Brianna Flores (Interim)",
        "Organization Email:etaepsilonpikes@angelo.edu",
        "Meeting Date & Time:Sundays 8 p.m.",
        "Location:3339 TLC Way",
        "President:Katy Herber,kherber@angelo.edu",
        "Advisor:Jeff Sefcik",
        "Meeting Date & Time:TBD",
        "Location:TBD",
        "President:Austin Trevno,atrevino50@angelo.edu",
        "Advisor:Leslie Kelley",
        "Website:http://psichi.org/",
        "Meeting Date & Time:Wednesdays, 6:30 p.m.",
        "Location:Academic 004",
        "President:Lauren Coelho,lcoelho@angelo.edu",
        "Advisor:Dr. Steven Brewer",
        "Meeting Date & Time:TBD",
        "Location:Academic 004",
        "President:Cameron Allen,callen48@angelo.edu",
        "Advisor:Jan Daryl Chitsey",
        "Meeting Date & Time:TBD",
        "Location:TBD",
        "To work with each other and problem-solve on each other’s golf games.",
        "Travel with each other and learn to compete as a team in tournaments where it seems as an individual competition.",
        "Put into place and practice the rules held by both the PGA and USGA.",
        "Be accessible to students who have never played and teach them a game they can play the rest of their lives.",
        "President:Kylie Bliton,kbliton1@angelo.edu",
        "Advisor:Adam Parker",
        "Meeting Date & Time:TBD",
        "Location:West Texas Strength and Nutrition",
        "President:Hayden Kidd,Hkidd@angelo.edu",
        "Advisor:Manny Campos",
        "Meeting Date & Time:Tuesday-Thursday at 5 p.m.",
        "Location:Intramural Fields",
        "President:Mia Kilman,mkilman@angelo.edu",
        "Advisor:Hannah Hoelscher",
        "Meeting Date & Time:TBD - Monthly",
        "Location:TBD",
        "President:Elizabeth Kai Maldonado,Emaldonado7@angelo.edu",
        "Advisor:Manny Campos",
        "Organization Email:rambellerugby@angelo.edu",
        "Meeting Date & Time:Monday-Thursday, 5-7 p.m. Starting after 08/28/2023",
        "Location:Intramural Fields",
        "President:Jose Arteaga,jarteaga5@angelo.edu",
        "Advisor:Anthony Battistini",
        "Meeting Date & Time:TBD",
        "Location:TBD",
        "Establish the importance of working together to complete a common goal through leadership and team work",
        "Implant professional standards for students, faculty, and staff that are interested in Engineering",
        "Inspire creativity and intuitive designs fro engineering",
        "Endorse internships and researching the field of engineering",
        "Amplify the role of Engineering throughout the campus community",
        "President:Logan Lyons,Llyons6@angelo.edu",
        "Advisor:Chelsea Kading",
        "Meeting Date & Time:1st or 2nd Thursday from 5-7 p.m.",
        "Location:TBD",
        "Discuss and study the problems women face in society and on campus",
        "Provide a community of friendliness and acceptance on campus",
        "Ensure feminine hygiene products and contraception are widely available both on and off",
        "President:Ricardo Antunez,rantunez@angelo.edu",
        "Advisor:William Kitch",
        "Meeting Date & Time:TBD",
        "Location:TBD",
        "Promote rocketry and aircraft/spacecraft design,",
        "Teach students the intricacies of rocketry and aircraft/spacecraft design through the hands-on application of the skills from their respective fields,",
        "Encourage interdisciplinary cooperation between students with various academic majors, and",
        "Ignite future generations’ interest in STEM fields.",
        "President:Estefany Reyes,ereyesvillicana@angelo.edu",
        "Advisor:Trey Smith",
        "Organization Email:ramsforchrist.asu@gmail.com",
        "Meeting Date & Time:TBD",
        "Location:Christian Campus Center",
        "President:Lexus Arriaga,larriaga1@angelo.edu",
        "Advisor:Doris McCabe",
        "Meeting Date & Time:Tuesdays at 6 p.m.",
        "Location:TBD",
        "President:Clay Loper,Cloperii@angelo.edu",
        "Advisor:Dan Robertson",
        "Meeting Date & Time:Wednesdays 5-7 p.m. and Sundays 4-6 p.m.",
        "Location:Intramural Fields",
        "President:Liliana Hunt,lhunt5@angelo.edu",
        "Advisor:Kalynn Mohr",
        "Meeting Date & Time:TBD",
        "Location:Vincent Building, Room 250",
        "President:Vian Ozuna,vozuna1@angelo.edu",
        "Advisor:Ewa Davis",
        "Meeting Date & Time:TBD",
        "Location:TBD",
        "President:Victoria Corrales,vcorrales@angelo.edu",
        "Advisor:Flor Leos",
        "Meeting Date & Time:TBD",
        "Location:Rassman",
        "To provide and stimulate leadership among the students of Angelo State through life, leadership, career and professional sessions.",
        "Provide a Leadership Certificate to our members through a certificate program through the Vasquez Development Group.",
        "To serve and be leaders (ambassadors) of the San Angelo Community through the San Angelo Chamber of Commerce Concho Cadre.",
        "President:Emma Spradlin,espradlin@angelo.edu",
        "Advisor:Angie Wright",
        "Meeting Date & Time:Every Tuesday at 7 p.m. (members only)",
        "Location:MCS 100",
        "President:Sanlyn Bolin,sbolin@angelo.edu",
        "Advisor:Dr. Roger M. Jackson",
        "Meeting Date & Time:TBD",
        "Location:TBD",
        "President:Matthew Barton,mbarton7@angelo.edu",
        "Advisor:Dr. Michael Holcomb",
        "Meeting Date & Time:TBD",
        "Location:TBD",
        "President:Hannah Long,hlong2@angelo.edu",
        "Advisor:Dr. Armita Hamidi",
        "Meeting Date & Time:TBD",
        "Location:TBD",
        "Create a community for female engineering students,",
        "Provide support for females currently in, entering, or considering engineering astheir major and career",
        "Help create a standard for women in the engineering field,",
        "Display exceptional leadership across the community, and",
        "Teach members about the different experiences of current female engineers.",
        "President:Jake Cisneros,jcisneros7@angelo.edu",
        "Meeting Date & Time:TBD",
        "Location:A121",
        "President:Will Hollis,whollis2@angelo.edu",
        "Advisor:Matt Kirkham",
        "Meeting Date & Time:TBD",
        "Location:CHP",
        "Promote Inclusion of Special Olympics Athletes into UREC intramural programming",
        "Play inclusive sports that promote fair and fun play for all participants",
        "Participate in volunteer roles within the Special Olympics Unified Sports Program",
        "Form enduring friendships, to render altruistic service and build and inclusive community on campus",
        "President:Ethan Flores,eflores49@angelo.edu",
        "Advisor:Jason Pierce",
        "Meeting Date & Time:Once a month (TBD Start date)",
        "Location:TBD",
        "To educate students on the making of Star Wars,",
        "To have a fun fellowship with other students,",
        "To introduce Star Wars to as many people as possible,",
        "Once members have an understanding of Star Wars, we will engage in debates,",
        "Providing students with physical enrichment in the form of lightsaber duels, whether it be choreographed or spur of the moment,",
        "It is something that we are passionate about and we hope to instill that same passion in other people.",
        "President:Kameron Wiese,kwiese@angelo.edu",
        "Advisor:Dr. Clint Havins",
        "Meeting Date & Time:Thursday 7 p.m. (subject to change)",
        "Location:Nasworthy Suite Room 203-204 (subject to change)",
        "President:Irma Roji,irojo1@angelo.edu",
        "Advisor:Mackensie McCormick",
        "Meeting Date & Time:11/29/23 last meeting of the Fall semester",
        "Location:Blackboard Collaborate",
        "President:Manning Marsh,mmarsh6@angelo.edu",
        "Advisor:Veronica Snow",
        "Organization Email:spdclub@angelo.edu",
        "Meeting Date & Time:TBD",
        "Location:TBD",
        "President:Daijah Anguiano,danguiano2@angelo.edu",
        "Advisor:Andrew Rivera",
        "Organization Email:SSWA@angelo.edu",
        "Meeting Date & Time:Sundays at 6 pm",
        "Location:HHS 104",
        "President:Aryanna Lodrigue,alodrigue@angelo.edu",
        "Advisor:Jennifer Shoemake",
        "Meeting Date & Time:TBD",
        "Location:TBD",
        "President:Joe Stevenson,jstevenson7@angelo.edu",
        "Advisor:Robert Gomez",
        "Meeting Date & Time:2 Meeting on the first Wednesday of every month @ 11 a.m. and 1 p.m.",
        "Location:VETS Center (Houston Harte University Center Room 113)",
        "President:Anais Mendoza,amendoza@angelo.edu",
        "Advisor:Professor Katherine Garrison",
        "Meeting Date & Time:Every fourth Thursday, 6-7 p.m.",
        "Location:Academic 015",
        "President:Gracie Wendt,gwendt@angelo.edu",
        "Advisor:Kevin Brooks",
        "Meeting Date & Time:TBD",
        "Location:TBD",
        "President:Emma Krehbiel,ekrehbiel@angelo.edu",
        "Advisor:Dr. Andrew Tiger",
        "Meeting Date & Time:TBD",
        "Location:TBD",
        "President:Emma Krehbiel,ekrehbiel@angelo.edu",
        "Organization Email:spdclub@angelo.edu",
        "Meeting Date & Time:TBD",
        "Location:TBD",
        "President:Charlotte Branch,cbranch2@angelo.edu",
        "Advisor:Rebekah Clark",
        "Meeting Date & Time:TBD",
        "Location:Modular Theatre, Carr EFA Building, Room 241A",
        "President:Benjamin Gonzalez,bgonzalez27@angelo.edu",
        "Advisor:Lee Floyd",
        "Location:Concert Committee: Every Monday at 3 p.m.; Day & Night Committee: Every Tuesday at 4 p.m.; Art & Film: Every Wednesday at 3 p.m.",
        "President:Minh Anh Tran,mtran4@angelo.edu",
        "Advisor:Janie Soupiset",
        "Meeting Date & Time:TBD",
        "Location:TBD",
        "President:Isabel Micus,imicus@angelo.edu",
        "Advisor:Dr. Michael C. Holcomb",
        "Meeting Date & Time:TBD",
        "Location:TBD",
        "encourage women and other gender minorities to join physics and other STEM fields;",
        "foster an environment of inclusion for underrepresented groups;",
        "provide resources and advice for professional endeavors in physics and other STEM fields; and",
        "provide both academic and non-academic assistance to support student success in physics and other STEM fields.",
        "President:Jessica Vanegas-Martinez,jvanegasmartinez@angelo.edu",
        "Advisor:Jaime Hyatt",
        "Meeting Date & Time:Tuesdays at 6 p.m.",
        "Location:Archer College of Health and Human Services",
        "Connect women to help and lift one another up.",
        "Provide opportunities to build leadership skills.",
        "Help provide healthy ways of living.",
        "Provide charity for those in need.",
        "Provide external information for our community.",
        "President:Rhesa Key,rkey10@angelo.edu",
        "Advisor:Jenny Love",
        "Organization Email:angelostateyl@angelo.edu",
        "Meeting Date & Time:Thursdays at 8:08 p.m.",
        "Location:University Center, Room TBD",
        "2601 W. Avenue NSan Angelo, TX 76909",
        "1-800-946-8627",
        "Campus Map",
        "Contact ASU",
        "University Directory",
        "RamPort",
        "Jobs at ASU",
        "Facebook",
        "X",
        "Instagram",
        "YouTube",
        "©2024 Angelo State University",
        "All Rights Reserved",
        "Editor Login",
        "TTU System",
        "Texas Tech University",
        "TTU Health Sciences Center",
        "TTUHSC El Paso",
        "Midwestern State University",
        "ASU Privacy Policy",
        "Weather and Emergency Notifications",
        "Mental Health Services",
        "Title IX/Incident Report",
        "State of Texas",
        "Statewide Search",
        "Texas Homeland Security",
        "Texas Veterans Portal",
        "State Auditor’s Office",
        "Fraud Prevention",
        "Site Policies"
    ],
    "table_headers": [],
    "table_data": [],
    "captions": [],
    "links": [
        "#main-content",
        "/",
        "/academics/",
        "/academics/programs/",
        "/departments/",
        "/colleges/",
        "/courses/",
        "/current-students/registrar/academic_calendar.php",
        "/about-asu/",
        "/about-asu/history.php",
        "/about-asu/core-values/",
        "/about-asu/news/",
        "/about-asu/traditions/",
        "/about-asu/san-angelo.php",
        "/about-asu/president/",
        "/about-asu/mission-statement.php",
        "/admissions-and-aid/",
        "/admissions-and-aid/apply/",
        "/admissions-and-aid/admitted/",
        "/admissions-and-aid/info/",
        "/admissions-and-aid/visit/",
        "/admissions-and-aid/paying-for-college/",
        "/life-on-campus/",
        "/life-on-campus/live/",
        "/life-on-campus/play/",
        "/life-on-campus/lead/",
        "/life-on-campus/work/",
        "/life-on-campus/explore/",
        "/community/",
        "/community/mayer-museum/",
        "/alumni/",
        "/community/small-business-development-center/",
        "/community/west-texas-collection/",
        "/departments/biology/angelo-state-natural-history-collection/",
        "/community/kay-bailey-hutchison-center/",
        "/colleges/archer-college-of-health-and-human-services/laura-w-bush-institute-for-womens-health/",
        "/departments/visual-performing-arts/theatre/subscriptions.php",
        "/departments/physics-geosciences/planetarium/",
        "/community/stephens-chapel.php",
        "/community/asu-ranch/",
        "/community/ticket-office/",
        "/community/summer-camps-and-conferences/",
        "/give/",
        "/give/make_gift/",
        "/give/signature-events/",
        "/give/join/",
        "https://www.angelosports.com/",
        "https://ramport.angelo.edu/",
        "/library/",
        "http://bookstore.angelo.edu/",
        "/events/",
        "/public-health/",
        "/administrative-support/",
        "/research/",
        "/current-students/counseling-services/",
        "/current-students/title-ix/",
        "/en-espanol/",
        "/current-students/",
        "/faculty-and-staff/",
        "/admissions-and-aid/admitted/",
        "/active-duty-veterans/",
        "/parents-and-families/",
        "/alumni/",
        "/visitors/",
        "/school-counselors/",
        "/online/",
        "/life-on-campus/lead/",
        "/life-on-campus/lead/registered-student-organizations/",
        "/life-on-campus/lead/registered-student-organizations/starting-a-new-student-organization.php",
        "/life-on-campus/lead/registered-student-organizations/renewing-a-student-organization.php",
        "/life-on-campus/lead/registered-student-organizations/advisors.php",
        "/life-on-campus/lead/registered-student-organizations/funding.php",
        "/life-on-campus/lead/registered-student-organizations/financial-resources.php",
        "/life-on-campus/lead/registered-student-organizations/risk-management-training.php",
        "/life-on-campus/lead/greek-life/",
        "/life-on-campus/lead/greek-life/fraternities/",
        "/life-on-campus/lead/greek-life/fraternities/recruitment-rules.php",
        "/life-on-campus/lead/greek-life/sororities/",
        "/life-on-campus/lead/greek-life/alpha-class.php",
        "/life-on-campus/lead/greek-life/hazing-statement.php",
        "/life-on-campus/lead/greek-life/funding.php",
        "/life-on-campus/lead/greek-life/order-of-omega.php",
        "/life-on-campus/lead/asu-cheer-and-mascots/",
        "/life-on-campus/lead/asu-cheer-and-mascots/cheer-tryout-information/",
        "/life-on-campus/lead/asu-cheer-and-mascots/cheer-prep-clinics.php",
        "#",
        "/life-on-campus/lead/asu-cheer-and-mascots/mascot-interest-application.php",
        "/life-on-campus/lead/asu-cheer-and-mascots/cheerleader-request-form.php",
        "/life-on-campus/lead/asu-cheer-and-mascots/roscoe-and-bella-mascot-request-form.php",
        "/life-on-campus/lead/asu-cheer-and-mascots/cheer-judge-request.php",
        "/life-on-campus/lead/asu-cheer-and-mascots/meet-the-asu-cheer-team.php",
        "/life-on-campus/lead/angelettes/",
        "/life-on-campus/lead/rodeo/",
        "/life-on-campus/lead/shotgun-sports/",
        "/life-on-campus/lead/shotgun-sports/clays-on-the-concho.php",
        "/life-on-campus/lead/student-government-association/",
        "#",
        "/life-on-campus/lead/student-government-association/student_discount_program.php",
        "/life-on-campus/lead/student-government-association/ram-family-student-campaign.php",
        "/life-on-campus/lead/student-government-association/executive-office-and-senators.php",
        "/life-on-campus/lead/student-government-association/elections/",
        "/life-on-campus/lead/rambassadors.php",
        "/life-on-campus/lead/ram-transition-leaders/",
        "/life-on-campus/lead/university-center-program-council/",
        "/life-on-campus/lead/community-service/",
        "/live/forms/2574-community-service-hours-submission",
        "/life-on-campus/lead/community-service/volunteer-opportunities.php",
        "/life-on-campus/lead/community-service/volunteer-mailing-list.php",
        "/life-on-campus/lead/community-service/volunteer_request.php",
        "/life-on-campus/lead/asu-rammys.php",
        "/life-on-campus/lead/whos-who.php",
        "/",
        "/life-on-campus/",
        "/life-on-campus/lead/",
        "/life-on-campus/lead/registered-student-organizations/starting-a-new-student-organization.php",
        "#",
        "#",
        "#",
        "#",
        "#",
        "#",
        "#",
        "#",
        "#",
        "#",
        "mailto:",
        "mailto:activeminds@angelo.edu",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:clays@angelo.edu",
        "https://www.angelo.edu/life-on-campus/lead/shotgun-sports/",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:amas@angelo.edu",
        "https://linktr.ee/angelostateamas",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:tribeta@angelo.edu",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:asucjsa@angelo.edu",
        "mailto:",
        "mailto:dspetatheta@angelo.edu",
        "mailto:",
        "mailto:eptis@angelo.edu",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:asugameclub@angelo.edu",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:kdp@angelo.edu",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:etaepsilonpikes@angelo.edu",
        "mailto:",
        "mailto:",
        "http://psichi.org/",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:rambellerugby@angelo.edu",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:ramsforchrist.asu@gmail.com",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:spdclub@angelo.edu",
        "mailto:",
        "mailto:SSWA@angelo.edu",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:spdclub@angelo.edu",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:",
        "mailto:angelostateyl@angelo.edu",
        "mailto:organizations@angelo.edu",
        "/life-on-campus/lead/greek-life/hazing-statement.php",
        "/life-on-campus/lead/registered-student-organizations/advisors.php",
        "/life-on-campus/lead/registered-student-organizations/funding.php",
        "/life-on-campus/lead/registered-student-organizations/renewing-a-student-organization.php",
        "tel:18009468627",
        "/map/",
        "/contact/",
        "/directory/",
        "https://ramport.angelo.edu/",
        "/work-at-asu/",
        "https://www.facebook.com/angelostateuniversity",
        "https://twitter.com/AngeloState",
        "https://www.instagram.com/angelostate/",
        "https://www.youtube.com/user/AngeloStateU",
        "/livewhale/?login&referer=1",
        "http://www.texastech.edu/",
        "https://www.ttu.edu/",
        "https://www.ttuhsc.edu/",
        "https://elpaso.ttuhsc.edu/",
        "https://msutexas.edu/",
        "https://apps.highered.texas.gov/resumes/",
        "/privacy_policy.php",
        "/emergency-notifications/",
        "/current-students/counseling-services/",
        "/current-students/title-ix/",
        "https://www.texas.gov/",
        "https://www.tsl.texas.gov/trail/index.html",
        "https://gov.texas.gov/organization/hsgd",
        "https://veterans.portal.texas.gov/",
        "https://sao.fraud.texas.gov/",
        "/administrative-support/audit-services/fraud_prevention.php",
        "/site-policies/"
    ],
    "tables": []
}