{
    "file_name": "sites-communications-and-marketing.html",
    "title": "Guidelines for Creating ASU Web Pages  · Angelo State University",
    "description": "Angelo State University guidelines for ASU web pages.",
    "meta_tags": {
        "viewport": "width=device-width, initial-scale=1",
        "generator": "LiveWhale",
        "og:title": "Guidelines for Creating ASU Web Pages",
        "og:type": "website",
        "og:url": "https://www.angelo.edu/administrative-support/communications-and-marketing/web-guidelines.php",
        "pagename": "Guidelines for Creating ASU Web Pages",
        "og:description": "Angelo State University guidelines for ASU web pages.",
        "description": "Angelo State University guidelines for ASU web pages.",
        "og:image": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "og:image:secure_url": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "og:image:width": "1260",
        "og:image:height": "630",
        "twitter:card": "summary_large_image",
        "twitter:title": "Guidelines for Creating ASU Web Pages",
        "twitter:description": "Angelo State University guidelines for ASU web pages.",
        "twitter:image": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "lw-template-updated": "02/18/2022 10:23am CST"
    },
    "headings": [
        "Quick Links",
        "Information For",
        "Guidelines for Creating ASU Web Pages",
        "The Template",
        "Home Pages",
        "Page Titles",
        "Content",
        "Photos/Graphics",
        "Links",
        "Inappropriate Material",
        "Need Help?",
        "Website Editors",
        "Responsibilities",
        "Accuracy",
        "Style",
        "Technical",
        "Legal",
        "Recommendations",
        "External Sites",
        "Third-party sites affiliated with ASU",
        "Questions? Contact Us!"
    ],
    "paragraphs": [
        "These guidelines have been produced and disseminated as part of the university’s marketing effort to provide consistency in design and quality of university and departmental web pages.",
        "A standard template has been designed with a consistent color scheme, fonts and design elements to provide a unified look for university web pages. The ASU website template provides a professional starting point for editors to focus on the informational rather than design components of their respective pages. It is intended to simplify the process of web updates and enhance the university’s overall marketing to prospective students.",
        "The template design applies to all university pages within the ASU website to ensure consistency in layout, colors, fonts, navigation and overall look and feel.",
        "The unifying elements of the template are the top banner, section navigation, content section and footer.",
        "Web page editors should use only those colors approved for the ASU site as specified in the style sheet.",
        "Each page on the ASU site must use the approved template to ensure a consistent look and feel. The editable region within each template is available for departments to use to fit their specific needs. This area can be used for both text and graphics.",
        "The opening page for academic departments is the place to start recruiting students. Each academic department should have an opening page that provides a brief description of the department, its programs and the associated career opportunities, as well as departmental contact information. Do not overwhelm prospects with information. Inform them about what makes your department special and intrigue them with opportunities within a particular field.",
        "The opening page for non-academic departments and offices should include a brief introduction with information about what the office does. Contact information should also be readily available on the homepage.",
        "Keep the length of your pages to one or two screens of information. Limiting the amount of information helps with download time and generally results in a more visually appealing page. Use white space wisely. Breaking your content into sections, including headings, and using lists can help users scan your page and find relevant information more quickly. Be brief, concise and specific in your wording. You can often say more with less.",
        "If you would like more guidance about the information to share on your website, contact theOffice of Communications and Marketingto schedule a website enhancement project.",
        "Editors are those individuals who have received web training and are responsible for creating and updating web pages for a specific department or unit according to these guidelines. There are two types of website editors:",
        "Website editors cannot directly publish content to the web. They must submit all content for approval by the web team, who can publish, edit, or return the content for revisions.",
        "Because the ASU website is a major window into the university, visitors make judgments upon the university based upon what they see. Attention to accuracy, detail and design are important in making the best possible impression upon website visitors. Therefore, all content providers have the following responsibilities.",
        "External sites are sites that either reside on a web server other than www.angelo.edu but are considered official university pages, or sites that reside on the www.angelo.edu server.",
        "Sites hosted on other web servers, whether on- or off-campus are considered “third-party.” Third-party sites that have affiliation with ASU should have a general design theme similar to the ASU design. These types of sites are considered official university pages and should follow the guidelines as described on this page whenever possible, including the use of approved colors and fonts. While not all third-party software and web servers allow for the same capabilities, and not all applications warrant identical layouts, care should be taken to ensure that design consistency appears across all ASU pages. Third-party sites should be reviewed and approved by Information Technology in conjunction with Communications and Marketing."
    ],
    "list_items": [
        "AcademicsAcademic ProgramsDepartmentsCollegesCoursesAcademic Calendar",
        "Academic Programs",
        "Departments",
        "Colleges",
        "Courses",
        "Academic Calendar",
        "About ASUHistoryCore ValuesNewsTraditionsAbout San AngeloWelcome from the PresidentMission Statement",
        "History",
        "Core Values",
        "News",
        "Traditions",
        "About San Angelo",
        "Welcome from the President",
        "Mission Statement",
        "Admissions & AidApply to ASUAdmitted StudentsRequest More InformationVisit Angelo State UniversityPaying for College",
        "Apply to ASU",
        "Admitted Students",
        "Request More Information",
        "Visit Angelo State University",
        "Paying for College",
        "Life on CampusLivePlayLeadWorkExplore",
        "Live",
        "Play",
        "Lead",
        "Work",
        "Explore",
        "CommunityASU Mayer MuseumAlumni AssociationSmall Business Development CenterWest Texas CollectionNatural History CollectionsKay Bailey Hutchison Center for Cyber Intelligence, Innovation, and Security StudiesLaura W. Bush Institute for Women’s HealthArts at ASUPlanetariumStephens ChapelRanch and Meat MarketASU Ticket OfficeSummer Camps and Conferences",
        "ASU Mayer Museum",
        "Alumni Association",
        "Small Business Development Center",
        "West Texas Collection",
        "Natural History Collections",
        "Kay Bailey Hutchison Center for Cyber Intelligence, Innovation, and Security Studies",
        "Laura W. Bush Institute for Women’s Health",
        "Arts at ASU",
        "Planetarium",
        "Stephens Chapel",
        "Ranch and Meat Market",
        "ASU Ticket Office",
        "Summer Camps and Conferences",
        "Give to ASUMake a GiftSignature EventsJoin",
        "Make a Gift",
        "Signature Events",
        "Join",
        "Athletics",
        "RamPort",
        "Library",
        "Bookstore",
        "Events",
        "Public Health Updates",
        "Administration",
        "Research",
        "Mental Health Services",
        "Title IX/Incident Report",
        "En Español",
        "Current Students",
        "Faculty & Staff",
        "Admitted Students",
        "Military",
        "Parents & Families",
        "Alumni",
        "Visitors",
        "School Counselors",
        "Online Students",
        "Services",
        "News",
        "Mission, Values and Vision",
        "Contact Us",
        "TheTop Bannercontains the ASU logo, site search, main site navigation (with links to important items for prospective students).",
        "TheSection Navigationcontains section-specific navigation and the page breadcrumbs.",
        "TheFootercontains ASU contact information, frequently used links, and social media.",
        "TheContent Sectioncontains all of the editable content for each page.",
        "Page titles are seen by visitors at the top of the browser window, in the bread crumbs menu, in the ASU website search results, and in external search engine search results.",
        "To help visitors identify pages when searching on the ASU website, page titles should aim for global uniqueness.",
        "To help search engine users choose to click a page in search results, page titles should be descriptive of the pages they belong to.",
        "As an example, for the Biology home page, instead of simply using ‘Home’ as the title, ‘Department of Biology’ would be more appropriate.",
        "Including a high quality photograph representative of your department is recommended. But keep in mind that a poor quality or low resolution photo can do more harm than good.",
        "All photos must include analtattribute that provides a clear textual description of the content or purpose of the image in order to ensure accessibility.",
        "Make sure you describe each of your links, and avoid using the words ‘Click Here’ when adding links.",
        "Validate and verify all links. Don’t leave broken links active. 404 errors (file not found) leave people frustrated.",
        "Links to websites that are not part of the ASU website should open in a new window.",
        "Links to documents or files, such as PDFs, should include an appropriate icon designating the file type.",
        "Derogatory or libelous materials or materials that infringe on the rights of others.",
        "Materials that violate policies or laws.",
        "Confidential materials including records protected by the Family Educational Rights and Protection Act.",
        "Materials that are abusive, profane or sexually offensive.",
        "Advertisements for commercial products or enterprises.",
        "“Light” users have access to create and edit Events and Forms. There is typically one light user per department or unit.",
        "“Full” users have access to create and edit Events, Forms, and Profiles, and edit Pages. There is typically one full user per College or major administrative unit.",
        "Page information must be kept accurate, current and appropriate for online use.",
        "Pages must avoid unnecessary duplication of information as well as contradictory or erroneous information.",
        "Proofread all text, captions, alt tags, etc. and spell check all text before it is posted.",
        "Get someone else to review your work.",
        "Official pages must be updated as necessary or at least once a semester.",
        "Minimize sentence length, use a conversational vocabulary level and avoid jargon and obscure acronyms.",
        "Pages should be constructed in accordance with good design practice.",
        "Only approved styles are allowed on the ASU website. Use appropriate elements and apply existing styles when necessary. Do not addstyleattributes to elements in order to override or prevent the default rendering of an element.",
        "The usual rules of print publication apply to web page design and text. Try to followAP Styleas much as possible.",
        "Pages should load quickly as determined by Information Technology.",
        "Pages should be checked regularly for validity of all hypertext links.",
        "Pages must comply with all policies and laws, especially those governing copyright and Americans with Disabilities Act requirements.",
        "Pages are subject to university publication regulations and policies.",
        "Be mindful of copyright infringement—do not plagiarize written work and do not steal photos from other websites.",
        "Public domain information contained in official pages must have requisite permission and appropriate citations.",
        "The web is a diverse environment and not all browsers are equal. Test your page with browsers such as Chrome, Internet Explorer, Firefox and Safari.",
        "Don’t use graphical gimmicks such as animated GIFs. They quickly become annoying.",
        "Don’t use blinking text as it is distracting.",
        "Review all pages though an online accessibility program such asWebAIM WAVE.",
        "Don’t use the university seal as it is reserved for official ASU documents only.",
        "Use the ASU logo in the format it is provided. It may be used larger or smaller, but should be kept in the proportion in which it is provided.",
        "Don’t use any logos without permission or without marking them as trademarks.",
        "Avoid dead links by checking all links regularly.",
        "Don’t make something look like a button and not work like a button.",
        "Don’t steal someone else’s graphics.",
        "Test, test, test - especially after a page is live.",
        "2601 W. Avenue NSan Angelo, TX 76909",
        "1-800-946-8627",
        "Campus Map",
        "Contact ASU",
        "University Directory",
        "RamPort",
        "Jobs at ASU",
        "Facebook",
        "X",
        "Instagram",
        "YouTube",
        "©2024 Angelo State University",
        "All Rights Reserved",
        "Editor Login",
        "TTU System",
        "Texas Tech University",
        "TTU Health Sciences Center",
        "TTUHSC El Paso",
        "Midwestern State University",
        "ASU Privacy Policy",
        "Weather and Emergency Notifications",
        "Mental Health Services",
        "Title IX/Incident Report",
        "State of Texas",
        "Statewide Search",
        "Texas Homeland Security",
        "Texas Veterans Portal",
        "State Auditor’s Office",
        "Fraud Prevention",
        "Site Policies"
    ],
    "table_headers": [
        "Color",
        "RGB",
        "Hex Code"
    ],
    "table_data": [
        "Blue",
        "0, 48, 135",
        "#003087",
        "Dark Blue",
        "0, 37, 84",
        "#002554",
        "Yellow",
        "255, 199, 44",
        "#ffc72c",
        "Light Blue",
        "132, 219, 247",
        "#84dbf7"
    ],
    "captions": [
        "Primary Website Colors"
    ],
    "links": [
        "#main-content",
        "/",
        "/academics/",
        "/academics/programs/",
        "/departments/",
        "/colleges/",
        "/courses/",
        "/current-students/registrar/academic_calendar.php",
        "/about-asu/",
        "/about-asu/history.php",
        "/about-asu/core-values/",
        "/about-asu/news/",
        "/about-asu/traditions/",
        "/about-asu/san-angelo.php",
        "/about-asu/president/",
        "/about-asu/mission-statement.php",
        "/admissions-and-aid/",
        "/admissions-and-aid/apply/",
        "/admissions-and-aid/admitted/",
        "/admissions-and-aid/info/",
        "/admissions-and-aid/visit/",
        "/admissions-and-aid/paying-for-college/",
        "/life-on-campus/",
        "/life-on-campus/live/",
        "/life-on-campus/play/",
        "/life-on-campus/lead/",
        "/life-on-campus/work/",
        "/life-on-campus/explore/",
        "/community/",
        "/community/mayer-museum/",
        "/alumni/",
        "/community/small-business-development-center/",
        "/community/west-texas-collection/",
        "/departments/biology/angelo-state-natural-history-collection/",
        "/community/kay-bailey-hutchison-center/",
        "/colleges/archer-college-of-health-and-human-services/laura-w-bush-institute-for-womens-health/",
        "/departments/visual-performing-arts/theatre/subscriptions.php",
        "/departments/physics-geosciences/planetarium/",
        "/community/stephens-chapel.php",
        "/community/asu-ranch/",
        "/community/ticket-office/",
        "/community/summer-camps-and-conferences/",
        "/give/",
        "/give/make_gift/",
        "/give/signature-events/",
        "/give/join/",
        "https://www.angelosports.com/",
        "https://ramport.angelo.edu/",
        "/library/",
        "http://bookstore.angelo.edu/",
        "/events/",
        "/public-health/",
        "/administrative-support/",
        "/research/",
        "/current-students/counseling-services/",
        "/current-students/title-ix/",
        "/en-espanol/",
        "/current-students/",
        "/faculty-and-staff/",
        "/admissions-and-aid/admitted/",
        "/active-duty-veterans/",
        "/parents-and-families/",
        "/alumni/",
        "/visitors/",
        "/school-counselors/",
        "/online/",
        "/administrative-support/communications-and-marketing/",
        "/administrative-support/communications-and-marketing/services/",
        "/about-asu/news/",
        "/administrative-support/communications-and-marketing/mission.php",
        "/administrative-support/communications-and-marketing/staff.php",
        "/",
        "/administrative-support/",
        "/administrative-support/communications-and-marketing/",
        "/administrative-support/communications-and-marketing/",
        "/administrative-support/communications-and-marketing/style_guidelines.php",
        "http://wave.webaim.org/",
        "mailto:communications.marketing@angelo.edu",
        "/map/?Administrative Support Center",
        "tel:18009468627",
        "/map/",
        "/contact/",
        "/directory/",
        "https://ramport.angelo.edu/",
        "/work-at-asu/",
        "https://www.facebook.com/angelostateuniversity",
        "https://twitter.com/AngeloState",
        "https://www.instagram.com/angelostate/",
        "https://www.youtube.com/user/AngeloStateU",
        "/livewhale/?login&referer=1",
        "http://www.texastech.edu/",
        "https://www.ttu.edu/",
        "https://www.ttuhsc.edu/",
        "https://elpaso.ttuhsc.edu/",
        "https://msutexas.edu/",
        "https://apps.highered.texas.gov/resumes/",
        "/privacy_policy.php",
        "/emergency-notifications/",
        "/current-students/counseling-services/",
        "/current-students/title-ix/",
        "https://www.texas.gov/",
        "https://www.tsl.texas.gov/trail/index.html",
        "https://gov.texas.gov/organization/hsgd",
        "https://veterans.portal.texas.gov/",
        "https://sao.fraud.texas.gov/",
        "/administrative-support/audit-services/fraud_prevention.php",
        "/site-policies/"
    ],
    "tables": [
        [
            [
                "Color",
                "RGB",
                "Hex Code"
            ],
            [
                "Blue",
                "0, 48, 135",
                "#003087"
            ],
            [
                "Dark Blue",
                "0, 37, 84",
                "#002554"
            ],
            [
                "Yellow",
                "255, 199, 44",
                "#ffc72c"
            ],
            [
                "Light Blue",
                "132, 219, 247",
                "#84dbf7"
            ]
        ]
    ]
}