{
    "file_name": "sites-distinguished-speaker-series.html",
    "title": "Distinguished Speaker Series  · Angelo State University",
    "description": "Angelo State University’s Distinguished Speaker Series brings world-renown presenters from a range of academic disciplines to San Angelo, Texas.",
    "meta_tags": {
        "viewport": "width=device-width, initial-scale=1",
        "generator": "LiveWhale",
        "og:title": "Distinguished Speaker Series",
        "og:type": "website",
        "og:url": "https://www.angelo.edu/events/distinguished-speaker-series/",
        "pagename": "Distinguished Speaker Series",
        "og:description": "Angelo State University’s Distinguished Speaker Series brings world-renown presenters from a range of academic disciplines to San Angelo, Texas.",
        "description": "Angelo State University’s Distinguished Speaker Series brings world-renown presenters from a range of academic disciplines to San Angelo, Texas.",
        "og:image": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/32532_DSC_0863_WITH_HUD.rev.1519752621.jpg",
        "og:image:secure_url": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/32532_DSC_0863_WITH_HUD.rev.1519752621.jpg",
        "og:image:width": "1260",
        "og:image:height": "630",
        "twitter:card": "summary_large_image",
        "twitter:title": "Distinguished Speaker Series",
        "twitter:description": "Angelo State University’s Distinguished Speaker Series brings world-renown presenters from a range of academic disciplines to San Angelo, Texas.",
        "twitter:image": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/32532_DSC_0863_WITH_HUD.rev.1519752621.jpg",
        "lw-template-updated": "02/18/2022 11:23am CST"
    },
    "headings": [
        "Quick Links",
        "Information For",
        "Distinguished Speaker Series",
        "Active Lectureships",
        "Distinguished Lectureship in Science Honoring Dr. Roy E. Moon",
        "E. James Holland Symposium on American Values",
        "Henry Edwards Distinguished Lectureship in Art",
        "ASU Writers Conference in Honor of Elmer Kelton",
        "E. James Holland-Roy A. Harrell, Jr. Foreign Affairs Speakers Program",
        "Center for Security Studies Symposium",
        "Lone Star Lecture Series, hosted by the Dr. Arnoldo de León Department of History",
        "Inactive Lectureships",
        "AEP Distinguished Faculty in Residence Program",
        "Community Lectureship in the Humanities",
        "International Business Symposium",
        "Wells Fargo Distinguished Lectureship in Business"
    ],
    "paragraphs": [
        "The Distinguished Speaker Series at Angelo State University provides premier lectures to both Angelo State students and community members.",
        "Seven lectures throughout the year feature discussions in topics relating to areas of study in the College of Science and Engineering, College of Arts and Humanities and the Norris-Vincent College of Business.",
        "View the ASUcalendarfor details about upcoming lectures.",
        "The Moon Lectureship brings a scientist of national prominence to the ASU campus each year for public lectures, colloquia and informal discussions. The academic or professional specialty of the scientist is to be in one of the basic sciences emphasized in the ASU curriculum or in an appropriate medical field.",
        "Learn More about the Moon Lectureship",
        "The ASU Symposium on American Values has brought more than 50 knowledgeable and sometimes provocative figures from the front lines of American culture and society to the ASU campus to spark discussion on a wide range of topics. Pop culture, politics, entertainment, immigration, foreign policy and violence provide a sampling of the subjects covered in the annual lecture.",
        "The Holland Symposium has brought to campus noted scholars from a variety of fields, including ecology, sociology, psychology, political science, education and business. The symposium is named in honor of its creator, E. James Holland, retired dean of the ASU College of Liberal and Fine Arts, and is designed to bring the ASU community and the public together to reflect on issues related to the country’s values.",
        "Dr. Renee Hobbs, professor of communication studies at the University of Rhode Island and founder of the Media Education Lab.",
        "Patrick Jagoda, William Riney Harper Professor of English and Cinema and Media Studies at the University of Chicago, and Ashlyn Sparrow, Assistant Director of the Weston Game Lab at the University of Chicago",
        "Julie Giroux, orchestrator, composer, arranger, clinician and guest conductor",
        "Mr. Kyle Emile, founder and Executive Director of the non-profit organization Free Intelligent Conversation",
        "Sonia Manzano, “Maria” from “Sesame Street” and best-selling author",
        "Dr. Zeynep Tufekci, associate professor in the School of Information and Library Science at the University of North Carolina, writer and “techno-sociologist”",
        "Dr. John McWhorter, associate professor of English and comparative literature at Columbia University, linguist and best-selling author",
        "Retired Col. Eileen Collins, retired NASA and Air Force Colonel and the first woman to command an American spacecraft",
        "The Henry Edwards Distinguished Lectureship in Art is an outgrowth of the Edwards Family Trust. Established in 1992 by Joseph Henry Edwards and Winona Edwards of San Angelo, the trust provides funding for the art program in ASU’s Department of Visual and Performing Arts. In addition to the lectureship, the Edwards Family Trust supports scholarships for outstanding visual art students and an artist residency program.",
        "Lee Hill and Alexis Serio, Texas-based contemporary painters",
        "Annie Varnot, New York-based contemporary painter",
        "Sammy Peters, Arkansas-based abstract painter",
        "The ASU Writers Conference brings award-winning authors from all genres to campus to share their works and their creativity with the ASU community and the public. Featured speakers have included authors of many familiar novels, poems and plays, covering everything from war and social upheaval to history, ethnicity and baseball.",
        "The conference is held every year in honor of the late Elmer Kelton, who wrote more than 40 books, including “The Time it Never Rained,” “The Man Who Rode Midnight” and “The Good Old Boys.” He was a seven-time winner of the Western Writers of America’s (WWA) Spur Award, and the WWA named him the “all-time best Western author.” Additionally, local and regional writers are invited to showcase their works of fiction, nonfiction, poetry and prose. The event is hosted by the ASU Department of English and Modern Languages and sponsored by the university with support from the ASU Alumni Association, the College of Arts and Humanities and Guy and Eva Choate.",
        "Manuel Muñoz, critically acclaimed short-story writer; recipient of a MacArthur Genius Grant",
        "Dr. Brandon Hobson, critically acclaimed fiction writer",
        "Naomi Shihab Nye, poet, fiction writer and children’s literature author",
        "Laila Lalami, award-winning author, professor of creative writing at the University of California at Riverside, winner of the American Book Award and Arab-American Book Award, finalist for the Pulitzer Prize for Fiction",
        "Chitra Banerjee Divakaruni, award-winning poet and best-selling author; Betty and Gene McDavid Professor of Creative Writing at the University of Houston; winner of the Allen Ginsberg Poetry Prize and American Book Award",
        "Brian Turner, poet and memoirist; director of the Master of Fine Arts in creative writing program at Sierra Nevada College and author of “My Life as a Foreign Country,” “Phantom Noise” and “Here, Bullet.”",
        "Anne Hillerman, journalist, newspaper editor and best-selling author of three novels in the Joe Leaphorn Navajo Mysteries series; winner of the New Mexico Book Award, Mountains and Plains Booksellers Award and Western Writers of America Spur Award; Co-founder and director of the Santa Fe-based WORDHARVEST Writers Workshop and the Tony Hillerman Writers Conference",
        "Craig Johnson, award-winning author of 12 novels in the Walk Longmire mystery series and the inspiration for the A&E/Netflix TV series “Longmire,” winner of the Western Writers of America’s Spur Award, Independent Booksellers’ Book of the Year Award, Publishers Weekly Best Book of the Year Award and Library Journal Best Mystery of the Year Award",
        "The E. James Holland-Roy A. Harrell, Jr. Foreign Affairs Speakers Program is dedicated to providing ASU students with a broader worldview and exposing them to potential career opportunities in the Foreign Service. Participating ambassadors deliver a general presentation on self-selected topics to the ASU community and then over a two-day period meet with students in the classroom to share their diplomatic experiences.",
        "The program was organized by Dr. James Holland and initiated in the early 2000s with the assistance of Dr. Roy Harrell, who has provided continued assistance since, particularly in recruiting speakers through his contacts with the American Foreign Service Association and the Diplomatic and Counselor Officers Retired. Dr. Harrell established an endowment in 2008 to provide ongoing support for the program. The Holland-Harrell Foreign Affairs Speakers Program is sponsored by the College of Arts and Humanities, Department of Communication and Mass Media, Department of Political Science and Philosophy, Arnoldo De León Department of History, Center for International Studies, Department of English and Modern Languages and the University Center Program Council.",
        "Jeffrey Feltman, former U.S. Special Envoy for the Horn of Africa",
        "Ambassador Larry C. Napper, Former U.S. ambassador to Latvia and Kazakhstan",
        "Ambassador Tibor Nagy, Assistant Secretary of State for African Affairs (Ret.)",
        "Jonathan Fantini Porter, former national security official in the Executive Office of the President; member of the U.S. Advisory Board for the United Nations Refugee Agency",
        "Earl Anthony Wayne, former U.S. ambassador to Mexico and Argentina",
        "Dr. Jack Matlock, former ambassador to the Soviet Union and senior director for European and Soviet Affairs in the National Security Council",
        "Mark Feierstein, former special assistant to the president and senior director for western hemisphere affairs on the National Security Council",
        "James N. Purcell, Jr., chairman of the U.S. Association for International Migration, former assistant secretary of state of the State Department’s Bureau for Refugee Programs",
        "James A Larocco, former U.S. ambassador to Kuwait, former director general of the Multinational Force and Observers on the Sinai Peninsula, former deputy assistant secretary of state for Near East affairs",
        "Robert Hunter, former U.S. Ambassador to NATO who is a senior fellow at the Center for Transatlantic Relations of Johns Hopkins University",
        "Robert E. Gribbin, former U.S. Ambassador to Rwanda and Central African Republic",
        "2019",
        "George Hutchinson, managing editor, International Journal of Korean StudiesWilliam Newcomb, former member, United National Panel of ExpertsGreg Scarlatoiu, executive director, Committee for Human Rights in North KoreaMark Tokola, vice president, Korea Economic Institute",
        "2017",
        "Mark Tokola, vice president of the Korea Economic InstituteGen. John Tilelli, U.S. Army (retired)Greg Scarlatoiu, executive director of the Committee for Human Rights in North KoreaDr. Bruce Bechtol, ASU professor of political science",
        "2016",
        "Troy Stangarone, senior director of congressional affairs and trade, Korea Economic InstituteGen. Chun In-Bum, Republic of Korea Army (retired), and visiting fellow, Brookings InstituteDr. Dlynn Armstrong-Williams, chair of the Political Science and International Affairs Department, University of North GeorgiaDr. Bruce Bechtol, ASU professor of political science",
        "2015",
        "Mark Tokola, vice president of the Korea Economic InstituteDr. Tara O, Asia policy specialist at the Center for Strategic and International Studies and board member of the International Council on Korean StudiesGordan Chang, columnist for Forbes MagazineSung-min Cho, Department of Government, Georgetown University",
        "2013",
        "Dr. Richard C. Bush III, senior fellow at the Brookings Institution and director of its Center for East Asia Policy StudiesGreg Scarlatoiu, executive director of the Committee for Human Rights in North KoreaDavid S. Maxwell, associate director of the Center for Security Studies and the Security Studies Program at Georgetown University",
        "The Lone Star Lecture Series hosts outside scholars of Texas history to deliver a keynote address coinciding with the anniversary of Texas Independence in March of each year. Topics are wide-ranging and can cover any aspect of Texas’ past, from military history, Latinx issues, and economic developments to Lone Star politics and women’s rights.",
        "The Lone Star Lecture Series is the premier annual event of the Dr. Arnoldo De León Department of History at Angelo State and is supported by the Dorsey B. Hardeman Endowed Chair in History. The event is free, open to the public, and designed to bring the ASU community and the people of West Texas together to reflect on issues that have shaped Texas history.",
        "2024",
        "Dr. Leah LaGrone, Weber State University, “Sex Wages: Race, Respectability and Minimum Wage Policies in Texas”",
        "2023",
        "Dr. Miguel Levario, Texas Tech University, “The Myth of the Mexican Nemesis in the 20th Century”",
        "2022",
        "Dr. Donald S. Frazier, Schreiner University, “Tempest over Texas: The American Civil War, Global Politics, and Mexico“",
        "The AEP Distinguished Faculty in Residence Program brings to campus for extended stays authorities in a variety of fields. AEP Professors in Residence have included an Academy Award-winning actor, an award-winning author, a CEO, a classical recording artist, a world-renowned physicist, a nationally syndicated newspaper columnist and a Russian professor of English linguistics.",
        "These experts in their respective fields teach classes, conduct workshops and spend informal time with students and faculty over the course of a semester. In addition to serving as role models to students, the AEP Professors serve as resources for ASU faculty by sharing their first-hand experiences and successes. The program was initiated in 1996 with funding assistance from AEP.",
        "National security, foreign policy, the ramifications of 9/11, environmental issues, Mexican-American history, Russian reforms, deficit reduction and the news media are just some of the topics that have been addressed at ASU’s Community Lectureship in the Humanities. Speakers have included award-winning authors, presidential cabinet members, foreign heads-of-state, high-ranking military officials, historians, TV journalists and poet laureates.",
        "The event was established in 1988 by San Angelo Community Medical Center. The San Angelo Health Foundation has provided funding assistance since its inception.",
        "The International Business Symposium was established in 1997 as a forum for bringing internationally known scholars and business leaders to Angelo State University. The symposium is hosted by the Center for International Studies, the Small Business Development Center and the College of Business.",
        "The symposium was originally funded by the first Title VIB International Education grant from the U.S. Department of Education to the ASU College of Business. Subsequent sponsorship was provided by Aetna Financial, now known as ING Financial Advisers, LLC, and Gary Rodgers, CFP, CPA, ChFC.",
        "The ASU Distinguished Lectureship in Business has become a catalyst for a growing relationship between ASU and the San Angelo business community. Corporate chairs, CEOs and CFOs of companies like Time Warner, Dalcor, USAA and even professional sports teams visit the ASU campus for formal lectures on timely and appropriate business topics.",
        "Many of the speakers have been ASU graduates whose successful business careers serve as successful role models for students and whose entrepreneurial experience offers practical ideas and solutions to the management problems of today. Annual funding from Wells Fargo Bank of San Angelo to the ASU College of Business has underwritten the lectureship since 1995."
    ],
    "list_items": [
        "AcademicsAcademic ProgramsDepartmentsCollegesCoursesAcademic Calendar",
        "Academic Programs",
        "Departments",
        "Colleges",
        "Courses",
        "Academic Calendar",
        "About ASUHistoryCore ValuesNewsTraditionsAbout San AngeloWelcome from the PresidentMission Statement",
        "History",
        "Core Values",
        "News",
        "Traditions",
        "About San Angelo",
        "Welcome from the President",
        "Mission Statement",
        "Admissions & AidApply to ASUAdmitted StudentsRequest More InformationVisit Angelo State UniversityPaying for College",
        "Apply to ASU",
        "Admitted Students",
        "Request More Information",
        "Visit Angelo State University",
        "Paying for College",
        "Life on CampusLivePlayLeadWorkExplore",
        "Live",
        "Play",
        "Lead",
        "Work",
        "Explore",
        "CommunityASU Mayer MuseumAlumni AssociationSmall Business Development CenterWest Texas CollectionNatural History CollectionsKay Bailey Hutchison Center for Cyber Intelligence, Innovation, and Security StudiesLaura W. Bush Institute for Women’s HealthArts at ASUPlanetariumStephens ChapelRanch and Meat MarketASU Ticket OfficeSummer Camps and Conferences",
        "ASU Mayer Museum",
        "Alumni Association",
        "Small Business Development Center",
        "West Texas Collection",
        "Natural History Collections",
        "Kay Bailey Hutchison Center for Cyber Intelligence, Innovation, and Security Studies",
        "Laura W. Bush Institute for Women’s Health",
        "Arts at ASU",
        "Planetarium",
        "Stephens Chapel",
        "Ranch and Meat Market",
        "ASU Ticket Office",
        "Summer Camps and Conferences",
        "Give to ASUMake a GiftSignature EventsJoin",
        "Make a Gift",
        "Signature Events",
        "Join",
        "Athletics",
        "RamPort",
        "Library",
        "Bookstore",
        "Events",
        "Public Health Updates",
        "Administration",
        "Research",
        "Mental Health Services",
        "Title IX/Incident Report",
        "En Español",
        "Current Students",
        "Faculty & Staff",
        "Admitted Students",
        "Military",
        "Parents & Families",
        "Alumni",
        "Visitors",
        "School Counselors",
        "Online Students",
        "Events Calendar",
        "Distinguished Speaker Series",
        "E. James Holland Symposium on American Values",
        "International Education Week",
        "Rambunctious Week",
        "Speaker Series",
        "Springfest",
        "University Interscholastic League",
        "2601 W. Avenue NSan Angelo, TX 76909",
        "1-800-946-8627",
        "Campus Map",
        "Contact ASU",
        "University Directory",
        "RamPort",
        "Jobs at ASU",
        "Facebook",
        "X",
        "Instagram",
        "YouTube",
        "©2024 Angelo State University",
        "All Rights Reserved",
        "Editor Login",
        "TTU System",
        "Texas Tech University",
        "TTU Health Sciences Center",
        "TTUHSC El Paso",
        "Midwestern State University",
        "ASU Privacy Policy",
        "Weather and Emergency Notifications",
        "Mental Health Services",
        "Title IX/Incident Report",
        "State of Texas",
        "Statewide Search",
        "Texas Homeland Security",
        "Texas Veterans Portal",
        "State Auditor’s Office",
        "Fraud Prevention",
        "Site Policies"
    ],
    "table_headers": [
        "Year",
        "Lecturers and Subject",
        "Year",
        "Lecturers and Subject",
        "2024",
        "2023",
        "2022",
        "2019",
        "2018",
        "2017",
        "2016",
        "2015",
        "2014",
        "2013",
        "2012",
        "2011",
        "2010",
        "2009",
        "2008",
        "2007",
        "2006",
        "2005",
        "2004",
        "2003",
        "2002",
        "2001",
        "2000",
        "1999",
        "1998",
        "1997",
        "1996",
        "1995",
        "1994",
        "1993",
        "1992",
        "1991",
        "1990",
        "1989",
        "1988",
        "1987",
        "1986",
        "1985",
        "1984",
        "Year",
        "Lecturers",
        "Year",
        "Writer Bio",
        "2024",
        "2023",
        "2022",
        "2020",
        "2019",
        "2018",
        "2017",
        "2016",
        "2015",
        "2014",
        "2013",
        "2012",
        "2011",
        "2010",
        "2009",
        "2008",
        "2007",
        "2006",
        "2005",
        "2004",
        "2003",
        "2002",
        "2001",
        "2000",
        "1999",
        "1998",
        "Year",
        "Speaker",
        "2024",
        "2023",
        "2022",
        "2020",
        "2019",
        "2018",
        "2017",
        "2016",
        "2015",
        "2014",
        "2013",
        "2012",
        "2011",
        "2010",
        "2009",
        "2008",
        "2007",
        "2006",
        "2004",
        "2003",
        "Year",
        "Speaker",
        "2019",
        "2017",
        "2016",
        "2015",
        "2013",
        "2011",
        "2010",
        "Year",
        "Speaker",
        "2024",
        "2023",
        "2022",
        "Year",
        "Faculty",
        "2010",
        "2006",
        "2004",
        "2003",
        "2002",
        "2001",
        "2000",
        "1998",
        "1997",
        "1996",
        "Year",
        "Lecturer",
        "2008",
        "2007",
        "2006",
        "2005",
        "2004",
        "2002",
        "2001",
        "2000",
        "1999",
        "1998",
        "1997",
        "1996",
        "1995",
        "1994",
        "1993",
        "1992",
        "1991",
        "1990",
        "1989",
        "1988",
        "Year",
        "Speakers",
        "2011",
        "2010",
        "2009",
        "2008",
        "2006",
        "2005",
        "2003",
        "2002",
        "2001",
        "2000",
        "1999",
        "1998",
        "1997",
        "Year",
        "Lecturers",
        "2014",
        "2013",
        "2010",
        "2008",
        "2007",
        "2006",
        "2005",
        "2004",
        "2003",
        "2002",
        "2001",
        "2000",
        "1999",
        "1998",
        "1997",
        "1996",
        "1995"
    ],
    "table_data": [
        "2024",
        "Dr. Alex Filippenko, Distinguished Professor of Astronomy, University of California, Berkeley, Richard and Rhoda Goldman Distinguished Professor in the Physical Sciences, University of California, Berkeley",
        "2023",
        "Dr. Alfredo Quinones-Hinojosa surgeon and scientist for the Mayo Clinic; Co-Founder of Mission: Brain Foundation",
        "2022",
        "Dr. Alex Filippenko, Distinguished Professor of Astronomy, University of California, Berkeley, Richard and Rhoda Goldman Distinguished Professor in the Physical Sciences, University of California, Berkeley",
        "2019",
        "Dr. Angela M. Belcher, James Mason Crafts Professor of Biological Engineering and Materials Science & Engineering at the Massachusetts Institute of Technology; Co-director of the Bio Energy Sciences Low Carbon Center, MIT; Member of the David H. Cock Institute for Integrative Cancer Research, MIT",
        "2018",
        "Dr. Priyamvada Natarajan, Professor, Departments of Astronomy and Physics, Yale University; Director, Franke Program in Science and Humanities, Yale University; Associate, Dark Cosmology Center, Niels Bohr Institute, University of Copenhagen, Denmark",
        "2017",
        "Dr. John P. Smol, professor at Queen’s University, Kingston, Ontario, and co-director of the Paleoecological Environmental Assessment and research Laboratory (PEARL)",
        "2016",
        "Dr. Huda Zoghbi, professor of pediatrics, neurology, neuroscience, and molecular and human genetics at Baylor University College of Medicine",
        "2015",
        "Dr. Jocelyn Bell Burnell, visiting professor of astrophysics at Oxford University in England",
        "2014",
        "Dr. Nathan Wolfe, founder and CEO of the Global Viral independent research institute and Metabiota, a company specializing in microbiological research, products and services",
        "2013",
        "Dr. Edward B. Burger, the Francis Christopher Oakley Third Century Professor of Mathematics at Williams College",
        "2012",
        "Dr. Jack Farmer, professor of geological sciences at Arizona State University",
        "2011",
        "Dr. Susan L. Lindquist, professor of biology at Massachusetts Institute of Technology, investigator at the Howard Hughes Medical Institute, member of the Whitehead Institute for Biomedical Research, and associate member of the Koch Institute for Integrative Cancer Research at MIT",
        "2010",
        "Dr. Ahmed Zewail, Nobel Prize winner and Linus Pauling Professor of Chemistry and professor of physics at California Institute of Technology (Caltech)",
        "2009",
        "Dr. Christopher M. Dobson, John Humphrey Plummer Professor of Chemical and Structural Biology and Master of St. John’s College, University of Cambridge",
        "2008",
        "Jeffrey D. Macklis, M.D., Director, Massachusetts General Hospital-Harvard Medical School Center for Nervous System Repair, Professor of Neuroscience, Neurosurgery and Neurology, Harvard University",
        "2007",
        "Joseph H. Taylor, Ph.D., 1993 Nobel Laureate in Physics, James S. McDonnell Distinguished University Professor, Princeton University",
        "2006",
        "Leroy Hood, M.D., Ph.D., President, Institute for Systems Biology",
        "2005",
        "Rita Colwell, Ph.D., Chair, Canon U.S. Life Science, Inc., and Former President, National Science Foundation",
        "2004",
        "Mary-Claire King, Ph.D., American Cancer Society Research Professor, Departments of Medicine (Medical Genetics) and Genome Sciences, University of Washington School of Medicine",
        "2003",
        "J. William Schopf, Ph.D., Director, Center for the Study of Evolution and the Origin of Life, University of California at Los Angeles",
        "2002",
        "Polly Celine Eveline Matzinger, Ph.D., Head, Section on T-Cell Tolerance and Memory, Ghost Lab, Laboratory of Cellular and Molecular Immunology, National Institute of Allergy and Infectious Disease, National Institutes of Health",
        "2001",
        "Ferid Murad, M.D., (Nobel Laureate: Medicine) Professor and Chair, Department of Integrative Biology, Pharmacology and Physiology, and Director, Institute of Molecular Medicine, University of Texas Health Science Center at Houston",
        "2000",
        "F. Sherwood Rowland, Ph.D., (Nobel Laureate: Chemistry), Donald Bren Research Professor of Chemistry and Earth System Science, University of California at Irvine",
        "1999",
        "Keith L. Black, M.D., Director, Division of Neurosurgery, Cedars-Sinai Medical Center; Director, Cedars-Sinai Comprehensive Brain Tumor Program; and Director, Cedars-Sinai Neurological Institute",
        "1998",
        "Sylvia A. Earle, Ph.D., Founder and Chairman, Deep Ocean Exploration and Research, Inc, and National Geographic’s Explorer in Residence",
        "1997",
        "Thomas R. Cech, Ph.D. (Nobel Laureate: Chemistry), Distinguished Professor of Chemistry and Biochemistry and of Molecular, Cellular and Developmental Biology, University of Colorado",
        "1996",
        "Alfred G. Gilman, M.D. (Nobel Laureate: Medicine), Professor and Chairman, Department of Pharmacology, University of Texas Southwestern Medical Center",
        "1995",
        "Eugene M. Shoemaker, Ph.D., Scientist Emeritus, U.S. Geological Survey",
        "1994",
        "C. Thomas Caskey, M.D., Director, Human Genome Center, and Chair, Department of Human and Molecular Genetics, Baylor College of Medicine",
        "1993",
        "Donald C. Johanson, Ph.D., President, Institute of Human Origins",
        "1992",
        "Chen Ning Yang, Ph.D. (Nobel Laureate: Physics), Director of the Theoretical Physics Department, State University of New York",
        "1991",
        "Lynn Margulis, Ph.D., Distinguished University Professor of Botany, University of Massachusetts",
        "1990",
        "Leon Richard Kass, Ph.D., Professor, University of Chicago",
        "1989",
        "Cyril Ponnamperuma, Ph.D., Director, Laboratory of Chemical Evolution, and Professor of Chemistry, University of Maryland",
        "1988",
        "Michael S. Brown, M.D. (Nobel Laureate: Medicine), Professor of Medicine and Genetics and Director of the Center for Genetic Disease, Southwestern Medical School at Dallas",
        "1987",
        "Hans Mark, Ph.D., Chancellor, University of Texas System, and former Deputy Administrator, National Aeronautics and Space Administration",
        "1986",
        "Donald C. Johanson, Ph.D., paleoanthropologist",
        "1985",
        "Arthur Guyton, M.D., Chairman, Department of Physiology and Biophysics, University of Mississippi School of Medicine",
        "1984",
        "Har Gobind Khorana, Ph.D. (Nobel Laureate: Physiology), Professor, Massachusetts Institute of Technology",
        "1983",
        "Tanya M. Atwater, Ph.D., Professor of Marine Geophysics, University of California at Santa Barbara",
        "1982",
        "Kip S. Thorne, Ph.D., Professor of Theoretical Physics, California Institute of Technology",
        "1981",
        "D. Carleton Gajdusek, M.D. (Nobel Laureate: Medicine), Director of the Study of Child Growth and Development and Disease Patterns in Primitive Cultures, National Institutes of Health",
        "1980",
        "Frederick Chapman Robbins, M.D. (Nobel Laureate: Medicine), Dean, School of Medicine, Case Western Reserve University",
        "1979",
        "George W. Beadle, Ph.D. (Nobel Laureate: Biology), President Emeritus, University of Chicago; and W. O. Milligan, Ph. D., Director of Research, Robert A. Welch Foundation",
        "1978",
        "Linus Pauling, Ph.D. (Nobel Laureate: Chemistry; Nobel Laureate: Peace), Research Professor, Linus Pauling Institute of Science and Medicine, and Professor Emeritus of Chemistry, Stanford University",
        "1977",
        "Humberto Fernandez-Moran, M.D., Ph.D., Pritzker Professor of Biophysics, University of Chicago",
        "Dr. Renee Hobbs, professor of communication studies at the University of Rhode Island and founder of the Media Education Lab.",
        "Patrick Jagoda, William Riney Harper Professor of English and Cinema and Media Studies at the University of Chicago, and Ashlyn Sparrow, Assistant Director of the Weston Game Lab at the University of Chicago",
        "Julie Giroux, orchestrator, composer, arranger, clinician and guest conductor",
        "Mr. Kyle Emile, founder and Executive Director of the non-profit organization Free Intelligent Conversation",
        "Sonia Manzano, “Maria” from “Sesame Street” and best-selling author",
        "Dr. Zeynep Tufekci, associate professor in the School of Information and Library Science at the University of North Carolina, writer and “techno-sociologist”",
        "Dr. John McWhorter, associate professor of English and comparative literature at Columbia University, linguist and best-selling author",
        "Retired Col. Eileen Collins, retired NASA and Air Force Colonel and the first woman to command an American spacecraft",
        "Ian Cheney, award-winning documentary filmmaker and 2014-15 Knight Science Journalism Fellow at MIT",
        "Dr. Michael E. Mann, director of the Earth Science Center and distinguished professor of meteorology at Pennsylvania State University, and author ofDire Predictions: Understanding GlobalWarmingandThe Hockey Stick and the Climate Wars: Dispatches from the Front Lines",
        "Jeffery Lyons, Television and Film Critic",
        "Frank Deford, author, Emmy award-winning journalist, commentator and humanitarian",
        "Dr. James Katz, chair of the Rutgers University Department of Communication, and Howard Rheingold, author and pioneer expert on the internet",
        "Dr. Leiyu Shi, professor of health policy and health services research at Johns Hopkins University, and Dr. Gregory Stevens, assistant professor and associate director of research in the Center for Community Health Studies at the University of Southern California",
        "Dr. John Gilliom, Professor of Political Science, Ohio University, and Dr. Torin Monahan, Associate Professor of Human and Organizational Development and Associate Professor of Medicine, Vanderbilt University",
        "Dr. Katherine Donato, Professor of Sociology, Vanderbilt University, and Dr. Jorge Durand, Professor of Anthropology, University of Guadalajara, Mexico",
        "Dr. Scott Appleby, Professor of History, Notre Dame University, and Dr. Jeffrey Kaplan, Associate Professor of Religion, University of Wisconsin-Oshkosh",
        "Dr. Peter A. Walker, Professor of Environmental Studies, University of Oregon, and Dr. Howard Margolis, Professor of Public Policy, University of Chicago",
        "Dr. David Popenoe, Professor of Sociology, Rutgers University, and Dr. Stephanie Coontz, Professor of History and Family Studies, Evergreen State College",
        "Dr. Kamran Aghaie, Associate Director, Center for Middle Eastern Studies, University of Texas at Austin, and Dr. Thomas Gouttierre, Dean of International Studies and Director, Center for Afghanistan Studies, University of Nebraska",
        "Dr. Regina Barreca, Author of They Used to Call Me Snow White, But I Drifted, and Dr. Lawrence E. Mintz, Founder and President, International Society of Humor Studies",
        "Dr. David Barash, Professor of Psychology, University of Washington, and author of Understanding Violence, and Dr. Roy F. Baumeister, author ofEvil: Inside Violence and Cruelty",
        "Dr. Robert V. Friedenberg, Professor of Communication, Miami University of Ohio, and Dr. Richard Davis, Professor of Government, Brigham Young University",
        "Dr. Carlos Munoz, Jr., Professor of Ethnic Studies, University of California, and Dr. Alan Wolfe, Professor of Political Science and Director of the Center for Religion and American Public Life, Boston College",
        "Dr. Lynn Spigel, Professor and Chair, Critical Studies Division, Department of Cinema and Television, University of South California; C. Edwin Baker, Gallicchio Professor of Law, University of Pennsylvania; and Dr. Angela M. S. Nelson, Director of the Center for Popular Culture Studies, Department of Popular Culture, Bowling Green State University",
        "Dr. James Davison Hunter, William R. Kenan Professor of Sociology and Religious Studies and Director of the Post-Modernity Project, University of Virginia; Grace Palladino, Co-Director and Editor of The Samuel Gompers Papers, University of Maryland; and William Strauss, writer, historian, lecturer, theatrical director and entertainer",
        "Anne Wells Branscomb, President, The Raven Group, and Research Associate, Harvard University Program on Information Resources Policy; Gary Chapman, Coordinator, 21st Century Project, Lyndon Baines Johnson School of Public Affairs, University of Texas at Austin; and Dr. Steve Jones, Chair, Communication Department, and Co-Director of the Center for Research on Information, University of Tulsa",
        "Dr. Stanley Eitzen, Professor Emeritus of Sociology, Colorado State University; Dr. Mimi Murray, Buxton Professor of Physical Education, Springfield College; and Dr. Benjamin G. Rader, Professor of History, University of Nebraska-Lincoln",
        "Dr. Michael A. Hitt, Professor of Management and Robertson Chair in Business Administration, Texas A&M University; Anne L. Heald, Executive Director, Center for Learning and Competitiveness, School of Public Affairs, University of Maryland; and Dr. Robert Perrucci, Professor of Sociology, Purdue University",
        "Dr. Ralph J. Cicerone, Aldrich Professor of Geosciences, University of California; Dr. Daniel Simberloff, Lawton Distinguished Professor in Biological Sciences, Florida State University; and Dr. William E. Riebsame, Associate Professor of Geography, University of Colorado at Boulder",
        "Dr. Arnold R. Hirsch, Professor of History, College of Urban and Public Affairs, University of New Orleans; Dr. David E. Hayes-Bautista, Professor of Medicine and Director of Chicano Studies Research Center, University of California; and Dr. Samuel L. Myers, Wilkins Professor of Human Relations and Social Justice, Hubert H. Humphrey Institute of Public Affairs, University of Minnesota",
        "Dr. Barbara J. Callaway, Associate Provost for Academic Affairs and Professor of Political Science, Rutgers University; Dr. James M. McCormick, Professor of Political Science, Iowa State University; and Dr. Barry Rubin, Lecturer in International Affairs, Johns Hopkins School of Advanced International Studies",
        "Dr. James L. Gumnnick, Executive Director for Research, St. Francis Regional Medical Center, Wichita, Kansas; Dr. George K. Schweitzer, Alumni Distinguished Professor of Chemistry, University of Tennessee; and Dr. Judith P. Swazey, President of the Acadia Institute, Bar Harbor, Maine",
        "Dr. Elizabeth Johns, Professor of the History of Art, University of Pennsylvania; Wayne Lawson, Executive Director, Ohio Arts Council; and Doris Betts, Alumni Distinguished Professor of English, University of North Carolina",
        "Dr. Michael W. Kirst, Professor of Education, Stanford University; Demos P. Doyle, Senior Research Fellow, Hudson Institute; and Dr. Arthur E. Wise, Director, Center for the Study of the Teaching Profession, The RAND Corporation",
        "Dr. Walter F. Berns, John M. Olin University Professor, Georgetown University; Dr. Deborah L. Rhode, Professor of Law, Stanford University Law School; and Dr. Walter F. Murphy, McCormick Professor of Jurisprudence, Princeton University",
        "Dr. Joe B. Frantz, Turnbull Professor of History, Corpus Christi State University, and Former Chair, History Department, University of Texas at Austin; Jared E. Hazleton, President, Texas Research League, and Former Dean, Graduate School of Public Affairs, University of Washington in Seattle; and Peter C. Bishop, Chair, Studies of the Future Program, University of Houston at Clear Lake City",
        "Dr. Michael R. Rion, President, Hartford Seminary; Dr. Patricia H. Werhane, Associate Professor and Associate Academic Dean, College of Arts and Sciences, Loyola University; and Dr. Richard T. De George, University Distinguished Professor, University of Kansas",
        "Dr. Elsie Boulding, Chair, Department of Sociology, Dartmouth College; Dr. Peter A. French, Lennox Distinguished Professor of the Humanities and Professor of Philosophy, Trinity University; and Dr. William H. McNeill, Millikan Distinguished Service Professor, University of Chicago",
        "2022",
        "Lee Hill and Alexis Serio, Texas-based contemporary painters",
        "2021",
        "Annie Varnot, New York-based contemporary painter",
        "2019",
        "Sammy Peters, Arkansas-based abstract painter",
        "2017",
        "Lydia Dildilian, Wisconsin-based painter",
        "2016",
        "Jim Woodson, New Mexico-based contemporary artist",
        "2015",
        "Howard Sherman, Houston-based contemporary artist",
        "2013",
        "Sharon Booma, Massachusetts-based contemporary painter",
        "Manuel Muñoz, critically acclaimed short-story writer; recipient of a MacArthur Genius Grant",
        "Dr. Brandon Hobson, critically acclaimed fiction writer",
        "Naomi Shihab Nye, poet, fiction writer and children’s literature author",
        "Laila Lalami, award-winning author, professor of creative writing at the University of California at Riverside, winner of the American Book Award and Arab-American Book Award, finalist for the Pulitzer Prize for Fiction",
        "Chitra Banerjee Divakaruni, award-winning poet and best-selling author; Betty and Gene McDavid Professor of Creative Writing at the University of Houston; winner of the Allen Ginsberg Poetry Prize and American Book Award",
        "Brian Turner, poet and memoirist; director of the Master of Fine Arts in creative writing program at Sierra Nevada College and author of “My Life as a Foreign Country,” “Phantom Noise” and “Here, Bullet.”",
        "Anne Hillerman, journalist, newspaper editor and best-selling author of three novels in the Joe Leaphorn Navajo Mysteries series; winner of the New Mexico Book Award, Mountains and Plains Booksellers Award and Western Writers of America Spur Award; Co-founder and director of the Santa Fe-based WORDHARVEST Writers Workshop and the Tony Hillerman Writers Conference",
        "Craig Johnson, award-winning author of 12 novels in the Walk Longmire mystery series and the inspiration for the A&E/Netflix TV series “Longmire,” winner of the Western Writers of America’s Spur Award, Independent Booksellers’ Book of the Year Award, Publishers Weekly Best Book of the Year Award and Library Journal Best Mystery of the Year Award",
        "Dan Chaon, Delaney Associate Professor of Creative Writing and co-director of the Creative Writing Program at Oberlin College in Ohio, author of three short story collections and two novels, winner of the Academy Award in Literature from the American Academy of Arts and Letters in 2006.",
        "Juan Felipe Herrera, poet laureate of California and author of 29 books of poetry, prose, plays, children’s stories and young adult novels, includingHalf of the World in Light, which won the National Book Critics’ Circle Award, and his bilingual memoir,Calling The Doves/El Canto De Las Palomas, which won the Friends of Children and Literature (FOCAL) Award and Ezra Jack Keats Award",
        "Cristina García, author of “Lesser Tragedy of Death,” “The Lady Matador’s Hotel,” “A Handbook to Luck” and others. Winner of Guggenheim Fellowship, Whiting Writer’s Award, Princeton University’s Hodder Fellowship and a National Endowment for the Arts Grant",
        "Leslie Marmon Silko, One of the great masters of Native American Literature. Winner of the Native Writers’s Circle of the Americas Lifetime Achievement Award. Author of “The Turqoise Ledge: A Memoir,” “After a Summer Rain in the Upper Sonoran,” “Almanac of the Dead” and “Ceremony.”",
        "Art Spiegelman, author of Pulitzer Prize-winning “Maus 1: A Survivor’s Tale,” “Maus II: And Here My Troubles Begin,” “In the Shadow of No Towers,” “Breakdowns: A Portrait of an Artist as a Young %@&*!”",
        "Mary Karr, award-winning poet and author. Besides her New York Times best-selling memoir, “The Liar’s Club.” Kar also wrote sequels, “Cherry and Lit,” published in 2009. Her works include “Sinners Welcome,” “Viper Rum” and “The Devil’s Tour.”",
        "Terrance Hayes, Award-winning poet and author of “Wind in a Box,” “Hip Logic” and “Muscular Music.”",
        "Luis Valdez, author of “Zoot Suit,” “La Bamba,” “Cisco Kid” and “Corridos: Tales of Passion and Revolutions.”",
        "Tobias Wolff, author of “This Boy’s Life,” “Old School, In Pharaoh’s Army: Memories of the Lost War” and “Barrack’s Thief.”",
        "Tim O’Brien, author of “If I Die in a Combat Zone, Box Me Up and Ship me Home”; “The Things They Carried”; and “July, July.”",
        "Gordon Weaver, author of “Count a Lonely Cadence,” “The Way We Know in Dreams” and “The Eight Corners of the World.”",
        "Peter Hedges, author of “What’s Eating Gilbert Grape.”",
        "Naomi Shihab Nye, author of “19 Varieties of Gazelle,” “Fuel,” “Hugging the Jukebox,” “Red Suitcase” and “Words Under Words.”",
        "Stephen Harrigan, author of “The Gates of the Alamo” and “Comanche Midnight.”",
        "Reginald McKnight, author of “The Kind of Light that Shines on Texas” and “African American Wisdom.”",
        "Denise Chavez, author of “The Last of the Menu Girls” and “Face of an Angel.”",
        "W.P. Kinsella, author of “Shoeless Joe,” basis for the movie “Field of Dreams.”",
        "Rudolfo Anaya, author of “Bless Me, Ultima.”",
        "Jeffrey Feltman, former U.S. Special Envoy for the Horn of Africa",
        "Ambassador Larry C. Napper, Former U.S. ambassador to Latvia and Kazakhstan",
        "Ambassador Tibor Nagy, Assistant Secretary of State for African Affairs (Ret.)",
        "Jonathan Fantini Porter, former national security official in the Executive Office of the President; member of the U.S. Advisory Board for the United Nations Refugee Agency",
        "Earl Anthony Wayne, former U.S. ambassador to Mexico and Argentina",
        "Dr. Jack Matlock, former ambassador to the Soviet Union and senior director for European and Soviet Affairs in the National Security Council",
        "Mark Feierstein, former special assistant to the president and senior director for western hemisphere affairs on the National Security Council",
        "James N. Purcell, Jr., chairman of the U.S. Association for International Migration, former assistant secretary of state of the State Department’s Bureau for Refugee Programs",
        "James A Larocco, former U.S. ambassador to Kuwait, former director general of the Multinational Force and Observers on the Sinai Peninsula, former deputy assistant secretary of state for Near East affairs",
        "Robert Hunter, former U.S. Ambassador to NATO who is a senior fellow at the Center for Transatlantic Relations of Johns Hopkins University",
        "Robert E. Gribbin, former U.S. Ambassador to Rwanda and Central African Republic",
        "Molly Williamson, Middle East Institute Scholar",
        "Ambassador Laurence Pope",
        "Charles Ford, former U.S. Ambassador",
        "David J. Firestein, Senior Advisor, U.S. Advisory Commission on Public Diplomacy, U.S. Department of State",
        "Thomas Dodd, Former Ambassador to Costa Rica and Uruguay.",
        "Edward Peck, Former Ambassador to Iraq and Mauritania.",
        "Tibor P. Nagy Jr., Former Ambassador to Guinea and Ethiopia.",
        "John W. Limbert, President, American Foreign Service Association, and Former Ambassador to Mauritania.",
        "Michael Ely, Former Deputy Ambassador to the European Communities, Brussels.",
        "George Hutchinson, managing editor, International Journal of Korean StudiesWilliam Newcomb, former member, United National Panel of ExpertsGreg Scarlatoiu, executive director, Committee for Human Rights in North KoreaMark Tokola, vice president, Korea Economic Institute",
        "Mark Tokola, vice president of the Korea Economic InstituteGen. John Tilelli, U.S. Army (retired)Greg Scarlatoiu, executive director of the Committee for Human Rights in North KoreaDr. Bruce Bechtol, ASU professor of political science",
        "Troy Stangarone, senior director of congressional affairs and trade, Korea Economic InstituteGen. Chun In-Bum, Republic of Korea Army (retired), and visiting fellow, Brookings InstituteDr. Dlynn Armstrong-Williams, chair of the Political Science and International Affairs Department, University of North GeorgiaDr. Bruce Bechtol, ASU professor of political science",
        "Mark Tokola, vice president of the Korea Economic InstituteDr. Tara O, Asia policy specialist at the Center for Strategic and International Studies and board member of the International Council on Korean StudiesGordan Chang, columnist for Forbes MagazineSung-min Cho, Department of Government, Georgetown University",
        "Dr. Richard C. Bush III, senior fellow at the Brookings Institution and director of its Center for East Asia Policy StudiesGreg Scarlatoiu, executive director of the Committee for Human Rights in North KoreaDavid S. Maxwell, associate director of the Center for Security Studies and the Security Studies Program at Georgetown University",
        "Alberto Gonzales, former U.S. Attorney General and visiting professor at Texas Tech University",
        "Michael D. Phillips, military assistant to the U.S. ambassador to the Balkans during the armed conflict between Serbs and Kosovars in the early 1990s",
        "Dr. Leah LaGrone, Weber State University, “Sex Wages: Race, Respectability and Minimum Wage Policies in Texas”",
        "Dr. Miguel Levario, Texas Tech University, “The Myth of the Mexican Nemesis in the 20th Century”",
        "Dr. Donald S. Frazier, Schreiner University, “Tempest over Texas: The American Civil War, Global Politics, and Mexico“",
        "Dr. Mun Ga Kang, political science professor at Kyungnam University, South Korea",
        "Igor Tolochin, Professor of English Linguistics, University of St. Petersburg, Russia.",
        "Frederick Moyer, Classical Pianist and Recording Artist.",
        "Dr. D. Stanley Eitzen, Professor Emeritus of Sociology, Colorado State University.",
        "William W. “Bill” Maxwell, Nationally Syndicated Editorial Writer and Columnist, St. Petersburg Times.",
        "E.R. “Dick” Brooks, former Chairman and Chief Executive Officer, Central and South West Corporation.",
        "Edward Rowell, former U.S. Ambassador to Luxembourg, Portugal and Bolivia.",
        "Dr. Jay Davis, Director, Defense Threat Reduction Agency, U.S. Department of Defense, and World-renowned physicist.",
        "Karl Malden, Academy Award-winning Actor of Screen, Stage and Television.",
        "Elmer Kelton, Spur Award-winning Western Author.",
        "Maureen Dowd, Pulitzer Prize-winning columnist for the New York Times Op-Ed page",
        "James D. “Denny” Shelton, former Chairman and CEO, Triad Hospitals Inc.",
        "Catherine Crier, TV Journalist, “Catherine Crier Live,” Court TV.",
        "Richard Haass, President of the Council on Foreign Relations and former Director of Policy Planning for the U.S. Department of State.",
        "Gen. Barry R. McCaffrey, Bradley Distinguished Professor of International Security Studies, United States Military Academy; former Army Commander; and National Drug Policy Director.",
        "James A. Baker III, former U.S. Secretary of State, former U.S. Secretary of the Treasury and former White House Chief of Staff.",
        "Rick Bass, Nature Writer and Environmentalist.",
        "Dr. Ramon Eduardo Ruiz, Pre-eminent Historian on Mexico.",
        "Sergei N. Khrushchev, Authority on Russian Economics and Political Reform and son of former Soviet Premier Nikita Khrushchev.",
        "Warren Rudman, former U.S. Senator and Co-Author of the 1985 Gramm-Rudman-Hollings Deficit Reduction Bill.",
        "John Wheat, Sound Archivist, Center for American History, University of Texas at Austin.",
        "Lloyd M. Bentsen, former U.S. Senator and Secretary of the Treasury.",
        "Shelby Foote, Civil War Historian and Author of the three-volume The Civil War: A Narrative.",
        "Margaret Thatcher, British Prime Minister, 1979-90.",
        "James H. Billington, Librarian of Congress.",
        "Elspeth Rostow, Political Analyst, Author, Educator, Chairman of the Board, U.S. Institute of Peace, and Stiles Professor Emerita in American Studies, LBJ School of Public Affairs, University of Texas.",
        "Larry McMurtry, Pulitzer Prize-Winning Author of Lonesome Dove.",
        "Richard Wilbur, Poet Laureate Emeritus of the United States.",
        "Dr. Robert Legvold, Director, W. Averell Harriman Institute for Advanced Study of the Soviet Union, Columbia University.",
        "Robert Norman William Blake, Baron Blake of Braydeston, British historian.",
        "Chris Whatley, Angelo State University alum and office director of the Council of State Governments (CSG) in Washington, D.C.",
        "Dr. Masaaki Kotabe, holder of the Washburn Chair in International Business and Marketing at Temple University",
        "Dr. Eugenio J. Alemán, Senior Economist and Vice President, Wells Fargo Bank.",
        "Dr. Pietra Rivoli, Professor of Finance and International Economics, Georgetown University, and Dr. Antonio Rios Ramirez, Dean of Graduate Research and Development, Monterrey Institute of Technology, Chihuahua, Mexico.",
        "Dr. William C. Gruben, Director, Center for Latin American Economics, and Vice President, Federal Reserve Bank of Dallas.",
        "Margaret Hanson-Muse, Senior Commercial Office, U.S. Embassy, Lima, Peru.",
        "Ian Browde, Vice President of Development, Nokia.",
        "Dr. Jeffrey Wigand, Founder of Smoke Free Kids Foundation and subject of the movie “The Insider.”",
        "Paul Solman, business and economics correspondent for the NewsHour with Jim Lehrer on PBS.",
        "Floyd Nickerson, Vice President of Central Southwest Energy.",
        "David Galloway, Senior Principal with the General Secretariat of the Council of the European Union, Brussels, Belgium.",
        "Dr. Massaki Kotabe, Washburn Chair and Professor of International Business and Marketing, Fox School of Business, Temple University.",
        "Eva Kraus, author of Cross-Cultural Issues.",
        "Liliana Salazar, Senior Vice President and Employee Benefits Compliance Practice Co-Leader, Wells Fargo Insurance",
        "Liliana Salazar, Senior Vice President and Employee Benefits Compliance Practice Co-Leader, Wells Fargo Insurance",
        "Alvin New, San Angelo mayor and former president and CEO of Town & Country Food Stores",
        "Mark Low, founder and CEO, Juno Energy",
        "Mark Homer, Owner, Homer Enterprises, Texas State Representative, District 3",
        "M. Dale Dodson, CPA, Chief Executive Officer, Dalcor Companies",
        "Kelby Hagar, Serial Entrepreneur and President and CEO, Digital Witness, LLC",
        "Kevin Carroll, “Katalyst,” Special Projects Division, Nike",
        "Michael H. (Mike) Millegan, Senior Vice President-Logistics, Verizon",
        "Landel C. Hobbs, Executive Vice President and Chief Financial Officer, Time Warner Cable",
        "Patricia Diaz Dennis, Senior Vice President, Regulatory & Public Affairs, SBC Communications Inc.",
        "Linda Alvarado, President, Alvarado Construction Inc., and Limited Partner, Colorado Rockies Major League Baseball Team",
        "E.R. “Dick” Brooks, Chairman and CEO, Central and South West Corp.",
        "Drayton McLane Jr., Chairman, McLane Group, L.P., Houston Astros Baseball Club, Astrodome USA",
        "David Hirschfeld, Chairman and CEO, Hirschfeld Steel Co., Inc. and F.L. “Steve” Stephens, Chairman and CEO, Town & Country Food Stores, Inc.",
        "Richard M. Kovacevich, Chairman and CEO, Norwest Corp.",
        "Robert T. Herres, Chairman and CEO, USAA"
    ],
    "captions": [
        "Distinguished Lecturers",
        "Holland Lecturers",
        "Featured Lecturers",
        "Featured Writers",
        "Holland-Harrell Speakers",
        "Symposium Speakers",
        "Lone Star Lecture Series Speakers",
        "AEP Faculty in Residence",
        "Featured Lecturers",
        "Symposium Speakers",
        "Featured Lecturers"
    ],
    "links": [
        "#main-content",
        "/",
        "/academics/",
        "/academics/programs/",
        "/departments/",
        "/colleges/",
        "/courses/",
        "/current-students/registrar/academic_calendar.php",
        "/about-asu/",
        "/about-asu/history.php",
        "/about-asu/core-values/",
        "/about-asu/news/",
        "/about-asu/traditions/",
        "/about-asu/san-angelo.php",
        "/about-asu/president/",
        "/about-asu/mission-statement.php",
        "/admissions-and-aid/",
        "/admissions-and-aid/apply/",
        "/admissions-and-aid/admitted/",
        "/admissions-and-aid/info/",
        "/admissions-and-aid/visit/",
        "/admissions-and-aid/paying-for-college/",
        "/life-on-campus/",
        "/life-on-campus/live/",
        "/life-on-campus/play/",
        "/life-on-campus/lead/",
        "/life-on-campus/work/",
        "/life-on-campus/explore/",
        "/community/",
        "/community/mayer-museum/",
        "/alumni/",
        "/community/small-business-development-center/",
        "/community/west-texas-collection/",
        "/departments/biology/angelo-state-natural-history-collection/",
        "/community/kay-bailey-hutchison-center/",
        "/colleges/archer-college-of-health-and-human-services/laura-w-bush-institute-for-womens-health/",
        "/departments/visual-performing-arts/theatre/subscriptions.php",
        "/departments/physics-geosciences/planetarium/",
        "/community/stephens-chapel.php",
        "/community/asu-ranch/",
        "/community/ticket-office/",
        "/community/summer-camps-and-conferences/",
        "/give/",
        "/give/make_gift/",
        "/give/signature-events/",
        "/give/join/",
        "https://www.angelosports.com/",
        "https://ramport.angelo.edu/",
        "/library/",
        "http://bookstore.angelo.edu/",
        "/events/",
        "/public-health/",
        "/administrative-support/",
        "/research/",
        "/current-students/counseling-services/",
        "/current-students/title-ix/",
        "/en-espanol/",
        "/current-students/",
        "/faculty-and-staff/",
        "/admissions-and-aid/admitted/",
        "/active-duty-veterans/",
        "/parents-and-families/",
        "/alumni/",
        "/visitors/",
        "/school-counselors/",
        "/online/",
        "/events/",
        "/events/calendar/",
        "/events/distinguished-speaker-series/",
        "/events/holland-symposium/",
        "/events/international-education-week/",
        "/events/rambunctious.php",
        "/events/speaker-series/",
        "/events/springfest/",
        "/events/uil/",
        "/",
        "/events/",
        "/events/calendar.php",
        "/colleges/college-of-science-and-engineering/moon-lectureship/",
        "tel:18009468627",
        "/map/",
        "/contact/",
        "/directory/",
        "https://ramport.angelo.edu/",
        "/work-at-asu/",
        "https://www.facebook.com/angelostateuniversity",
        "https://twitter.com/AngeloState",
        "https://www.instagram.com/angelostate/",
        "https://www.youtube.com/user/AngeloStateU",
        "/livewhale/?login&referer=1",
        "http://www.texastech.edu/",
        "https://www.ttu.edu/",
        "https://www.ttuhsc.edu/",
        "https://elpaso.ttuhsc.edu/",
        "https://msutexas.edu/",
        "https://apps.highered.texas.gov/resumes/",
        "/privacy_policy.php",
        "/emergency-notifications/",
        "/current-students/counseling-services/",
        "/current-students/title-ix/",
        "https://www.texas.gov/",
        "https://www.tsl.texas.gov/trail/index.html",
        "https://gov.texas.gov/organization/hsgd",
        "https://veterans.portal.texas.gov/",
        "https://sao.fraud.texas.gov/",
        "/administrative-support/audit-services/fraud_prevention.php",
        "/site-policies/"
    ],
    "tables": [
        [
            [
                "Year",
                "Lecturers and Subject"
            ],
            [
                "2024",
                "Dr. Alex Filippenko, Distinguished Professor of Astronomy, University of California, Berkeley, Richard and Rhoda Goldman Distinguished Professor in the Physical Sciences, University of California, Berkeley"
            ],
            [
                "2023",
                "Dr. Alfredo Quinones-Hinojosa surgeon and scientist for the Mayo Clinic; Co-Founder of Mission: Brain Foundation"
            ],
            [
                "2022",
                "Dr. Alex Filippenko, Distinguished Professor of Astronomy, University of California, Berkeley, Richard and Rhoda Goldman Distinguished Professor in the Physical Sciences, University of California, Berkeley"
            ],
            [
                "2019",
                "Dr. Angela M. Belcher, James Mason Crafts Professor of Biological Engineering and Materials Science & Engineering at the Massachusetts Institute of Technology; Co-director of the Bio Energy Sciences Low Carbon Center, MIT; Member of the David H. Cock Institute for Integrative Cancer Research, MIT"
            ],
            [
                "2018",
                "Dr. Priyamvada Natarajan, Professor, Departments of Astronomy and Physics, Yale University; Director, Franke Program in Science and Humanities, Yale University; Associate, Dark Cosmology Center, Niels Bohr Institute, University of Copenhagen, Denmark"
            ],
            [
                "2017",
                "Dr. John P. Smol, professor at Queen’s University, Kingston, Ontario, and co-director of the Paleoecological Environmental Assessment and research Laboratory (PEARL)"
            ],
            [
                "2016",
                "Dr. Huda Zoghbi, professor of pediatrics, neurology, neuroscience, and molecular and human genetics at Baylor University College of Medicine"
            ],
            [
                "2015",
                "Dr. Jocelyn Bell Burnell, visiting professor of astrophysics at Oxford University in England"
            ],
            [
                "2014",
                "Dr. Nathan Wolfe, founder and CEO of the Global Viral independent research institute and Metabiota, a company specializing in microbiological research, products and services"
            ],
            [
                "2013",
                "Dr. Edward B. Burger, the Francis Christopher Oakley Third Century Professor of Mathematics at Williams College"
            ],
            [
                "2012",
                "Dr. Jack Farmer, professor of geological sciences at Arizona State University"
            ],
            [
                "2011",
                "Dr. Susan L. Lindquist, professor of biology at Massachusetts Institute of Technology, investigator at the Howard Hughes Medical Institute, member of the Whitehead Institute for Biomedical Research, and associate member of the Koch Institute for Integrative Cancer Research at MIT"
            ],
            [
                "2010",
                "Dr. Ahmed Zewail, Nobel Prize winner and Linus Pauling Professor of Chemistry and professor of physics at California Institute of Technology (Caltech)"
            ],
            [
                "2009",
                "Dr. Christopher M. Dobson, John Humphrey Plummer Professor of Chemical and Structural Biology and Master of St. John’s College, University of Cambridge"
            ],
            [
                "2008",
                "Jeffrey D. Macklis, M.D., Director, Massachusetts General Hospital-Harvard Medical School Center for Nervous System Repair, Professor of Neuroscience, Neurosurgery and Neurology, Harvard University"
            ],
            [
                "2007",
                "Joseph H. Taylor, Ph.D., 1993 Nobel Laureate in Physics, James S. McDonnell Distinguished University Professor, Princeton University"
            ],
            [
                "2006",
                "Leroy Hood, M.D., Ph.D., President, Institute for Systems Biology"
            ],
            [
                "2005",
                "Rita Colwell, Ph.D., Chair, Canon U.S. Life Science, Inc., and Former President, National Science Foundation"
            ],
            [
                "2004",
                "Mary-Claire King, Ph.D., American Cancer Society Research Professor, Departments of Medicine (Medical Genetics) and Genome Sciences, University of Washington School of Medicine"
            ],
            [
                "2003",
                "J. William Schopf, Ph.D., Director, Center for the Study of Evolution and the Origin of Life, University of California at Los Angeles"
            ],
            [
                "2002",
                "Polly Celine Eveline Matzinger, Ph.D., Head, Section on T-Cell Tolerance and Memory, Ghost Lab, Laboratory of Cellular and Molecular Immunology, National Institute of Allergy and Infectious Disease, National Institutes of Health"
            ],
            [
                "2001",
                "Ferid Murad, M.D., (Nobel Laureate: Medicine) Professor and Chair, Department of Integrative Biology, Pharmacology and Physiology, and Director, Institute of Molecular Medicine, University of Texas Health Science Center at Houston"
            ],
            [
                "2000",
                "F. Sherwood Rowland, Ph.D., (Nobel Laureate: Chemistry), Donald Bren Research Professor of Chemistry and Earth System Science, University of California at Irvine"
            ],
            [
                "1999",
                "Keith L. Black, M.D., Director, Division of Neurosurgery, Cedars-Sinai Medical Center; Director, Cedars-Sinai Comprehensive Brain Tumor Program; and Director, Cedars-Sinai Neurological Institute"
            ],
            [
                "1998",
                "Sylvia A. Earle, Ph.D., Founder and Chairman, Deep Ocean Exploration and Research, Inc, and National Geographic’s Explorer in Residence"
            ],
            [
                "1997",
                "Thomas R. Cech, Ph.D. (Nobel Laureate: Chemistry), Distinguished Professor of Chemistry and Biochemistry and of Molecular, Cellular and Developmental Biology, University of Colorado"
            ],
            [
                "1996",
                "Alfred G. Gilman, M.D. (Nobel Laureate: Medicine), Professor and Chairman, Department of Pharmacology, University of Texas Southwestern Medical Center"
            ],
            [
                "1995",
                "Eugene M. Shoemaker, Ph.D., Scientist Emeritus, U.S. Geological Survey"
            ],
            [
                "1994",
                "C. Thomas Caskey, M.D., Director, Human Genome Center, and Chair, Department of Human and Molecular Genetics, Baylor College of Medicine"
            ],
            [
                "1993",
                "Donald C. Johanson, Ph.D., President, Institute of Human Origins"
            ],
            [
                "1992",
                "Chen Ning Yang, Ph.D. (Nobel Laureate: Physics), Director of the Theoretical Physics Department, State University of New York"
            ],
            [
                "1991",
                "Lynn Margulis, Ph.D., Distinguished University Professor of Botany, University of Massachusetts"
            ],
            [
                "1990",
                "Leon Richard Kass, Ph.D., Professor, University of Chicago"
            ],
            [
                "1989",
                "Cyril Ponnamperuma, Ph.D., Director, Laboratory of Chemical Evolution, and Professor of Chemistry, University of Maryland"
            ],
            [
                "1988",
                "Michael S. Brown, M.D. (Nobel Laureate: Medicine), Professor of Medicine and Genetics and Director of the Center for Genetic Disease, Southwestern Medical School at Dallas"
            ],
            [
                "1987",
                "Hans Mark, Ph.D., Chancellor, University of Texas System, and former Deputy Administrator, National Aeronautics and Space Administration"
            ],
            [
                "1986",
                "Donald C. Johanson, Ph.D., paleoanthropologist"
            ],
            [
                "1985",
                "Arthur Guyton, M.D., Chairman, Department of Physiology and Biophysics, University of Mississippi School of Medicine"
            ],
            [
                "1984",
                "Har Gobind Khorana, Ph.D. (Nobel Laureate: Physiology), Professor, Massachusetts Institute of Technology"
            ],
            [
                "1983",
                "Tanya M. Atwater, Ph.D., Professor of Marine Geophysics, University of California at Santa Barbara"
            ],
            [
                "1982",
                "Kip S. Thorne, Ph.D., Professor of Theoretical Physics, California Institute of Technology"
            ],
            [
                "1981",
                "D. Carleton Gajdusek, M.D. (Nobel Laureate: Medicine), Director of the Study of Child Growth and Development and Disease Patterns in Primitive Cultures, National Institutes of Health"
            ],
            [
                "1980",
                "Frederick Chapman Robbins, M.D. (Nobel Laureate: Medicine), Dean, School of Medicine, Case Western Reserve University"
            ],
            [
                "1979",
                "George W. Beadle, Ph.D. (Nobel Laureate: Biology), President Emeritus, University of Chicago; and W. O. Milligan, Ph. D., Director of Research, Robert A. Welch Foundation"
            ],
            [
                "1978",
                "Linus Pauling, Ph.D. (Nobel Laureate: Chemistry; Nobel Laureate: Peace), Research Professor, Linus Pauling Institute of Science and Medicine, and Professor Emeritus of Chemistry, Stanford University"
            ],
            [
                "1977",
                "Humberto Fernandez-Moran, M.D., Ph.D., Pritzker Professor of Biophysics, University of Chicago"
            ]
        ],
        [
            [
                "Year",
                "Lecturers and Subject"
            ],
            [
                "2024",
                "Dr. Renee Hobbs, professor of communication studies at the University of Rhode Island and founder of the Media Education Lab."
            ],
            [
                "2023",
                "Patrick Jagoda, William Riney Harper Professor of English and Cinema and Media Studies at the University of Chicago, and Ashlyn Sparrow, Assistant Director of the Weston Game Lab at the University of Chicago"
            ],
            [
                "2022",
                "Julie Giroux, orchestrator, composer, arranger, clinician and guest conductor"
            ],
            [
                "2019",
                "Mr. Kyle Emile, founder and Executive Director of the non-profit organization Free Intelligent Conversation"
            ],
            [
                "2018",
                "Sonia Manzano, “Maria” from “Sesame Street” and best-selling author"
            ],
            [
                "2017",
                "Dr. Zeynep Tufekci, associate professor in the School of Information and Library Science at the University of North Carolina, writer and “techno-sociologist”"
            ],
            [
                "2016",
                "Dr. John McWhorter, associate professor of English and comparative literature at Columbia University, linguist and best-selling author"
            ],
            [
                "2015",
                "Retired Col. Eileen Collins, retired NASA and Air Force Colonel and the first woman to command an American spacecraft"
            ],
            [
                "2014",
                "Ian Cheney, award-winning documentary filmmaker and 2014-15 Knight Science Journalism Fellow at MIT"
            ],
            [
                "2013",
                "Dr. Michael E. Mann, director of the Earth Science Center and distinguished professor of meteorology at Pennsylvania State University, and author ofDire Predictions: Understanding GlobalWarmingandThe Hockey Stick and the Climate Wars: Dispatches from the Front Lines"
            ],
            [
                "2012",
                "Jeffery Lyons, Television and Film Critic"
            ],
            [
                "2011",
                "Frank Deford, author, Emmy award-winning journalist, commentator and humanitarian"
            ],
            [
                "2010",
                "Dr. James Katz, chair of the Rutgers University Department of Communication, and Howard Rheingold, author and pioneer expert on the internet"
            ],
            [
                "2009",
                "Dr. Leiyu Shi, professor of health policy and health services research at Johns Hopkins University, and Dr. Gregory Stevens, assistant professor and associate director of research in the Center for Community Health Studies at the University of Southern California"
            ],
            [
                "2008",
                "Dr. John Gilliom, Professor of Political Science, Ohio University, and Dr. Torin Monahan, Associate Professor of Human and Organizational Development and Associate Professor of Medicine, Vanderbilt University"
            ],
            [
                "2007",
                "Dr. Katherine Donato, Professor of Sociology, Vanderbilt University, and Dr. Jorge Durand, Professor of Anthropology, University of Guadalajara, Mexico"
            ],
            [
                "2006",
                "Dr. Scott Appleby, Professor of History, Notre Dame University, and Dr. Jeffrey Kaplan, Associate Professor of Religion, University of Wisconsin-Oshkosh"
            ],
            [
                "2005",
                "Dr. Peter A. Walker, Professor of Environmental Studies, University of Oregon, and Dr. Howard Margolis, Professor of Public Policy, University of Chicago"
            ],
            [
                "2004",
                "Dr. David Popenoe, Professor of Sociology, Rutgers University, and Dr. Stephanie Coontz, Professor of History and Family Studies, Evergreen State College"
            ],
            [
                "2003",
                "Dr. Kamran Aghaie, Associate Director, Center for Middle Eastern Studies, University of Texas at Austin, and Dr. Thomas Gouttierre, Dean of International Studies and Director, Center for Afghanistan Studies, University of Nebraska"
            ],
            [
                "2002",
                "Dr. Regina Barreca, Author of They Used to Call Me Snow White, But I Drifted, and Dr. Lawrence E. Mintz, Founder and President, International Society of Humor Studies"
            ],
            [
                "2001",
                "Dr. David Barash, Professor of Psychology, University of Washington, and author of Understanding Violence, and Dr. Roy F. Baumeister, author ofEvil: Inside Violence and Cruelty"
            ],
            [
                "2000",
                "Dr. Robert V. Friedenberg, Professor of Communication, Miami University of Ohio, and Dr. Richard Davis, Professor of Government, Brigham Young University"
            ],
            [
                "1999",
                "Dr. Carlos Munoz, Jr., Professor of Ethnic Studies, University of California, and Dr. Alan Wolfe, Professor of Political Science and Director of the Center for Religion and American Public Life, Boston College"
            ],
            [
                "1998",
                "Dr. Lynn Spigel, Professor and Chair, Critical Studies Division, Department of Cinema and Television, University of South California; C. Edwin Baker, Gallicchio Professor of Law, University of Pennsylvania; and Dr. Angela M. S. Nelson, Director of the Center for Popular Culture Studies, Department of Popular Culture, Bowling Green State University"
            ],
            [
                "1997",
                "Dr. James Davison Hunter, William R. Kenan Professor of Sociology and Religious Studies and Director of the Post-Modernity Project, University of Virginia; Grace Palladino, Co-Director and Editor of The Samuel Gompers Papers, University of Maryland; and William Strauss, writer, historian, lecturer, theatrical director and entertainer"
            ],
            [
                "1996",
                "Anne Wells Branscomb, President, The Raven Group, and Research Associate, Harvard University Program on Information Resources Policy; Gary Chapman, Coordinator, 21st Century Project, Lyndon Baines Johnson School of Public Affairs, University of Texas at Austin; and Dr. Steve Jones, Chair, Communication Department, and Co-Director of the Center for Research on Information, University of Tulsa"
            ],
            [
                "1995",
                "Dr. Stanley Eitzen, Professor Emeritus of Sociology, Colorado State University; Dr. Mimi Murray, Buxton Professor of Physical Education, Springfield College; and Dr. Benjamin G. Rader, Professor of History, University of Nebraska-Lincoln"
            ],
            [
                "1994",
                "Dr. Michael A. Hitt, Professor of Management and Robertson Chair in Business Administration, Texas A&M University; Anne L. Heald, Executive Director, Center for Learning and Competitiveness, School of Public Affairs, University of Maryland; and Dr. Robert Perrucci, Professor of Sociology, Purdue University"
            ],
            [
                "1993",
                "Dr. Ralph J. Cicerone, Aldrich Professor of Geosciences, University of California; Dr. Daniel Simberloff, Lawton Distinguished Professor in Biological Sciences, Florida State University; and Dr. William E. Riebsame, Associate Professor of Geography, University of Colorado at Boulder"
            ],
            [
                "1992",
                "Dr. Arnold R. Hirsch, Professor of History, College of Urban and Public Affairs, University of New Orleans; Dr. David E. Hayes-Bautista, Professor of Medicine and Director of Chicano Studies Research Center, University of California; and Dr. Samuel L. Myers, Wilkins Professor of Human Relations and Social Justice, Hubert H. Humphrey Institute of Public Affairs, University of Minnesota"
            ],
            [
                "1991",
                "Dr. Barbara J. Callaway, Associate Provost for Academic Affairs and Professor of Political Science, Rutgers University; Dr. James M. McCormick, Professor of Political Science, Iowa State University; and Dr. Barry Rubin, Lecturer in International Affairs, Johns Hopkins School of Advanced International Studies"
            ],
            [
                "1990",
                "Dr. James L. Gumnnick, Executive Director for Research, St. Francis Regional Medical Center, Wichita, Kansas; Dr. George K. Schweitzer, Alumni Distinguished Professor of Chemistry, University of Tennessee; and Dr. Judith P. Swazey, President of the Acadia Institute, Bar Harbor, Maine"
            ],
            [
                "1989",
                "Dr. Elizabeth Johns, Professor of the History of Art, University of Pennsylvania; Wayne Lawson, Executive Director, Ohio Arts Council; and Doris Betts, Alumni Distinguished Professor of English, University of North Carolina"
            ],
            [
                "1988",
                "Dr. Michael W. Kirst, Professor of Education, Stanford University; Demos P. Doyle, Senior Research Fellow, Hudson Institute; and Dr. Arthur E. Wise, Director, Center for the Study of the Teaching Profession, The RAND Corporation"
            ],
            [
                "1987",
                "Dr. Walter F. Berns, John M. Olin University Professor, Georgetown University; Dr. Deborah L. Rhode, Professor of Law, Stanford University Law School; and Dr. Walter F. Murphy, McCormick Professor of Jurisprudence, Princeton University"
            ],
            [
                "1986",
                "Dr. Joe B. Frantz, Turnbull Professor of History, Corpus Christi State University, and Former Chair, History Department, University of Texas at Austin; Jared E. Hazleton, President, Texas Research League, and Former Dean, Graduate School of Public Affairs, University of Washington in Seattle; and Peter C. Bishop, Chair, Studies of the Future Program, University of Houston at Clear Lake City"
            ],
            [
                "1985",
                "Dr. Michael R. Rion, President, Hartford Seminary; Dr. Patricia H. Werhane, Associate Professor and Associate Academic Dean, College of Arts and Sciences, Loyola University; and Dr. Richard T. De George, University Distinguished Professor, University of Kansas"
            ],
            [
                "1984",
                "Dr. Elsie Boulding, Chair, Department of Sociology, Dartmouth College; Dr. Peter A. French, Lennox Distinguished Professor of the Humanities and Professor of Philosophy, Trinity University; and Dr. William H. McNeill, Millikan Distinguished Service Professor, University of Chicago"
            ]
        ],
        [
            [
                "Year",
                "Lecturers"
            ],
            [
                "2022",
                "Lee Hill and Alexis Serio, Texas-based contemporary painters"
            ],
            [
                "2021",
                "Annie Varnot, New York-based contemporary painter"
            ],
            [
                "2019",
                "Sammy Peters, Arkansas-based abstract painter"
            ],
            [
                "2017",
                "Lydia Dildilian, Wisconsin-based painter"
            ],
            [
                "2016",
                "Jim Woodson, New Mexico-based contemporary artist"
            ],
            [
                "2015",
                "Howard Sherman, Houston-based contemporary artist"
            ],
            [
                "2013",
                "Sharon Booma, Massachusetts-based contemporary painter"
            ]
        ],
        [
            [
                "Year",
                "Writer Bio"
            ],
            [
                "2024",
                "Manuel Muñoz, critically acclaimed short-story writer; recipient of a MacArthur Genius Grant"
            ],
            [
                "2023",
                "Dr. Brandon Hobson, critically acclaimed fiction writer"
            ],
            [
                "2022",
                "Naomi Shihab Nye, poet, fiction writer and children’s literature author"
            ],
            [
                "2020",
                "Laila Lalami, award-winning author, professor of creative writing at the University of California at Riverside, winner of the American Book Award and Arab-American Book Award, finalist for the Pulitzer Prize for Fiction"
            ],
            [
                "2019",
                "Chitra Banerjee Divakaruni, award-winning poet and best-selling author; Betty and Gene McDavid Professor of Creative Writing at the University of Houston; winner of the Allen Ginsberg Poetry Prize and American Book Award"
            ],
            [
                "2018",
                "Brian Turner, poet and memoirist; director of the Master of Fine Arts in creative writing program at Sierra Nevada College and author of “My Life as a Foreign Country,” “Phantom Noise” and “Here, Bullet.”"
            ],
            [
                "2017",
                "Anne Hillerman, journalist, newspaper editor and best-selling author of three novels in the Joe Leaphorn Navajo Mysteries series; winner of the New Mexico Book Award, Mountains and Plains Booksellers Award and Western Writers of America Spur Award; Co-founder and director of the Santa Fe-based WORDHARVEST Writers Workshop and the Tony Hillerman Writers Conference"
            ],
            [
                "2016",
                "Craig Johnson, award-winning author of 12 novels in the Walk Longmire mystery series and the inspiration for the A&E/Netflix TV series “Longmire,” winner of the Western Writers of America’s Spur Award, Independent Booksellers’ Book of the Year Award, Publishers Weekly Best Book of the Year Award and Library Journal Best Mystery of the Year Award"
            ],
            [
                "2015",
                "Dan Chaon, Delaney Associate Professor of Creative Writing and co-director of the Creative Writing Program at Oberlin College in Ohio, author of three short story collections and two novels, winner of the Academy Award in Literature from the American Academy of Arts and Letters in 2006."
            ],
            [
                "2014",
                "Juan Felipe Herrera, poet laureate of California and author of 29 books of poetry, prose, plays, children’s stories and young adult novels, includingHalf of the World in Light, which won the National Book Critics’ Circle Award, and his bilingual memoir,Calling The Doves/El Canto De Las Palomas, which won the Friends of Children and Literature (FOCAL) Award and Ezra Jack Keats Award"
            ],
            [
                "2013",
                "Cristina García, author of “Lesser Tragedy of Death,” “The Lady Matador’s Hotel,” “A Handbook to Luck” and others. Winner of Guggenheim Fellowship, Whiting Writer’s Award, Princeton University’s Hodder Fellowship and a National Endowment for the Arts Grant"
            ],
            [
                "2012",
                "Leslie Marmon Silko, One of the great masters of Native American Literature. Winner of the Native Writers’s Circle of the Americas Lifetime Achievement Award. Author of “The Turqoise Ledge: A Memoir,” “After a Summer Rain in the Upper Sonoran,” “Almanac of the Dead” and “Ceremony.”"
            ],
            [
                "2011",
                "Art Spiegelman, author of Pulitzer Prize-winning “Maus 1: A Survivor’s Tale,” “Maus II: And Here My Troubles Begin,” “In the Shadow of No Towers,” “Breakdowns: A Portrait of an Artist as a Young %@&*!”"
            ],
            [
                "2010",
                "Mary Karr, award-winning poet and author. Besides her New York Times best-selling memoir, “The Liar’s Club.” Kar also wrote sequels, “Cherry and Lit,” published in 2009. Her works include “Sinners Welcome,” “Viper Rum” and “The Devil’s Tour.”"
            ],
            [
                "2009",
                "Terrance Hayes, Award-winning poet and author of “Wind in a Box,” “Hip Logic” and “Muscular Music.”"
            ],
            [
                "2008",
                "Luis Valdez, author of “Zoot Suit,” “La Bamba,” “Cisco Kid” and “Corridos: Tales of Passion and Revolutions.”"
            ],
            [
                "2007",
                "Tobias Wolff, author of “This Boy’s Life,” “Old School, In Pharaoh’s Army: Memories of the Lost War” and “Barrack’s Thief.”"
            ],
            [
                "2006",
                "Tim O’Brien, author of “If I Die in a Combat Zone, Box Me Up and Ship me Home”; “The Things They Carried”; and “July, July.”"
            ],
            [
                "2005",
                "Gordon Weaver, author of “Count a Lonely Cadence,” “The Way We Know in Dreams” and “The Eight Corners of the World.”"
            ],
            [
                "2004",
                "Peter Hedges, author of “What’s Eating Gilbert Grape.”"
            ],
            [
                "2003",
                "Naomi Shihab Nye, author of “19 Varieties of Gazelle,” “Fuel,” “Hugging the Jukebox,” “Red Suitcase” and “Words Under Words.”"
            ],
            [
                "2002",
                "Stephen Harrigan, author of “The Gates of the Alamo” and “Comanche Midnight.”"
            ],
            [
                "2001",
                "Reginald McKnight, author of “The Kind of Light that Shines on Texas” and “African American Wisdom.”"
            ],
            [
                "2000",
                "Denise Chavez, author of “The Last of the Menu Girls” and “Face of an Angel.”"
            ],
            [
                "1999",
                "W.P. Kinsella, author of “Shoeless Joe,” basis for the movie “Field of Dreams.”"
            ],
            [
                "1998",
                "Rudolfo Anaya, author of “Bless Me, Ultima.”"
            ]
        ],
        [
            [
                "Year",
                "Speaker"
            ],
            [
                "2024",
                "Jeffrey Feltman, former U.S. Special Envoy for the Horn of Africa"
            ],
            [
                "2023",
                "Ambassador Larry C. Napper, Former U.S. ambassador to Latvia and Kazakhstan"
            ],
            [
                "2022",
                "Ambassador Tibor Nagy, Assistant Secretary of State for African Affairs (Ret.)"
            ],
            [
                "2020",
                "Jonathan Fantini Porter, former national security official in the Executive Office of the President; member of the U.S. Advisory Board for the United Nations Refugee Agency"
            ],
            [
                "2019",
                "Earl Anthony Wayne, former U.S. ambassador to Mexico and Argentina"
            ],
            [
                "2018",
                "Dr. Jack Matlock, former ambassador to the Soviet Union and senior director for European and Soviet Affairs in the National Security Council"
            ],
            [
                "2017",
                "Mark Feierstein, former special assistant to the president and senior director for western hemisphere affairs on the National Security Council"
            ],
            [
                "2016",
                "James N. Purcell, Jr., chairman of the U.S. Association for International Migration, former assistant secretary of state of the State Department’s Bureau for Refugee Programs"
            ],
            [
                "2015",
                "James A Larocco, former U.S. ambassador to Kuwait, former director general of the Multinational Force and Observers on the Sinai Peninsula, former deputy assistant secretary of state for Near East affairs"
            ],
            [
                "2014",
                "Robert Hunter, former U.S. Ambassador to NATO who is a senior fellow at the Center for Transatlantic Relations of Johns Hopkins University"
            ],
            [
                "2013",
                "Robert E. Gribbin, former U.S. Ambassador to Rwanda and Central African Republic"
            ],
            [
                "2012",
                "Molly Williamson, Middle East Institute Scholar"
            ],
            [
                "2011",
                "Ambassador Laurence Pope"
            ],
            [
                "2010",
                "Charles Ford, former U.S. Ambassador"
            ],
            [
                "2009",
                "David J. Firestein, Senior Advisor, U.S. Advisory Commission on Public Diplomacy, U.S. Department of State"
            ],
            [
                "2008",
                "Thomas Dodd, Former Ambassador to Costa Rica and Uruguay."
            ],
            [
                "2007",
                "Edward Peck, Former Ambassador to Iraq and Mauritania."
            ],
            [
                "2006",
                "Tibor P. Nagy Jr., Former Ambassador to Guinea and Ethiopia."
            ],
            [
                "2004",
                "John W. Limbert, President, American Foreign Service Association, and Former Ambassador to Mauritania."
            ],
            [
                "2003",
                "Michael Ely, Former Deputy Ambassador to the European Communities, Brussels."
            ]
        ],
        [
            [
                "Year",
                "Speaker"
            ],
            [
                "2019",
                "George Hutchinson, managing editor, International Journal of Korean StudiesWilliam Newcomb, former member, United National Panel of ExpertsGreg Scarlatoiu, executive director, Committee for Human Rights in North KoreaMark Tokola, vice president, Korea Economic Institute"
            ],
            [
                "2017",
                "Mark Tokola, vice president of the Korea Economic InstituteGen. John Tilelli, U.S. Army (retired)Greg Scarlatoiu, executive director of the Committee for Human Rights in North KoreaDr. Bruce Bechtol, ASU professor of political science"
            ],
            [
                "2016",
                "Troy Stangarone, senior director of congressional affairs and trade, Korea Economic InstituteGen. Chun In-Bum, Republic of Korea Army (retired), and visiting fellow, Brookings InstituteDr. Dlynn Armstrong-Williams, chair of the Political Science and International Affairs Department, University of North GeorgiaDr. Bruce Bechtol, ASU professor of political science"
            ],
            [
                "2015",
                "Mark Tokola, vice president of the Korea Economic InstituteDr. Tara O, Asia policy specialist at the Center for Strategic and International Studies and board member of the International Council on Korean StudiesGordan Chang, columnist for Forbes MagazineSung-min Cho, Department of Government, Georgetown University"
            ],
            [
                "2013",
                "Dr. Richard C. Bush III, senior fellow at the Brookings Institution and director of its Center for East Asia Policy StudiesGreg Scarlatoiu, executive director of the Committee for Human Rights in North KoreaDavid S. Maxwell, associate director of the Center for Security Studies and the Security Studies Program at Georgetown University"
            ],
            [
                "2011",
                "Alberto Gonzales, former U.S. Attorney General and visiting professor at Texas Tech University"
            ],
            [
                "2010",
                "Michael D. Phillips, military assistant to the U.S. ambassador to the Balkans during the armed conflict between Serbs and Kosovars in the early 1990s"
            ]
        ],
        [
            [
                "Year",
                "Speaker"
            ],
            [
                "2024",
                "Dr. Leah LaGrone, Weber State University, “Sex Wages: Race, Respectability and Minimum Wage Policies in Texas”"
            ],
            [
                "2023",
                "Dr. Miguel Levario, Texas Tech University, “The Myth of the Mexican Nemesis in the 20th Century”"
            ],
            [
                "2022",
                "Dr. Donald S. Frazier, Schreiner University, “Tempest over Texas: The American Civil War, Global Politics, and Mexico“"
            ]
        ],
        [
            [
                "Year",
                "Faculty"
            ],
            [
                "2010",
                "Dr. Mun Ga Kang, political science professor at Kyungnam University, South Korea"
            ],
            [
                "2006",
                "Igor Tolochin, Professor of English Linguistics, University of St. Petersburg, Russia."
            ],
            [
                "2004",
                "Frederick Moyer, Classical Pianist and Recording Artist."
            ],
            [
                "2003",
                "Dr. D. Stanley Eitzen, Professor Emeritus of Sociology, Colorado State University."
            ],
            [
                "2002",
                "William W. “Bill” Maxwell, Nationally Syndicated Editorial Writer and Columnist, St. Petersburg Times."
            ],
            [
                "2001",
                "E.R. “Dick” Brooks, former Chairman and Chief Executive Officer, Central and South West Corporation."
            ],
            [
                "2000",
                "Edward Rowell, former U.S. Ambassador to Luxembourg, Portugal and Bolivia."
            ],
            [
                "1998",
                "Dr. Jay Davis, Director, Defense Threat Reduction Agency, U.S. Department of Defense, and World-renowned physicist."
            ],
            [
                "1997",
                "Karl Malden, Academy Award-winning Actor of Screen, Stage and Television."
            ],
            [
                "1996",
                "Elmer Kelton, Spur Award-winning Western Author."
            ]
        ],
        [
            [
                "Year",
                "Lecturer"
            ],
            [
                "2008",
                "Maureen Dowd, Pulitzer Prize-winning columnist for the New York Times Op-Ed page"
            ],
            [
                "2007",
                "James D. “Denny” Shelton, former Chairman and CEO, Triad Hospitals Inc."
            ],
            [
                "2006",
                "Catherine Crier, TV Journalist, “Catherine Crier Live,” Court TV."
            ],
            [
                "2005",
                "Richard Haass, President of the Council on Foreign Relations and former Director of Policy Planning for the U.S. Department of State."
            ],
            [
                "2004",
                "Gen. Barry R. McCaffrey, Bradley Distinguished Professor of International Security Studies, United States Military Academy; former Army Commander; and National Drug Policy Director."
            ],
            [
                "2002",
                "James A. Baker III, former U.S. Secretary of State, former U.S. Secretary of the Treasury and former White House Chief of Staff."
            ],
            [
                "2001",
                "Rick Bass, Nature Writer and Environmentalist."
            ],
            [
                "2000",
                "Dr. Ramon Eduardo Ruiz, Pre-eminent Historian on Mexico."
            ],
            [
                "1999",
                "Sergei N. Khrushchev, Authority on Russian Economics and Political Reform and son of former Soviet Premier Nikita Khrushchev."
            ],
            [
                "1998",
                "Warren Rudman, former U.S. Senator and Co-Author of the 1985 Gramm-Rudman-Hollings Deficit Reduction Bill."
            ],
            [
                "1997",
                "John Wheat, Sound Archivist, Center for American History, University of Texas at Austin."
            ],
            [
                "1996",
                "Lloyd M. Bentsen, former U.S. Senator and Secretary of the Treasury."
            ],
            [
                "1995",
                "Shelby Foote, Civil War Historian and Author of the three-volume The Civil War: A Narrative."
            ],
            [
                "1994",
                "Margaret Thatcher, British Prime Minister, 1979-90."
            ],
            [
                "1993",
                "James H. Billington, Librarian of Congress."
            ],
            [
                "1992",
                "Elspeth Rostow, Political Analyst, Author, Educator, Chairman of the Board, U.S. Institute of Peace, and Stiles Professor Emerita in American Studies, LBJ School of Public Affairs, University of Texas."
            ],
            [
                "1991",
                "Larry McMurtry, Pulitzer Prize-Winning Author of Lonesome Dove."
            ],
            [
                "1990",
                "Richard Wilbur, Poet Laureate Emeritus of the United States."
            ],
            [
                "1989",
                "Dr. Robert Legvold, Director, W. Averell Harriman Institute for Advanced Study of the Soviet Union, Columbia University."
            ],
            [
                "1988",
                "Robert Norman William Blake, Baron Blake of Braydeston, British historian."
            ]
        ],
        [
            [
                "Year",
                "Speakers"
            ],
            [
                "2011",
                "Chris Whatley, Angelo State University alum and office director of the Council of State Governments (CSG) in Washington, D.C."
            ],
            [
                "2010",
                "Dr. Masaaki Kotabe, holder of the Washburn Chair in International Business and Marketing at Temple University"
            ],
            [
                "2009",
                "Dr. Eugenio J. Alemán, Senior Economist and Vice President, Wells Fargo Bank."
            ],
            [
                "2008",
                "Dr. Pietra Rivoli, Professor of Finance and International Economics, Georgetown University, and Dr. Antonio Rios Ramirez, Dean of Graduate Research and Development, Monterrey Institute of Technology, Chihuahua, Mexico."
            ],
            [
                "2006",
                "Dr. William C. Gruben, Director, Center for Latin American Economics, and Vice President, Federal Reserve Bank of Dallas."
            ],
            [
                "2005",
                "Margaret Hanson-Muse, Senior Commercial Office, U.S. Embassy, Lima, Peru."
            ],
            [
                "2003",
                "Ian Browde, Vice President of Development, Nokia."
            ],
            [
                "2002",
                "Dr. Jeffrey Wigand, Founder of Smoke Free Kids Foundation and subject of the movie “The Insider.”"
            ],
            [
                "2001",
                "Paul Solman, business and economics correspondent for the NewsHour with Jim Lehrer on PBS."
            ],
            [
                "2000",
                "Floyd Nickerson, Vice President of Central Southwest Energy."
            ],
            [
                "1999",
                "David Galloway, Senior Principal with the General Secretariat of the Council of the European Union, Brussels, Belgium."
            ],
            [
                "1998",
                "Dr. Massaki Kotabe, Washburn Chair and Professor of International Business and Marketing, Fox School of Business, Temple University."
            ],
            [
                "1997",
                "Eva Kraus, author of Cross-Cultural Issues."
            ]
        ],
        [
            [
                "Year",
                "Lecturers"
            ],
            [
                "2014",
                "Liliana Salazar, Senior Vice President and Employee Benefits Compliance Practice Co-Leader, Wells Fargo Insurance"
            ],
            [
                "2013",
                "Liliana Salazar, Senior Vice President and Employee Benefits Compliance Practice Co-Leader, Wells Fargo Insurance"
            ],
            [
                "2010",
                "Alvin New, San Angelo mayor and former president and CEO of Town & Country Food Stores"
            ],
            [
                "2008",
                "Mark Low, founder and CEO, Juno Energy"
            ],
            [
                "2007",
                "Mark Homer, Owner, Homer Enterprises, Texas State Representative, District 3"
            ],
            [
                "2006",
                "M. Dale Dodson, CPA, Chief Executive Officer, Dalcor Companies"
            ],
            [
                "2005",
                "Kelby Hagar, Serial Entrepreneur and President and CEO, Digital Witness, LLC"
            ],
            [
                "2004",
                "Kevin Carroll, “Katalyst,” Special Projects Division, Nike"
            ],
            [
                "2003",
                "Michael H. (Mike) Millegan, Senior Vice President-Logistics, Verizon"
            ],
            [
                "2002",
                "Landel C. Hobbs, Executive Vice President and Chief Financial Officer, Time Warner Cable"
            ],
            [
                "2001",
                "Patricia Diaz Dennis, Senior Vice President, Regulatory & Public Affairs, SBC Communications Inc."
            ],
            [
                "2000",
                "Linda Alvarado, President, Alvarado Construction Inc., and Limited Partner, Colorado Rockies Major League Baseball Team"
            ],
            [
                "1999",
                "E.R. “Dick” Brooks, Chairman and CEO, Central and South West Corp."
            ],
            [
                "1998",
                "Drayton McLane Jr., Chairman, McLane Group, L.P., Houston Astros Baseball Club, Astrodome USA"
            ],
            [
                "1997",
                "David Hirschfeld, Chairman and CEO, Hirschfeld Steel Co., Inc. and F.L. “Steve” Stephens, Chairman and CEO, Town & Country Food Stores, Inc."
            ],
            [
                "1996",
                "Richard M. Kovacevich, Chairman and CEO, Norwest Corp."
            ],
            [
                "1995",
                "Robert T. Herres, Chairman and CEO, USAA"
            ]
        ]
    ]
}