{
    "file_name": "sites-norris-vincent-college-of-business.html",
    "title": "No Title",
    "description": "No Description",
    "meta_tags": {},
    "headings": [
        "Students Mingle with Bankers at Fall ‘Meet the Banks’ Event",
        "Angelo State Maintains U.S. ‘College of Distinction’ Status",
        "2024 Outstanding Graduate Students",
        "Economics Students Present Research at National Conference",
        "2024 BizPitch Student Business Contest Winners",
        "Business Student Named Provincial Collegian of the Year",
        "Accounting Professor Selected for Endowed Chair",
        "Fortune Magazine Recognizes Online Graduate Degrees",
        "Distinguished Alum Gifts Angelo State $1 Million for Academics",
        "Alumnus Jim Bennett Visits NVCOB",
        "Students Learn from Banking Partners at ‘Meet the Banks’",
        "Economics Professor Chosen for Endowed Chair in Business",
        "2023 Outstanding Graduate Students",
        "2023 ‘BizPitch’ Student Business Contest Winners",
        "Faculty Spotlight: Gayle Randall",
        "New Director for Small Business Development Center",
        "New Endowed Chair in ASU Norris-Vincent College of Business",
        "Taking Care of Business",
        "ASU Receives Gift to Establish Endowed Chair in Accounting",
        "Angelo State University Announces Gift and Naming of College of Business",
        "Onward and Upward",
        "A Family Affair (Une Affaire de Famille)",
        "Alum is Young Entrepreneur of the Year",
        "Business Students Get Hands-On With Competition",
        "Korean Alum Goes From ASU to Microsoft",
        "ASU Alumna a Leader in Texas Comptroller’s Division",
        "Alum’s Novel Wins Award",
        "Rigors of ROTC Field Training"
    ],
    "paragraphs": [
        "October 14, 2024",
        "Dozens of Angelo State accounting, business and finance students received first-hand insight on careers in banking during the recent “Meet the Banks” event hosted in the Houston Harte University Center by the ASU Norris-Vincent College of Business.",
        "June 18, 2024",
        "For the seventh straight year, Angelo State University has been named a national “College of Distinction” by the Colleges of Distinction print and online college guide that recognizes colleges and universities implementing best practices in higher education.",
        "May 9, 2024",
        "Angelo State University honored its 2024 Outstanding Graduate Students, as well as the recipients of three superlative awards, during the recent Graduate Research Symposium and Awards Ceremony in the Houston Harte University Center.",
        "May 6, 2024",
        "Angelo State University economics majors Maggie Brockman of Midland and Emma Krehbiel of Kerrville were selected to present their undergraduate research projects at the recent 48th annual meeting of the Association of Private Enterprise Education (APEE) in Las Vegas, Nevada.",
        "May 2, 2024",
        "Angelo State University’s Small Business Development Center (SBDC) and Norris-Vincent College of Business have announced the winners of the 2024 BizPitch student entrepreneurship competition following the recent live finals event in the LeGrand Alumni and Visitors Center.",
        "April 16, 2024",
        "Daysha Johnson of San Angelo, a graduate student in Angelo State University’s Master of Business Administration (MBA) program, has been named the 2024 South Central Province Collegian of the Year by the Delta Sigma Pi (DSP) national professional business fraternity.",
        "April 9, 2024",
        "Dr. Russell “Rusty” Calk, an Angelo State University alumnus and member of the accounting faculty, has been selected as the inaugural holder of the Low Family Endowed Chair in Accounting in ASU’s Norris-Vincent College of Business (NVCOB).",
        "January 10, 2024",
        "Angelo State University’s online master’s degree programs in applied psychology, business administration and nursing have again been ranked among the best in the nation by Fortune magazine, a global leader in business journalism with a worldwide readership of nearly 5 million.",
        "November 2, 2023",
        "Angelo State University has received a five-year, $1 million gift from alumnus Kelby Hagar, president and managing director of Argonaut Private Equity, to fund the new Angelo State Academic Excellence Endowment.",
        "Bennett, class of 1984, visited Angelo State and met with students to discuss his career and give advice to future professionals.",
        "The Norris-Vincent College of Business Excellence in Banking Program hosted several local banking partners for a “Meet the Banks” event for interested students.",
        "July 27, 2023",
        "Dr. Jamal Husein, a professor of economics in Angelo State University’s Norris-Vincent College of Business (NVCOB), has been selected to hold the Norris Family Chair in Business for a second consecutive five-year term.",
        "April 26, 2023",
        "Angelo State University honored its 2023 Outstanding Graduate Students, as well as the recipients of four superlative awards, during the annual Graduate Research Symposium and Awards Ceremony in the Houston Harte University Center.",
        "April 25, 2023",
        "Angelo State University’s Small Business Development Center (SBDC) and Norris-Vincent College of Business have announced the winners of the 2023 BizPitch student entrepreneurship competition following the recent live finals event in the LeGrand Alumni and Visitors Center.",
        "Assistant Professor of Marketing, Class of 1990 and 1991",
        "From student to alumna to professor, Gayle Randall has made Angelo State her home and her career. She credits ASU for making a positive change in her life that she wants to pass forward to the next generation.",
        "March 1, 2023",
        "Angelo State University’s Small Business Development Center (SBDC) has announced the retirement of long-time director David Erickson, as well as the appointment of a new director, ASU alumna Dezaray Johnson, effective March 1.",
        "October 25, 2018",
        "Angelo State University alum Scott Wisniewski has gifted Angelo State $1 million to establish the Wisniewski Family Endowed Chair in Entrepreneurship within the Norris-Vincent College of Business.",
        "August 20, 2018",
        "Since Dr. Clifton Jones arrived as the new dean of Angelo State’s business college in March 2015, the college has done nothing but change…for the better.",
        "August 13, 2018",
        "Angelo State University has received a generous monetary gift from alumnus Mark Low to establish the Low Family Chair in Accounting in ASU’s Norris-Vincent College of Business.",
        "June 5, 2018",
        "Angelo State University has received a combined $5 million gift from ASU alumni Lloyd Norris and Blake and Bryan Vincent to benefit ASU’s College of Business, and has named the college in their honor.",
        "May 3, 2017",
        "For San Angelo native and Angelo State senior Christian Garcia, honoring his family and his heritage have been his motivations throughout his college career.",
        "March 16, 2017",
        "For the last seven years, Frederic and Laurence Masurel of Bondues, France, have been loaning their kids to the ASU Ram Family.",
        "May 17, 2016",
        "Angelo State alum Jason Snider didn’t so much found a business as it found him.",
        "April 28, 2016",
        "In addition to the victorious entrepreneurs, this year’s San Angelo Business Plan Competition was also a winning experience for the 10 Angelo State University business students involved as advisors.",
        "April 8, 2016",
        "In 2012, Angelo State University alumnus Deok Hwan Choi made the momentous decision to leave his hometown of Ulsan, South Korea, and head to West Texas to finish his college education at ASU.",
        "March 23, 2016",
        "For Angelo State University alumna Denise Lunsford Stewart, becoming a woman in management for the Texas Comptroller of Public Accounts was more about opportunities than obstacles.",
        "February 19, 2016",
        "The belief and encouragement of an Angelo State journalism professor helped 1984 ASU alumnus Norma Jennings realize her dream of becoming a published writer. Her own talent has turned her into an award-winning author.",
        "October 28, 2014",
        "For many college students, the summer between their sophomore and junior years is a good time to do a study abroad program or work a part-time job while earning a few more credits in summer school. For Air Force ROTC cadets, it is the summer they participate in the highly competitive program known as field training, sweating in the Alabama and Mississippi humidity, fighting to earn the right to stay in officer training."
    ],
    "list_items": [],
    "table_headers": [],
    "table_data": [],
    "captions": [],
    "links": [
        "/live/news/19488-students-mingle-with-bankers-at-fall-meet-th",
        "/live/news/19488-students-mingle-with-bankers-at-fall-meet-th",
        "/live/news/19376-angelo-state-maintains-us-college-of-distinc",
        "/live/news/19376-angelo-state-maintains-us-college-of-distinc",
        "/live/news/19363-2024-outstanding-graduate-students",
        "/live/news/19363-2024-outstanding-graduate-students",
        "/live/news/19359-economics-students-present-research-at-natio",
        "/live/news/19359-economics-students-present-research-at-natio",
        "/live/news/19357-2024-bizpitch-student-business-contest-winne",
        "/live/news/19357-2024-bizpitch-student-business-contest-winne",
        "/live/news/19347-business-student-named-provincial-collegian-",
        "/live/news/19347-business-student-named-provincial-collegian-",
        "/live/news/19344-accounting-professor-selected-for-endowed-ch",
        "/live/news/19344-accounting-professor-selected-for-endowed-ch",
        "/live/news/19289-fortune-magazine-recognizes-online-graduate",
        "/live/news/19289-fortune-magazine-recognizes-online-graduate",
        "/live/news/19249-distinguished-alum-gifts-angelo-state-1-mill",
        "/live/news/19249-distinguished-alum-gifts-angelo-state-1-mill",
        "/live/news/19245-alumnus-jim-bennett-visits-nvcob",
        "/live/news/19245-alumnus-jim-bennett-visits-nvcob",
        "/live/news/19244-students-learn-from-banking-partners-at-meet",
        "/live/news/19244-students-learn-from-banking-partners-at-meet",
        "/live/news/19199-economics-professor-chosen-for-endowed-chair",
        "/live/news/19199-economics-professor-chosen-for-endowed-chair",
        "/live/news/19153-2023-outstanding-graduate-students",
        "/live/news/19153-2023-outstanding-graduate-students",
        "/live/news/19152-2023-bizpitch-student-business-contest-winne",
        "/live/news/19152-2023-bizpitch-student-business-contest-winne",
        "/live/news/19135-faculty-spotlight-gayle-randall",
        "/live/news/19135-faculty-spotlight-gayle-randall",
        "/live/news/19131-new-director-for-small-business-development-",
        "/live/news/19131-new-director-for-small-business-development-",
        "/live/news/16573-new-endowed-chair-in-asu-norris-vincent-coll",
        "/live/news/16573-new-endowed-chair-in-asu-norris-vincent-coll",
        "/live/news/16316-taking-care-of-business",
        "/live/news/16316-taking-care-of-business",
        "/live/news/16317-asu-receives-gift-to-establish-endowed-chair",
        "/live/news/16317-asu-receives-gift-to-establish-endowed-chair",
        "/live/news/16086-angelo-state-university-announces-gift-and-n",
        "/live/news/14075-onward-and-upward",
        "/live/news/14075-onward-and-upward",
        "/live/news/13703-a-family-affair-une-affaire-de-famille",
        "/live/news/13703-a-family-affair-une-affaire-de-famille",
        "/live/news/11672-alum-is-young-entrepreneur-of-the-year",
        "/live/news/11672-alum-is-young-entrepreneur-of-the-year",
        "/live/news/11540-business-students-get-hands-on-with-competit",
        "/live/news/11359-korean-alum-goes-from-asu-to-microsoft",
        "/live/news/11359-korean-alum-goes-from-asu-to-microsoft",
        "/live/news/11266-asu-alumna-a-leader-in-texas-comptrollers-di",
        "/live/news/11266-asu-alumna-a-leader-in-texas-comptrollers-di",
        "/live/news/11096-alums-novel-wins-award",
        "/live/news/11096-alums-novel-wins-award",
        "/live/news/7676-rigors-of-rotc-field-training",
        "/live/news/7676-rigors-of-rotc-field-training"
    ],
    "tables": []
}