{
    "file_name": "sites-information-for-families.html",
    "title": "Information for Families  · Angelo State University",
    "description": "title ix information for families",
    "meta_tags": {
        "viewport": "width=device-width, initial-scale=1",
        "generator": "LiveWhale",
        "og:title": "Information for Families",
        "og:type": "website",
        "og:url": "https://www.angelo.edu/current-students/title-ix/information-for-families/",
        "pagename": "Information for Families",
        "og:description": "title ix information for families",
        "description": "title ix information for families",
        "og:image": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "og:image:secure_url": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "og:image:width": "1260",
        "og:image:height": "630",
        "twitter:card": "summary_large_image",
        "twitter:title": "Information for Families",
        "twitter:description": "title ix information for families",
        "twitter:image": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "lw-template-updated": "10/20/2021 02:05pm CDT",
        "keywords": "title ix information for families"
    },
    "headings": [
        "Quick Links",
        "Information For",
        "Information for Families",
        "Title IX Information for Parents",
        "University Response",
        "Brief Overview of the Grievance Process",
        "Informal Resolution Process",
        "Supportive Measures",
        "Intersection of Student Privacy and FERPA",
        "Retaliation",
        "Other Helpful Information",
        "How to Support Your Child",
        "Pre-College Conversations",
        "Questions"
    ],
    "paragraphs": [
        "This page is designed to provide information about the Office of Title IX Compliance and address questions and concerns you may have as a parent of a student who is working with our office.",
        "The Office of Title IX Compliance is the designated department on the ASU campus who is responsible for addressing reports of sexual misconduct on campus. Our Title IX and Sexual Misconduct policy covers behaviors including but not limited to sexual assault, sexual harassment, interpersonal violence, gender discrimination, stalking, sexual exploitation, public indecency, andany other form of gender based misconduct.",
        "Response from the Office of Title IX Compliance is typically based on the Complainant’s wishes to address the complaint. There are times that if the behavior reported indicates a risk to the overall University Community, the Title IX Coordinator can implement the Grievance Process without the cooperation of the Complainant. Ultimately, our goal is to facilitate the response the Complainant believes will restore their success as an ASU student while addressing misbehavior and educating all students involved in the process in an impartial manner. We are able to respond in the following ways",
        "Ultimately, cooperation with our office is completely voluntary and the student chooses how we proceed. Our office will reach out to the student three times prior to closing their case. We must receive a complaint from the Complainant to address the situation. If a Complainant chooses not to respond to correspondence from the Office of Title IX Compliance, or chooses not to file a Formal Complaint, the Respondent may not know the situation was brought to our attention.",
        "If a Complainant chooses to address the complaint via Grievance process, they must submit a Formal Complaint. Upon receipt of a Formal Complaint, the University shall provide an Initial Notice to Parties, which will include sufficient details known at that time and inform the parties of the Prehearing Investigation.",
        "The prehearing investigation is utilized to gather information regarding the allegations made in the Formal Complaint. The Complainant (person alleging harm) and the Respondent (person accused of perpetrating the harm) are provided with an equal opportunity to share their accounts of the alleged incident(s), provide the names of witnesses, and offer evidence in support of their accounts. The Respondent is not presumed responsible for the alleged conduct until a determination is made at the end of the investigation and hearing process.",
        "Upon completion of the investigation, the university shall create an Investigative Report, which fairly summarizes the relevant evidence.Both the Complainant and the Respondent are provided with an equal opportunity to inspect the Investigative Report.An advisor (a support person) may assist either party throughout the process. The Complainant and Respondent are responsible for selecting an advisor, although upon request, the University is able to provide an advisor during the Grievance Process. It should be noted that parents are welcome to serve as an advisor.However, the student must make the decision to appoint a parent as an advisor and communicate that decision with the Office of Title IX Compliance.",
        "Provided the Formal Complaint is not dismissed or resolved by Informal Resolution (see the Informal Resolution section for more information), the Formal Complaint shall proceed to a live hearing. A live hearing will be conducted to determine the outcome and resolution of the Formal Complaint.The parties and their advisors will be notified of the date, time, and location of the hearing.",
        "A four-member panel, known as the Hearing Panel, will objectively and thoroughly evaluate all relevant evidence and reach an independent decision concerning whether a policy violation has occurred using a standard of proof known as “preponderance of the evidence.” Stated another way, this means a reasonable person would likely conclude that it is more likely than not that a policy violation occurred based upon the available evidence and known facts that were gathered in the prehearing investigation.",
        "Once the hearing panel reaches a determination regarding responsibility, they will produce a Written Determination Regarding Responsibility, which will include information about the Formal Complaint, current procedures, a rationale for their decision and disciplinary sanctions and remedies (if any).Both parties will receive concurrent notification of the decision and either party may appeal within three days of receipt of the decision.",
        "Appeals are reviewed by an appeal officer. The appeal officer will make a determination based on the information provided. The appeal officer’s decision is final, and no further appeals are offered under the policy.",
        "It is recommended that you review the Title IX Policy in its entirety for a full overview and explanation of the investigation and adjudication process. You may find our policy here:Sexual Harassment, Sexual Assault, Sexual Misconduct, and Title IX Policy and Complaint Procedure, OP 16.03.",
        "An Informal Resolution Process may be utilized as an alternative to the Grievance Process, prior to reaching a determination regarding responsibility. The goal of this process is to educate both parties and facilitate restoration by providing the Complainant what they believe will restore their being and by providing the Respondent education for future instances. The Informal Resolution Process may include, but is not limited to, a mediation process. Prior to beginning this process, the University shall obtain voluntary, written consent from both parties to resolve the Formal Complaint without proceeding to a live hearing. The parties may choose to terminate an Informal Resolution Process at any time and proceed with the Grievance Process. If an outcome is reached within an Informal Resolution Process, it is not appealable.",
        "Appropriate supportive measures, evaluated on a case-by-case basis, are equally available to both parties. These measures are designed to ensure the safety of involved students and minimize disruption of their educational and/or residential experience to the extent possible. Supportive measures may include, but are not limited to the following:",
        "Counseling Services",
        "For more information about supportive measures, please visit our Supportive Measures webpage (insert link).",
        "After making a report, student information will be handled in accordance with the regulations established by the Federal Educational Rights and Privacy Act (FERPA). FERPA is a federal law that protects the privacy of student educational records, and information contained in educational records cannot be shared without the student’s written consent. Though a student may already have a FERPA on file with the registrar’s office, our office requires permission from the student to communicate with their parent. Additionally, any communication with the parent will occur in the presence of the student.",
        "All reports are treated with the greatest degree of confidentiality possible. Confidentiality is maintained on a need-to-know basis with respect to the university’s obligations to investigate allegations of sexual misconduct and take the appropriate corrective action.",
        "Students cannot be punished for making a report that is in good faith or participating in the investigation and/or adjudication process. The University strictly prohibits all forms of retaliation against an individual who has worked with the Office of Title IX Compliance. Retaliation should be promptly reported to the Office of Title IX Compliance.",
        "Third parties, including parents, are encouraged to report known instances of sexual harassment and/or assault to the University. Participation in the Title IX process is voluntary, as are the supportive measures offered. Available supportive measures are not contingent upon the Complainant’s decision to pursue a Formal Complaint or file a police report.",
        "Listen.It may feel like a role-reversal, but in this situation, it is important to listen actively and non-judgmentally. Let your student control what and how much information they want to share with you. Digging for every detail may overwhelm or alienate them. Tell them you are there to listen and support them.",
        "Allow your student to decide the next steps.Individuals who experience a form of sexual misconduct should feel empowered to choose the next steps and their path to restoration. Where possible, offer guidance and information about available resources and additional support.",
        "Maintain an Emotional Balance.It is natural to express emotions with your student but controlled emotions may facilitate a more successful conversation. Remember, supporting your student is important.",
        "Check-in.Check-in with your student regularly and remind them that you love and support them. Healing is not linear and following up with your student lets them know that they have your long-term support.",
        "Get Support.Seek out support for yourself. Neglecting your own emotional, mental and physical health to take care of your student will make it more difficult for you to support your student.",
        "Parental support is important for college-bound students, as your student will begin to navigate all aspects of college life and will likely face situations they have never encountered before. We have created a list of discussion topics parents may utilize to aid in preparing your student for college prior to their arrival.",
        "We encourage you to contact the Title IX Coordinator, Jessica Gooch, at 325-942-2022, by sending an email tojessica.gooch@angelo.eduor visiting our website atangelo.edu/title-ix, if you have further questions regarding the Title IX Policy and process."
    ],
    "list_items": [
        "AcademicsAcademic ProgramsDepartmentsCollegesCoursesAcademic Calendar",
        "Academic Programs",
        "Departments",
        "Colleges",
        "Courses",
        "Academic Calendar",
        "About ASUHistoryCore ValuesNewsTraditionsAbout San AngeloWelcome from the PresidentMission Statement",
        "History",
        "Core Values",
        "News",
        "Traditions",
        "About San Angelo",
        "Welcome from the President",
        "Mission Statement",
        "Admissions & AidApply to ASUAdmitted StudentsRequest More InformationVisit Angelo State UniversityPaying for College",
        "Apply to ASU",
        "Admitted Students",
        "Request More Information",
        "Visit Angelo State University",
        "Paying for College",
        "Life on CampusLivePlayLeadWorkExplore",
        "Live",
        "Play",
        "Lead",
        "Work",
        "Explore",
        "CommunityASU Mayer MuseumAlumni AssociationSmall Business Development CenterWest Texas CollectionNatural History CollectionsKay Bailey Hutchison Center for Cyber Intelligence, Innovation, and Security StudiesLaura W. Bush Institute for Women’s HealthArts at ASUPlanetariumStephens ChapelRanch and Meat MarketASU Ticket OfficeSummer Camps and Conferences",
        "ASU Mayer Museum",
        "Alumni Association",
        "Small Business Development Center",
        "West Texas Collection",
        "Natural History Collections",
        "Kay Bailey Hutchison Center for Cyber Intelligence, Innovation, and Security Studies",
        "Laura W. Bush Institute for Women’s Health",
        "Arts at ASU",
        "Planetarium",
        "Stephens Chapel",
        "Ranch and Meat Market",
        "ASU Ticket Office",
        "Summer Camps and Conferences",
        "Give to ASUMake a GiftSignature EventsJoin",
        "Make a Gift",
        "Signature Events",
        "Join",
        "Athletics",
        "RamPort",
        "Library",
        "Bookstore",
        "Events",
        "Public Health Updates",
        "Administration",
        "Research",
        "Mental Health Services",
        "Title IX/Incident Report",
        "En Español",
        "Current Students",
        "Faculty & Staff",
        "Admitted Students",
        "Military",
        "Parents & Families",
        "Alumni",
        "Visitors",
        "School Counselors",
        "Online Students",
        "Title IX Definitions and Examples",
        "Get HelpFile a ReportThe Grievance ProcessSupportive MeasuresResources",
        "File a Report",
        "The Grievance Process",
        "Supportive Measures",
        "Resources",
        "Safety & Prevention411 on ConsentSafety PlanningTips on How to Stay SafeMandatory Trainings for StudentsRequest a ProgramInformation for Families",
        "411 on Consent",
        "Safety Planning",
        "Tips on How to Stay Safe",
        "Mandatory Trainings for Students",
        "Request a Program",
        "Information for Families",
        "Title IX Annual Reports",
        "Pregnant & Parenting Students",
        "Resource Guide for Students about Sexual Misconduct",
        "Guide for Responsible Employees",
        "Learn MoreFAQPolicies and Procedures",
        "FAQ",
        "Policies and Procedures",
        "The Sexual Assault and Title IX Response TeamMeet the TeamTeam Trainings",
        "Meet the Team",
        "Team Trainings",
        "Providing supportive measures",
        "Implementing the Grievance Process",
        "Implementing the Informal Resolution Process",
        "Take no action",
        "Medical Services",
        "Housing Assistance",
        "Short-term emergency housing accommodations or housing changes",
        "Academic Support",
        "Withdrawals, absence notifications, requests for flexibility or alternative participation submitted to faculty or supervisors",
        "Parking Assistance",
        "Modifications to parking permits",
        "Extracurricular and Student Organization Assistance",
        "Assistance Reporting Criminal Behavior to Local Law Enforcement Agencies",
        "No Contact Order",
        "Relationships.Identify the characteristics of healthy and unhealthy relationships. You may find it helpful to utilize your student’s favorite TV shows or movies to discuss why the on-screen relationships are healthy or unhealthy.",
        "Warning Signs.Helping your student recognize signs of abuse in a relationship may better allow them to identify dangerous situations. Early warning signs of relationship abuse includes but is not limited to possessiveness, jealousy, isolation, manipulation, criticism, limiting access, disregarding boundaries, invasion of privacy, etc.",
        "Communication.Students may struggle with discussing difficult topics and situations. Let your student know that it is okay to seek help through communication. Once they become an ASU student, they will be able to connect with the Counseling Center and services like the 24-Hour Crisis HelpLine. Please visit the Counseling Center website at/current-students/counseling-services/for more information.",
        "Problem Solving.As mentioned above, your student will likely be faced with new situations, which may be complex. Providing a problematic scenario and walking your student through several ways the problem may be solved is a great way to aid the development or enhancement of problem solving skills.",
        "Safety Planning.A safety plan is important when involved in a potentially dangerous situation. A safety plan should include a checklist of important items to pack, resources, transportation, emergency contacts, social media privacy settings, location settings, etc.",
        "2601 W. Avenue NSan Angelo, TX 76909",
        "1-800-946-8627",
        "Campus Map",
        "Contact ASU",
        "University Directory",
        "RamPort",
        "Jobs at ASU",
        "Facebook",
        "X",
        "Instagram",
        "YouTube",
        "©2024 Angelo State University",
        "All Rights Reserved",
        "Editor Login",
        "TTU System",
        "Texas Tech University",
        "TTU Health Sciences Center",
        "TTUHSC El Paso",
        "Midwestern State University",
        "ASU Privacy Policy",
        "Weather and Emergency Notifications",
        "Mental Health Services",
        "Title IX/Incident Report",
        "State of Texas",
        "Statewide Search",
        "Texas Homeland Security",
        "Texas Veterans Portal",
        "State Auditor’s Office",
        "Fraud Prevention",
        "Site Policies"
    ],
    "table_headers": [],
    "table_data": [],
    "captions": [],
    "links": [
        "#main-content",
        "/",
        "/academics/",
        "/academics/programs/",
        "/departments/",
        "/colleges/",
        "/courses/",
        "/current-students/registrar/academic_calendar.php",
        "/about-asu/",
        "/about-asu/history.php",
        "/about-asu/core-values/",
        "/about-asu/news/",
        "/about-asu/traditions/",
        "/about-asu/san-angelo.php",
        "/about-asu/president/",
        "/about-asu/mission-statement.php",
        "/admissions-and-aid/",
        "/admissions-and-aid/apply/",
        "/admissions-and-aid/admitted/",
        "/admissions-and-aid/info/",
        "/admissions-and-aid/visit/",
        "/admissions-and-aid/paying-for-college/",
        "/life-on-campus/",
        "/life-on-campus/live/",
        "/life-on-campus/play/",
        "/life-on-campus/lead/",
        "/life-on-campus/work/",
        "/life-on-campus/explore/",
        "/community/",
        "/community/mayer-museum/",
        "/alumni/",
        "/community/small-business-development-center/",
        "/community/west-texas-collection/",
        "/departments/biology/angelo-state-natural-history-collection/",
        "/community/kay-bailey-hutchison-center/",
        "/colleges/archer-college-of-health-and-human-services/laura-w-bush-institute-for-womens-health/",
        "/departments/visual-performing-arts/theatre/subscriptions.php",
        "/departments/physics-geosciences/planetarium/",
        "/community/stephens-chapel.php",
        "/community/asu-ranch/",
        "/community/ticket-office/",
        "/community/summer-camps-and-conferences/",
        "/give/",
        "/give/make_gift/",
        "/give/signature-events/",
        "/give/join/",
        "https://www.angelosports.com/",
        "https://ramport.angelo.edu/",
        "/library/",
        "http://bookstore.angelo.edu/",
        "/events/",
        "/public-health/",
        "/administrative-support/",
        "/research/",
        "/current-students/counseling-services/",
        "/current-students/title-ix/",
        "/en-espanol/",
        "/current-students/",
        "/faculty-and-staff/",
        "/admissions-and-aid/admitted/",
        "/active-duty-veterans/",
        "/parents-and-families/",
        "/alumni/",
        "/visitors/",
        "/school-counselors/",
        "/online/",
        "/current-students/title-ix/",
        "/current-students/title-ix/title-ix-definitions-and-examples/",
        "#",
        "/current-students/title-ix/file-a-complaint.php",
        "/current-students/title-ix/complaint-process.php",
        "/current-students/title-ix/supportive-measures/",
        "/current-students/title-ix/supportive-measures/resources/",
        "/current-students/title-ix/411-on-consent/",
        "/current-students/title-ix/safety-planning/",
        "/current-students/title-ix/risk-reduction-tips.php",
        "/current-students/title-ix/alcoholedu-and-haven.php",
        "/live/forms/856-request-a-title-ix-program-or-training",
        "/current-students/title-ix/information-for-families/",
        "/current-students/title-ix/annual-reports/",
        "/current-students/title-ix/pregnant-and-parenting-students/",
        "/current-students/title-ix/resource-guide-for-students-about-sexual-misconduct/",
        "/current-students/title-ix/employee-help-guide/",
        "#",
        "/current-students/title-ix/frequently-asked-questions.php",
        "/current-students/title-ix/policies-and-procedures/",
        "#",
        "/current-students/title-ix/contacts.php",
        "/current-students/title-ix/trainings.php",
        "/",
        "/current-students/",
        "/current-students/title-ix/",
        "https://angelo.policystat.com/policy/token_access/2823c44b-7cdd-4729-bd5c-00ff1b0ec4db/",
        "/current-students/counseling-services/",
        "mailto:jessica.gooch@angelo.edu",
        "https://titleix.uark.edu/",
        "tel:18009468627",
        "/map/",
        "/contact/",
        "/directory/",
        "https://ramport.angelo.edu/",
        "/work-at-asu/",
        "https://www.facebook.com/angelostateuniversity",
        "https://twitter.com/AngeloState",
        "https://www.instagram.com/angelostate/",
        "https://www.youtube.com/user/AngeloStateU",
        "/livewhale/?login&referer=1",
        "http://www.texastech.edu/",
        "https://www.ttu.edu/",
        "https://www.ttuhsc.edu/",
        "https://elpaso.ttuhsc.edu/",
        "https://msutexas.edu/",
        "https://apps.highered.texas.gov/resumes/",
        "/privacy_policy.php",
        "/emergency-notifications/",
        "/current-students/counseling-services/",
        "/current-students/title-ix/",
        "https://www.texas.gov/",
        "https://www.tsl.texas.gov/trail/index.html",
        "https://gov.texas.gov/organization/hsgd",
        "https://veterans.portal.texas.gov/",
        "https://sao.fraud.texas.gov/",
        "/administrative-support/audit-services/fraud_prevention.php",
        "/site-policies/"
    ],
    "tables": []
}