{
    "file_name": "sites-war-stories.html",
    "title": "No Title",
    "description": "No Description",
    "meta_tags": {},
    "headings": [
        "War Stories Events",
        "Humanities Month 2018 Ends with a Discussion of Wartime Culture, Memory, and Remembrance",
        "Great War Series: TCU Professor Discusses Women’s Experiences in the War",
        "War Stories Project Featured in Magazine for the American Historical Association",
        "Angelo State University Faculty and Students Participate in First Humanities Month Event",
        "Great War Lecture Series/First Humanities Month Event Featuring Prof. David Krugler",
        "Great War Series: Fulbright Scholar Discusses the Armenian Genocide",
        "War Stories Attends Event Honoring Vietnam Veterans",
        "Great War Series: Prof. John Irish Discusses the Musical Culture of the Great War Era",
        "Great War Series: Prof. Allison Robbins on Female Impersonation in Great War Service Shows",
        "Great War Series: Preston Lewis Introduces Audience to Great War Hero Daniel R. Edwards",
        "Great War Series: Veterans Roundtable Brings Together Students and Community Members",
        "Great War Series: MIT Prof. Christopher Capozzola Lectures on the Great War Experience in the United States",
        "Great War Series: Charles Endress Discusses the War in the Air",
        "Great War Series: Profs. Grear & Mendoza Discuss Challenges for Minorities in Texas During the Great War",
        "World War I Exhibit On Display at Fort Concho",
        "Great War Series: Voices of WWI & Veterans Roundtable",
        "Great War Series: Antle Discusses Wartime Propaganda",
        "Great War Series: Professors Discuss Photography and Physical Therapy",
        "Great War Series: Renowned Scholar Explains the Great War’s Lasting Effects on America",
        "Great War Series: Prof. Hama Explains Changes to British Poetry",
        "Great War Series: Prof. Charles Endress Lectures on the Experience of Battle on the Western Front",
        "War Stories Project Featured on Front Page of Angelo State Site",
        "Great War Lecture Series: Chemical Warfare in the Great War",
        "Latino-American Veterans Roundtable",
        "Great War Lecture Series: Cornell History Professor Discusses How Culture Influenced Soldiers’ Experiences in War",
        "Bridging the Academic and Public Divide"
    ],
    "paragraphs": [
        "October 30",
        "October 27",
        "October 18",
        "October 16",
        "October 11",
        "April 5",
        "March 29",
        "March 26",
        "March 22",
        "February 15",
        "November 15",
        "October 30",
        "September 29",
        "April 20",
        "April 3",
        "March 30",
        "March 6",
        "February 21",
        "November 29",
        "October 27",
        "September 17",
        "February 20",
        "February 16",
        "February 9",
        "November 16",
        "November 6"
    ],
    "list_items": [
        "Humanities Month 2018 Ends with a Discussion of Wartime Culture, Memory, and RemembranceOctober 30Faculty members from three departments in the College of Arts & Humanities participated in the final Humanities Month event for the fall 2018 semester. All of these faculty members used material collected by History Department faculty and students for the NEH-funding War Stories Project. Prof. Timothy Bonenfant (Dept. of Visual & Performing Arts) discussed the musical culture of the Vietnam War Era. Prof. ?JongHwa Lee? (Dept. of Communications & Mass Media) talked about the importance of war memorials and focused on the Vietnam War Memorial in Washington, D.C. Prof. ?Laurence Musgrove? (Dept. of English & Modern Languages) analyzed the poems of local veteran Glenn Allison.",
        "Great War Series: TCU Professor Discusses Women’s Experiences in the WarOctober 27Prof. Kara Vuic, a professor of history at Texas Christian University, spoke with a packed audience in the C. J. Davidson Conference Center on Tuesday, October 23. This was the final event in the fall 2018 Great War Series and the third event in the Humanities Month series. Prof. Vuic talked about the experiences of women who wished to contribute to the Great War effort and answered multiple questions from the engaged audience.",
        "War Stories Project Featured in Magazine for the American Historical AssociationOctober 18The National Endowment for the Humanities-funded War Stories Project, co-directed by Profs. ?Christine Lamberson? and ?Kanisorn Wongsrichanalai?, was featured in ?Perspectives?, the magazine of the American Historical Association. Interested parties can read the article by clicking this link.",
        "Angelo State University Faculty and Students Participate in First Humanities Month EventOctober 16The College of Arts & Humanities began its first Humanities Month in October 2018. The events feature lectures by both Angelo State faculty and outside guests. The first event with Angelo State faculty took place on October 16 in the Eldon Black Recital Hall and featured lectures by Prof. William A. Taylor (Dept. of Security Studies & Criminal Justice) and Prof. Matthew Gritter (Dept. of Political Science & Philosophy). Both professors used material collected by the History Department’s War Stories team over the course of four years. In addition, Profs. Ashley Meyer and Daniel Anderson from the Theatre Program (Dept. of Visual & Performing Arts), used select stories from the collection to put together a dramatic presentation that featured some first-year students. Around 200 attendees came out for this event.",
        "Great War Lecture Series/First Humanities Month Event Featuring Prof. David KruglerOctober 11In the first Great War Centennial Commemoration Lecture Series event of the 2018-19 Academic Year, Prof. David Krugler (University of Wisconsin–Platteville) spoke to over 200 attendees about the challenges that African Americans faced during the Great War Era. He talked about their fight for equality in a deeply racist American society, in the press, and in the criminal justice system.",
        "Great War Series: Fulbright Scholar Discusses the Armenian GenocideApril 5Prof. Julien Zarifian, a Fulbright scholar from the University of Cergy-Pontoise (France), who is spending the year at the Shoah Foundation Center for Advanced Genocide Research at the University of Southern California, visited Angelo State University for the Great War Series. He spoke on the Armenian Genocide and America’s response to the event. He also visited several classes while on campus and also spoke to students in the Honors Program. His visit was made possible by the Outreach Lecture Fund as well as the National Endowment for the Humanities.",
        "War Stories Attends Event Honoring Vietnam VeteransMarch 29War Stories co-director ?Christine Lamberson? and student assistant ?Keely Shaw? attended an event honoring Vietnam veterans at Angelo State’s Alumni Center on March 29, 2018.",
        "Great War Series: Prof. John Irish Discusses the Musical Culture of the Great War EraMarch 26Prof. ?John Irish?, Dept. of Visual & Performing Arts, spoke to a crowd of over 150 at the C. J. Davidson Center about the musical traditions of the Great War Era. Going through some of the popular musical trends of the period, Prof. Irish also noted the contributions of African-American musicians and the emergence of jazz.",
        "Great War Series: Prof. Allison Robbins on Female Impersonation in Great War Service ShowsMarch 22Prof. ?Allison Robbins?, Dept. of Music, University of Central Missouri, shared her research on female impersonation in Great War Era U.S. armed forces camps with an audience of over 150 in Cavness 100. Prof. ?Robbins? showed clips and also provided some background on the culture of the period.",
        "Great War Series: Preston Lewis Introduces Audience to Great War Hero Daniel R. EdwardsFebruary 15In the first event in the Great War Centennial Commemoration Lecture Series of the spring 2018 semester, ?Preston Lewis?, an author for former director of the Angelo State University Office of Communications and Marketing, introduced the audience to the story of Daniel R. Edwards, a recipient of the Congressional Medal of Honor. ?Lewis? told more than just Edwards’s biography, however. He also discussed the difficulties of telling truth from fiction in writing about an individual who claims to have accomplished tasks that were impossible. The audience of nearly 170 learned a great deal about Mr. Edwards’s service but also about the job that an historian performs in studying the past.",
        "Great War Series: Veterans Roundtable Brings Together Students and Community MembersNovember 15As part of the “World War I and America” initiative from the Library of America, the Gilder Lehrman Institute of American History, and the National Endowment for the Humanities, this event brought together students from the Department of Visual & Performing Arts to reenact the voices of the World War I generation. Local veterans provided commentary and discussed their own experiences in the armed forces. The event at the San Angelo Museum of Fine Arts drew an audience of over 140. The grant was co-directed by Profs. ?Lamberson? and ?Wongsrichanalai???.",
        "Great War Series: MIT Prof. Christopher Capozzola Lectures on the Great War Experience in the United StatesOctober 30Prof. ?Christopher Capozzola?, associate professor at the Massachusetts Institute of Technology, visited campus and spoke about how the federal government mobilized the American population for the Great War. Over 200 attendees from the student body and San Angelo community attended the event in the Angelo State University Auditorium on October 30, 2017.",
        "Great War Series: Charles Endress Discusses the War in the AirSeptember 29Prof. ?Charles Endress? (ret.) captivated an audience of over 350 in the C. J. Davidson Center on the evening of September 28, 2017. He discussed the evolution of aircraft and their use during the Great War. This is the first event in the Department of History’s 2017-18 Great War Centennial Commemoration Lecture Series made possible by generous support from the National Endowment for the Humanities.",
        "Great War Series: Profs. Grear & Mendoza Discuss Challenges for Minorities in Texas During the Great WarApril 20Prof. Charles Grear (Central Texas College) & Alexander Mendoza (University of North Texas) closed out the History Department’s 2016-17 Great War Centennial Commemoration Lecture Series on April 20 at the Fort Concho Commissary. Prof. Grear discussed the plight of ethnic Germans in Texas during the war and Prof. Mendoza discussed the challenges that Mexican Americans faced during that same conflict. Audience members also had the opportunity to view the “World War I and America” traveling exhibit.",
        "World War I Exhibit On Display at Fort ConchoApril 3The World War I traveling exhibit, part of the “World War I & America” grant co-directed by Profs. ?Lamberson? & ?Wongsrichanalai?, is on display at Fort Concho (Barracks 2). It is free and open to the public from April 1-24.",
        "Great War Series: Voices of WWI & Veterans RoundtableMarch 30Theatre students brought WWI voices to life and local veterans from the Vietnam and Iraq conflicts discussed whether the issues that Americans faced a century ago are still relevant in the late 20th and early 21st centuries in this Great War Series event. Almost 130 attendees turned out for the performances and panel discussion at the Stephens Central Library in downtown San Angelo on March 30, 2017.",
        "Great War Series: Antle Discusses Wartime PropagandaMarch 6Great War Series examines propaganda posters presented by Prof. Jay Antle, Angelo State alumnus and professor at Johnson County Community College.",
        "Great War Series: Professors Discuss Photography and Physical TherapyFebruary 21First Spring 2017 Event in the Great War Series Discusses Developments in Two Fields",
        "Great War Series: Renowned Scholar Explains the Great War’s Lasting Effects on AmericaNovember 29Prof. Jennifer Keene of Chapman University, one of the nation’s leading World War I scholars, visited students in Prof. David Dewar’s constitutional history class before giving a lecture on the effects of the conflict on American life to a crowd of almost 200 attendees in the C. J. Davidson Center. This is the last event in the Great War Series for the fall 2016 semester. Prof. Keene discussed how the war led people to wear wristwatches, use certain words, organize for different causes, and develop policies that affected Americans of future 20th century generations.",
        "Great War Series: Prof. Hama Explains Changes to British PoetryOctober 27Prof. Mark Hama of the Dept. of English & Modern Languages discussed how World War I affected British poetry. Beginning with a look at Georgian poetry, Prof. Hama then turned to the devastating conflict and introduced several important poets and their key works. The event attracted over 200 attendees from both the student body and San Angelo community.",
        "Great War Series: Prof. Charles Endress Lectures on the Experience of Battle on the Western FrontSeptember 17Prof. Charles Endress, former head of the Department of History and distinguished professor emeritus, opened the 2016-2017 Great War Centennial Commemoration Lecture Series by discussing the experience of fighting on the Western Front. Over 200 students and San Angelo residents came out for the evening programming in the C. J. Davidson Center.",
        "War Stories Project Featured on Front Page of Angelo State SiteFebruary 20The Department of History’s War Stories Project, sponsored by the National Endowment for the Humanities and co-directed by Profs. Christine Lamberson and Kanisorn Wongsrichanalai, was featured on the front page of the Angelo State University website. The feature story link can be found here.",
        "Great War Lecture Series: Chemical Warfare in the Great WarFebruary 16Profs. John Osterhout, Ralph Zehnder, and Gregory Smith from the Department of Chemistry at Angelo State University spoke to an audience of over 250 on the topic of “Chemical Warfare in the Great War.” Prof. Osterhout provided historical background, Prof. Zehnder discussed scientist Fritz Haber, and Prof. ?Smith? elaborated on the types of chemicals used in the conflict.",
        "Latino-American Veterans RoundtableFebruary 9Seven local Latino-American veterans participated in a roundtable discussion about their experiences at Fort Concho on February 9, 2016. George Marquez, Domingo Luna, America Garcia, Eugenio Garcia, Primo Gonzalez, Tony Ramirez, and Joe Arzate shared their experiences of service with the audience of 60. Prof. John Klingemann also delivered some opening remarks and placed the service of these individuals in historical context.",
        "Great War Lecture Series: Cornell History Professor Discusses How Culture Influenced Soldiers’ Experiences in WarNovember 16Prof. David J. Silbey, associate director of the Cornell in Washington Program and adjunct associate professor of history at Cornell University, visited with Angelo State history students before speaking to a 175-person audience as part of the “Great War Centennial Commemoration Lecture Series.” Silbey discussed how cultural backgrounds influence soldiers’ experiences on the battlefield.",
        "Bridging the Academic and Public DivideNovember 6Christine Lamberson, assistant professor and co-director of the “War Stories” project, published a post on the History News Network site. She describes a disconnect between academic scholarship focused on foreign policy, a public focused on “supporting the troops,” and veterans’ needs. She advocates increasing involvement in veteran-focused public history projects in order to bridge the gap. Read the post here."
    ],
    "table_headers": [],
    "table_data": [],
    "captions": [],
    "links": [
        "/live/news/16596-great-war-series-tcu-professor-discusses-wom",
        "/live/news/16595-angelo-state-university-faculty-and-students",
        "/live/news/16503-great-war-lecture-seriesfirst-humanities-mon",
        "/live/news/13700-great-war-series-antle-discusses-wartime",
        "/live/news/13571-great-war-series-professors-discuss-photogra",
        "/live/news/11101-great-war-lecture-series-chemical-warfare-in",
        "/live/news/11097-latino-american-veterans-roundtable",
        "/live/news/10719-great-war-lecture-series-cornell-history-pro"
    ],
    "tables": []
}