{
    "file_name": "sites-satisfactory-academic-progress.html",
    "title": "Satisfactory Academic Progress  · Angelo State University",
    "description": "To get and keep any financial aid, you must maintain ASU’s Satisfactory Academic Progress (SAP) standards. See this page for all the details.",
    "meta_tags": {
        "viewport": "width=device-width, initial-scale=1",
        "generator": "LiveWhale",
        "og:title": "Satisfactory Academic Progress",
        "og:type": "website",
        "og:url": "https://www.angelo.edu/admissions-and-aid/paying-for-college/satisfactory-academic-progress/",
        "pagename": "Satisfactory Academic Progress",
        "og:description": "To get and keep any financial aid, you must maintain ASU’s Satisfactory Academic Progress (SAP) standards. See this page for all the details.",
        "description": "To get and keep any financial aid, you must maintain ASU’s Satisfactory Academic Progress (SAP) standards. See this page for all the details.",
        "og:image": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "og:image:secure_url": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "og:image:width": "1260",
        "og:image:height": "630",
        "twitter:card": "summary_large_image",
        "twitter:title": "Satisfactory Academic Progress",
        "twitter:description": "To get and keep any financial aid, you must maintain ASU’s Satisfactory Academic Progress (SAP) standards. See this page for all the details.",
        "twitter:image": "https://www.angelo.edu/live/image/gid/38/width/1260/height/630/crop/1/46193_Header2.jpg",
        "lw-template-updated": "02/18/2022 08:50am CST"
    },
    "headings": [
        "Quick Links",
        "Information For",
        "Satisfactory Academic Progress (SAP) Policy",
        "Satisfactory Academic Progress Components",
        "1. Cumulative grade point average (GPA)",
        "2. Completion Rate (SCH)",
        "3. Maximum Hours (MAX)",
        "Failure to Meet a SAP Condition",
        "Academic Circumstances that affect your eligibility:",
        "SAP Notifications and Responsibilities",
        "Financial Aid for Repeated Coursework",
        "Example",
        "Appeals",
        "Helpful Information to consider when you are notified that you are not making SAP:",
        "How to file an appeal",
        "Questions? Contact Us!"
    ],
    "paragraphs": [
        "Federal regulations mandate institutions of higher education to establish policies to monitor the academic progress of all students who apply for and/or receive federal financial aid. Angelo State University (ASU) makes its minimum standards applicable to all federal, state and institutional financial aid programs for the purpose of maintaining a consistent policy for all financial aid applicants.",
        "The ASU Office of Financial Aid and Scholarships monitors Satisfactory Academic Progress (SAP) annually after the spring grades are posted of every enrolled student, regardless of whether they receive financial aid.",
        "Questions about the university’s satisfactory academic policy for the ASU Distinguished Scholarship Program, institutional scholarships or other endowed scholarships can be obtained from theOffice of Financial Aid and Scholarships.",
        "There are three components to SAP. Failure to comply with any component may result in a loss of aid eligibility. The three components are as follows:",
        "Students are required to complete a percentage of all credits hours attempted for all periods or enrollment, including transfer credit hours, regardless of whether or not financial aid was received. To determine if you are meeting this requirement, total cumulative earned hours are compared to total cumulative attempted hours. Courses that are dropped or withdrawn from are considered as attempted hours regardless of the time of drop/withdrawal or the grade received. Grades of F, NC, NP, PR, W, and I are considered credit hours attempted, but no successfully completed and/or earned.",
        "Students are expected to complete their degree program within a maximum time frame of 150% of the published length of the program of study. This also includes transfer hours earned as well as institutional attempted hours. Credit hours are cumulative; thus, students working towards obtaining more than one degree in the same category (e.g., double major) may reach this maximum time frame before completing their course of study and may need to appeal eligibility.",
        "Students who fail to meet one or more of the SAP components at the end of the semester will lose their federal and state eligibility immediately. A student who fails to complete a single course or has a complete withdrawal from Angelo State University after receiving financial aid may be automatically placed on suspension.",
        "Please note: Financial Aid Probation and Suspension are separate from ACADEMIC probation and suspension.",
        "Students failing to meet minimum requirements will be notified through their ASU email address, as well as RamPort. Students are held responsible for reading and understanding the Satisfactory Academic Progress eligibility requirements and knowing their status at the end of each semester.",
        "Students are responsible for submitting documentation and accurate information requested by the ASU Office of Financial Aid and Scholarships in a timely manner and keeping copies for their own records. Students are responsible for checking their RamPort account regularly.",
        "If questions arise, contact the Office of Office of Financial Aid and Scholarships at 325-942-2246.",
        "Recent federal regulations change the way enrollment status is determined for students who are repeating coursework in which they previously received a letter grade of D- or higher. An institution may pay a studentone timefor retaking previously-passed coursework. To determine a student’s enrollment status (full time vs. part time), the school maynotinclude more than one retake of a previously passed course.",
        "Two years ago, Sam enrolled in a three-hour Applied Mathematics course and received a grade of D-. Sam took the same course again last year and received a grade of C-. His major requires that he pass the class with a C or better, so Sam decides to take the course again this semester. Sam is enrolled in nine hours of other coursework, plus the Applied Math class, for a total of 12 hours. The three hours of that class are NOT included in determining Sam’s enrollment status for the current semester because it is the second time he is repeating a class in which he previously received a “passing” grade. Sam would be paid financial aid as apart-time studentbecause he is enrolled in 12 hours minus the three hours of the course he’s repeating for the second time, which do not count. For financial aid purposes, Sam is enrolled in nine eligible hours.",
        "If you feel that you had a special circumstance within the last 12 months that prevented you from making SAP, you can file an appeal. Some examples of special circumstances include:",
        "You will also need to provide backup documentation (e.g., obituaries, hospital bills, court orders) to substantiate your special circumstance.",
        "If you feel that you had aspecial circumstance within the last 12 monthsthat prevented you from making SAP, you can file an appeal. Some examples of special circumstances are the death of a close friend or family member, hospitalization or serious illness, legal issues, or other events of that magnitudeover which you had no control. Please note that if your reason for filing an appeal is not deemed a special circumstance, your appeal will be automatically denied. The decision of the appeal committee is final."
    ],
    "list_items": [
        "Apply",
        "Get Info",
        "Give",
        "AcademicsAcademic ProgramsDepartmentsCollegesCoursesAcademic Calendar",
        "Academic Programs",
        "Departments",
        "Colleges",
        "Courses",
        "Academic Calendar",
        "About ASUHistoryCore ValuesNewsTraditionsAbout San AngeloWelcome from the PresidentMission Statement",
        "History",
        "Core Values",
        "News",
        "Traditions",
        "About San Angelo",
        "Welcome from the President",
        "Mission Statement",
        "Admissions & AidApply to ASUAdmitted StudentsRequest More InformationVisit Angelo State UniversityPaying for College",
        "Apply to ASU",
        "Admitted Students",
        "Request More Information",
        "Visit Angelo State University",
        "Paying for College",
        "Life on CampusLivePlayLeadWorkExplore",
        "Live",
        "Play",
        "Lead",
        "Work",
        "Explore",
        "CommunityASU Mayer MuseumAlumni AssociationSmall Business Development CenterWest Texas CollectionNatural History CollectionsKay Bailey Hutchison Center for Cyber Intelligence, Innovation, and Security StudiesLaura W. Bush Institute for Women’s HealthArts at ASUPlanetariumStephens ChapelRanch and Meat MarketASU Ticket OfficeSummer Camps and Conferences",
        "ASU Mayer Museum",
        "Alumni Association",
        "Small Business Development Center",
        "West Texas Collection",
        "Natural History Collections",
        "Kay Bailey Hutchison Center for Cyber Intelligence, Innovation, and Security Studies",
        "Laura W. Bush Institute for Women’s Health",
        "Arts at ASU",
        "Planetarium",
        "Stephens Chapel",
        "Ranch and Meat Market",
        "ASU Ticket Office",
        "Summer Camps and Conferences",
        "Give to ASUMake a GiftSignature EventsJoin",
        "Make a Gift",
        "Signature Events",
        "Join",
        "Athletics",
        "RamPort",
        "Library",
        "Bookstore",
        "Events",
        "Public Health Updates",
        "Administration",
        "Research",
        "Mental Health Services",
        "Title IX/Incident Report",
        "En Español",
        "Current Students",
        "Faculty & Staff",
        "Admitted Students",
        "Military",
        "Parents & Families",
        "Alumni",
        "Visitors",
        "School Counselors",
        "Online Students",
        "ScholarshipsScholarships for New FreshmenScholarships for Current StudentsScholarships for Transfer StudentsScholarships for Graduate StudentsGeneral ASU ScholarshipsSpecial University ScholarshipsOrganizational ScholarshipsOutside ScholarshipsScholarships Frequently Asked Questions",
        "Scholarships for New Freshmen",
        "Scholarships for Current Students",
        "Scholarships for Transfer Students",
        "Scholarships for Graduate Students",
        "General ASU Scholarships",
        "Special University Scholarships",
        "Organizational Scholarships",
        "Outside Scholarships",
        "Scholarships Frequently Asked Questions",
        "LoansFederal Direct LoansFederal Direct PLUS Loan Application for Parents ProcessAlternative and College Access Loans",
        "Federal Direct Loans",
        "Federal Direct PLUS Loan Application for Parents Process",
        "Alternative and College Access Loans",
        "GrantsTEACH Grant Program",
        "TEACH Grant Program",
        "Work Study",
        "How to Apply for Financial AidAid EligibilityFAFSADetermining DependencyInformation on VerificationHow Enrollment Affects your Financial AidFinancial Aid Frequently Asked QuestionsScamsFinancial Aid Consumer Information",
        "Aid Eligibility",
        "FAFSADetermining DependencyInformation on Verification",
        "Determining Dependency",
        "Information on Verification",
        "How Enrollment Affects your Financial Aid",
        "Financial Aid Frequently Asked Questions",
        "Scams",
        "Financial Aid Consumer Information",
        "How to Pay Your Bill",
        "Tuition & FeesCosts of AttendanceTuition EstimatorCost EstimatorNet Price CalculatorTuition and Fees DocumentsIRS Tax & 1098-T InformationForm 1098-T Frequently Asked QuestionsExemptions and WaiversIn-State Tuition WaiverBlue and Gold GuaranteeBlue and Gold Guarantee Program RequirementsRenewal RequirementsBlue and Gold Guarantee FAQ",
        "Costs of Attendance",
        "Tuition Estimator",
        "Cost Estimator",
        "Net Price Calculator",
        "Tuition and Fees DocumentsIRS Tax & 1098-T InformationForm 1098-T Frequently Asked QuestionsExemptions and WaiversIn-State Tuition Waiver",
        "IRS Tax & 1098-T InformationForm 1098-T Frequently Asked Questions",
        "Form 1098-T Frequently Asked Questions",
        "Exemptions and Waivers",
        "In-State Tuition Waiver",
        "Blue and Gold GuaranteeBlue and Gold Guarantee Program RequirementsRenewal RequirementsBlue and Gold Guarantee FAQ",
        "Blue and Gold Guarantee Program Requirements",
        "Renewal Requirements",
        "Blue and Gold Guarantee FAQ",
        "Satisfactory Academic Progress",
        "Emergency FundsEmergency Short-Term LoansEmergency AidQualificationsDistribution of Emergency Aid",
        "Emergency Short-Term Loans",
        "Emergency AidQualificationsDistribution of Emergency Aid",
        "Qualifications",
        "Distribution of Emergency Aid",
        "Financial Aid Forms",
        "Special Circumstances",
        "Undergraduate Students (0 - 29 earned hours) : 1.80 GPA",
        "Undergraduate Students (30 or more earned hours): 2.00 GPA",
        "Graduate Students: 3.00 GPA",
        "Undergraduate Students (0 - 29 earned hours) : 62%",
        "Undergraduate Students (30 or more earned hours): 67%",
        "Graduate Students: 67%",
        "Undergraduate Program of Study: 180 hours",
        "Graduate Program of Study:MS in Organizational Psychology and Human Resources: 33 hoursMS in Counseling Psychology: 72 hoursMSN with Family Nurse Practitioner Option: 72 hoursDoctor of Physical Therapy: 149 hoursAll Other Graduate Programs: 54 hours",
        "MS in Organizational Psychology and Human Resources: 33 hours",
        "MS in Counseling Psychology: 72 hours",
        "MSN with Family Nurse Practitioner Option: 72 hours",
        "Doctor of Physical Therapy: 149 hours",
        "All Other Graduate Programs: 54 hours",
        "Suspension: will occur if a student fails to meet any of the SAP requirements and cannot reestablish SAP within one full-time (12 hour) semester. Suspension also occurs if a student fails to meet the terms of his or herFinancial Aid Probationand/or academic plan. Students cannot receive financial aid while suspended.",
        "Financial Aid Probation: A Student can be placed on Financial Aid Probation for one semester only. Any student that is approved through the appeal process shall be placed onFinancial Aid Probationand will be eligible to receive financial aid during this semester. A student placed onFinancial Aid Probationmay receive financial aid program funds for that semester. While on Financial Aid Probation, the student must meet the institution’s SAP standards by the end of the semester.",
        "Students placed on Financial Aid Probation with an Academic Plan or Graduation Plan for Financial Aid Eligibility must complete the requirements of the academic plan or graduation plan by the end of the semester. The academic and graduation plans are developed by the institution to assist the student in regaining their financial aid eligibility by regaining SAP. The student’s Financial Aid Agreement will explain all requirements that must be met during his/her probationary period to continue to receive financial aid.",
        "Pursue a degree at a lower level after earning a graduate degree.There is no additional eligibility if you earn a graduate degree and return to pursue another degree at the undergraduate level, or at a lower graduate level. If you change degree level from graduate to undergraduate, your SAP status must be reviewed to determine your eligibility.",
        "Incomplete grades, missing grades, failing grades and course withdrawalsall lower your completion ratio because they are counted as attempted, but not earned credits. They also are included in the calculation of maximum hours attempted.",
        "Courses taken for pass/fail gradesare included in both your maximum attempted credits and your completion ratio.",
        "Repeated coursescount as attempted credit hours each time you register for them, but reduce your completion ratio because they count as earned credits only once.",
        "Remedial coursescount as attempted, but not earned credits.",
        "Late posted grades or grade changeswill not change your status. You may request that your SAP status be recalculatedafter you have confirmedwith the Registrar’s Office that the grade change has been posted to your academic record.",
        "The death of a close friend or family member",
        "Hospitalization or serious illness",
        "Legal issues or other events of that magnitude over which you had no control.",
        "Before submitting an extenuating circumstance appeal, review the entire SAP policy to ensure you have met the necessary requirements to file an appeal.",
        "Lack of knowledge of the SAP standards will not be grounds for the approval of an appeal.",
        "Be specific when explaining your circumstances. Lack of information will result in a delay of an appeal review, or may result in a denial of your appeal. If there were problems with your physical or mental health that played a role in your circumstances, please attach supporting documentation from a doctor, counselor or hospital (if no documentation is available, be sure to explain in the appeal).",
        "Do not discuss your need for financial aid in your appeal. Needing financial aid is not a valid reason for approval of an appeal.",
        "Complete all items on the appeal form. Incomplete appeals will delay decisions.",
        "Go to theangelo.verifymyfafsa.comwebpage.",
        "Click on the SAP Appeal tab.",
        "Fill out the form in its entirety.Incomplete forms will not be processed.",
        "Once your appeal is under review, your SAP status inRamportwill show “Appeal in Review”.",
        "Pleaseallow at least ten business daysfrom the time your appeal is received for the committee to review your appeal.",
        "An email notification will be sent once a decision has been determined.",
        "2601 W. Avenue NSan Angelo, TX 76909",
        "1-800-946-8627",
        "Campus Map",
        "Contact ASU",
        "University Directory",
        "RamPort",
        "Jobs at ASU",
        "Facebook",
        "X",
        "Instagram",
        "YouTube",
        "©2024 Angelo State University",
        "All Rights Reserved",
        "Editor Login",
        "TTU System",
        "Texas Tech University",
        "TTU Health Sciences Center",
        "TTUHSC El Paso",
        "Midwestern State University",
        "ASU Privacy Policy",
        "Weather and Emergency Notifications",
        "Mental Health Services",
        "Title IX/Incident Report",
        "State of Texas",
        "Statewide Search",
        "Texas Homeland Security",
        "Texas Veterans Portal",
        "State Auditor’s Office",
        "Fraud Prevention",
        "Site Policies"
    ],
    "table_headers": [],
    "table_data": [],
    "captions": [],
    "links": [
        "#main-content",
        "/",
        "/admissions-and-aid/?utm_source=cta",
        "/admissions-and-aid/info/?utm_source=cta",
        "/leading-the-charge/?utm_source=cta",
        "/academics/",
        "/academics/programs/",
        "/departments/",
        "/colleges/",
        "/courses/",
        "/current-students/registrar/academic_calendar.php",
        "/about-asu/",
        "/about-asu/history.php",
        "/about-asu/core-values/",
        "/about-asu/news/",
        "/about-asu/traditions/",
        "/about-asu/san-angelo.php",
        "/about-asu/president/",
        "/about-asu/mission-statement.php",
        "/admissions-and-aid/",
        "/admissions-and-aid/apply/",
        "/admissions-and-aid/admitted/",
        "/admissions-and-aid/info/",
        "/admissions-and-aid/visit/",
        "/admissions-and-aid/paying-for-college/",
        "/life-on-campus/",
        "/life-on-campus/live/",
        "/life-on-campus/play/",
        "/life-on-campus/lead/",
        "/life-on-campus/work/",
        "/life-on-campus/explore/",
        "/community/",
        "/community/mayer-museum/",
        "/alumni/",
        "/community/small-business-development-center/",
        "/community/west-texas-collection/",
        "/departments/biology/angelo-state-natural-history-collection/",
        "/community/kay-bailey-hutchison-center/",
        "/colleges/archer-college-of-health-and-human-services/laura-w-bush-institute-for-womens-health/",
        "/departments/visual-performing-arts/theatre/subscriptions.php",
        "/departments/physics-geosciences/planetarium/",
        "/community/stephens-chapel.php",
        "/community/asu-ranch/",
        "/community/ticket-office/",
        "/community/summer-camps-and-conferences/",
        "/give/",
        "/give/make_gift/",
        "/give/signature-events/",
        "/give/join/",
        "https://www.angelosports.com/",
        "https://ramport.angelo.edu/",
        "/library/",
        "http://bookstore.angelo.edu/",
        "/events/",
        "/public-health/",
        "/administrative-support/",
        "/research/",
        "/current-students/counseling-services/",
        "/current-students/title-ix/",
        "/en-espanol/",
        "/current-students/",
        "/faculty-and-staff/",
        "/admissions-and-aid/admitted/",
        "/active-duty-veterans/",
        "/parents-and-families/",
        "/alumni/",
        "/visitors/",
        "/school-counselors/",
        "/online/",
        "/admissions-and-aid/paying-for-college/",
        "/admissions-and-aid/paying-for-college/scholarships/",
        "/admissions-and-aid/paying-for-college/scholarships/freshmen/",
        "/admissions-and-aid/paying-for-college/scholarships/current-students/",
        "/admissions-and-aid/paying-for-college/scholarships/transfer-students/",
        "/admissions-and-aid/paying-for-college/scholarships/graduate-students/",
        "/admissions-and-aid/paying-for-college/scholarships/general-scholarships.php",
        "/admissions-and-aid/paying-for-college/scholarships/special-university-scholarships.php",
        "/admissions-and-aid/paying-for-college/scholarships/organizational-scholarships.php",
        "/admissions-and-aid/paying-for-college/scholarships/outside-scholarships/",
        "/admissions-and-aid/paying-for-college/scholarships/scholarship-faq/",
        "/admissions-and-aid/paying-for-college/loans/",
        "/admissions-and-aid/paying-for-college/loans/federal-direct-loans.php",
        "/admissions-and-aid/paying-for-college/loans/parent-plus.php",
        "/admissions-and-aid/paying-for-college/loans/alternative-educations-loans.php",
        "/admissions-and-aid/paying-for-college/grants/",
        "/admissions-and-aid/paying-for-college/grants/teach-program.php",
        "/admissions-and-aid/paying-for-college/work-study.php",
        "/admissions-and-aid/paying-for-college/how-to-apply-for-financial-aid/",
        "/admissions-and-aid/paying-for-college/how-to-apply-for-financial-aid/aid_eligibility.php",
        "/admissions-and-aid/paying-for-college/how-to-apply-for-financial-aid/fafsa/",
        "/admissions-and-aid/paying-for-college/how-to-apply-for-financial-aid/fafsa/dependency.php",
        "/admissions-and-aid/paying-for-college/how-to-apply-for-financial-aid/fafsa/verification.php",
        "/admissions-and-aid/paying-for-college/how-to-apply-for-financial-aid/enrollment/",
        "/admissions-and-aid/paying-for-college/how-to-apply-for-financial-aid/faq.php",
        "/admissions-and-aid/paying-for-college/how-to-apply-for-financial-aid/scams.php",
        "/admissions-and-aid/paying-for-college/how-to-apply-for-financial-aid/consumer-information.php",
        "/admissions-and-aid/paying-for-college/how-to-pay-your-bill.php",
        "/admissions-and-aid/paying-for-college/tuition-and-fees/",
        "/admissions-and-aid/paying-for-college/tuition-and-fees/costs-of-attendance.php",
        "/admissions-and-aid/paying-for-college/tuition-and-fees/tuition-estimator.php",
        "/admissions-and-aid/paying-for-college/tuition-and-fees/cost-estimator.php",
        "/admissions-and-aid/paying-for-college/tuition-and-fees/net-price-calculator.php",
        "/admissions-and-aid/paying-for-college/tuition-and-fees/documents-forms-and-waivers/tuition-and-fees-documents.php",
        "/admissions-and-aid/paying-for-college/tuition-and-fees/documents-forms-and-waivers/1098T/",
        "/admissions-and-aid/paying-for-college/tuition-and-fees/documents-forms-and-waivers/1098T/FAQ.php",
        "/admissions-and-aid/paying-for-college/tuition-and-fees/documents-forms-and-waivers/exemptions-and-waivers.php",
        "/admissions-and-aid/paying-for-college/tuition-and-fees/documents-forms-and-waivers/in-state-tuition-waiver.php",
        "/admissions-and-aid/paying-for-college/blue-and-gold-guarantee/",
        "/admissions-and-aid/paying-for-college/blue-and-gold-guarantee/program-requirements.php",
        "/admissions-and-aid/paying-for-college/blue-and-gold-guarantee/renewal-requirements.php",
        "/admissions-and-aid/paying-for-college/blue-and-gold-guarantee/faq.php",
        "/admissions-and-aid/paying-for-college/satisfactory-academic-progress/",
        "/admissions-and-aid/paying-for-college/emergency-funds/",
        "/admissions-and-aid/paying-for-college/emergency-funds/short-term-loans.php",
        "/admissions-and-aid/paying-for-college/emergency-funds/emergency-aid/",
        "/admissions-and-aid/paying-for-college/emergency-funds/emergency-aid/qualifications.php",
        "/admissions-and-aid/paying-for-college/emergency-funds/emergency-aid/distribution-of-emergency-aid.php",
        "/admissions-and-aid/paying-for-college/how-to-apply-for-financial-aid/financial-aid-forms/",
        "/admissions-and-aid/paying-for-college/how-to-apply-for-financial-aid/special-circumstances.php",
        "/",
        "/admissions-and-aid/",
        "/admissions-and-aid/paying-for-college/",
        "/admissions-and-aid/paying-for-college/office-of-financial-aid-and-scholarships/",
        "http://angelo.verifymyfafsa.com",
        "http://ramport.angelo.edu",
        "mailto:financial.aid@angelo.edu",
        "/map/?Hardeman Student Services Center",
        "tel:18009468627",
        "/map/",
        "/contact/",
        "/directory/",
        "https://ramport.angelo.edu/",
        "/work-at-asu/",
        "https://www.facebook.com/angelostateuniversity",
        "https://twitter.com/AngeloState",
        "https://www.instagram.com/angelostate/",
        "https://www.youtube.com/user/AngeloStateU",
        "/livewhale/?login&referer=1",
        "http://www.texastech.edu/",
        "https://www.ttu.edu/",
        "https://www.ttuhsc.edu/",
        "https://elpaso.ttuhsc.edu/",
        "https://msutexas.edu/",
        "https://apps.highered.texas.gov/resumes/",
        "/privacy_policy.php",
        "/emergency-notifications/",
        "/current-students/counseling-services/",
        "/current-students/title-ix/",
        "https://www.texas.gov/",
        "https://www.tsl.texas.gov/trail/index.html",
        "https://gov.texas.gov/organization/hsgd",
        "https://veterans.portal.texas.gov/",
        "https://sao.fraud.texas.gov/",
        "/administrative-support/audit-services/fraud_prevention.php",
        "/site-policies/"
    ],
    "tables": []
}